<?xml version="1.0"?>
<CastXML format="1.2.1">

  <Typedef id="_3003" name="PFN_vkCmdTraceRaysKHR" type="_7742" context="_1" location="f7:13052" file="f7" line="13052"/>
  <Typedef id="_3004" name="PFN_vkCreateRayTracingPipelinesKHR" type="_7743" context="_1" location="f7:13053" file="f7" line="13053"/>
  <Typedef id="_3005" name="PFN_vkGetRayTracingCaptureReplayShaderGroupHandlesKHR" type="_6601" context="_1" location="f7:13054" file="f7" line="13054"/>
  <Typedef id="_3006" name="PFN_vkCmdTraceRaysIndirectKHR" type="_7744" context="_1" location="f7:13055" file="f7" line="13055"/>
  <Typedef id="_3007" name="PFN_vkGetRayTracingShaderGroupStackSizeKHR" type="_7745" context="_1" location="f7:13056" file="f7" line="13056"/>
  <Typedef id="_3008" name="PFN_vkCmdSetRayTracingPipelineStackSizeKHR" type="_4622" context="_1" location="f7:13057" file="f7" line="13057"/>
  <Function id="_3009" name="vkCmdTraceRaysKHR" returns="_4150" context="_1" location="f7:13060" file="f7" line="13060" mangled="_Z17vkCmdTraceRaysKHR">
    <Argument name="commandBuffer" type="_124" location="f7:13061" file="f7" line="13061"/>
    <Argument name="pRaygenShaderBindingTable" type="_7746" location="f7:13062" file="f7" line="13062"/>
    <Argument name="pMissShaderBindingTable" type="_7746" location="f7:13063" file="f7" line="13063"/>
    <Argument name="pHitShaderBindingTable" type="_7746" location="f7:13064" file="f7" line="13064"/>
    <Argument name="pCallableShaderBindingTable" type="_7746" location="f7:13065" file="f7" line="13065"/>
    <Argument name="width" type="_82" location="f7:13066" file="f7" line="13066"/>
    <Argument name="height" type="_82" location="f7:13067" file="f7" line="13067"/>
    <Argument name="depth" type="_82" location="f7:13068" file="f7" line="13068"/>
  </Function>
  <Function id="_3010" name="vkCreateRayTracingPipelinesKHR" returns="_160" context="_1" location="f7:13070" file="f7" line="13070" mangled="_Z30vkCreateRayTracingPipelinesKHR">
    <Argument name="device" type="_118" location="f7:13071" file="f7" line="13071"/>
    <Argument name="deferredOperation" type="_1719" location="f7:13072" file="f7" line="13072"/>
    <Argument name="pipelineCache" type="_140" location="f7:13073" file="f7" line="13073"/>
    <Argument name="createInfoCount" type="_82" location="f7:13074" file="f7" line="13074"/>
    <Argument name="pCreateInfos" type="_7747" location="f7:13075" file="f7" line="13075"/>
    <Argument name="pAllocator" type="_4148" location="f7:13076" file="f7" line="13076"/>
    <Argument name="pPipelines" type="_4201" location="f7:13077" file="f7" line="13077"/>
  </Function>
  <Function id="_3011" name="vkGetRayTracingCaptureReplayShaderGroupHandlesKHR" returns="_160" context="_1" location="f7:13079" file="f7" line="13079" mangled="_Z49vkGetRayTracingCaptureReplayShaderGroupHandlesKHR">
    <Argument name="device" type="_118" location="f7:13080" file="f7" line="13080"/>
    <Argument name="pipeline" type="_144" location="f7:13081" file="f7" line="13081"/>
    <Argument name="firstGroup" type="_82" location="f7:13082" file="f7" line="13082"/>
    <Argument name="groupCount" type="_82" location="f7:13083" file="f7" line="13083"/>
    <Argument name="dataSize" type="_8" location="f7:13084" file="f7" line="13084"/>
    <Argument name="pData" type="_3035" location="f7:13085" file="f7" line="13085"/>
  </Function>
  <Function id="_3012" name="vkCmdTraceRaysIndirectKHR" returns="_4150" context="_1" location="f7:13087" file="f7" line="13087" mangled="_Z25vkCmdTraceRaysIndirectKHR">
    <Argument name="commandBuffer" type="_124" location="f7:13088" file="f7" line="13088"/>
    <Argument name="pRaygenShaderBindingTable" type="_7746" location="f7:13089" file="f7" line="13089"/>
    <Argument name="pMissShaderBindingTable" type="_7746" location="f7:13090" file="f7" line="13090"/>
    <Argument name="pHitShaderBindingTable" type="_7746" location="f7:13091" file="f7" line="13091"/>
    <Argument name="pCallableShaderBindingTable" type="_7746" location="f7:13092" file="f7" line="13092"/>
    <Argument name="indirectDeviceAddress" type="_105" location="f7:13093" file="f7" line="13093"/>
  </Function>
  <Function id="_3013" name="vkGetRayTracingShaderGroupStackSizeKHR" returns="_106" context="_1" location="f7:13095" file="f7" line="13095" mangled="_Z38vkGetRayTracingShaderGroupStackSizeKHR">
    <Argument name="device" type="_118" location="f7:13096" file="f7" line="13096"/>
    <Argument name="pipeline" type="_144" location="f7:13097" file="f7" line="13097"/>
    <Argument name="group" type="_82" location="f7:13098" file="f7" line="13098"/>
    <Argument name="groupShader" type="_2988" location="f7:13099" file="f7" line="13099"/>
  </Function>
  <Function id="_3014" name="vkCmdSetRayTracingPipelineStackSizeKHR" returns="_4150" context="_1" location="f7:13101" file="f7" line="13101" mangled="_Z38vkCmdSetRayTracingPipelineStackSizeKHR">
    <Argument name="commandBuffer" type="_124" location="f7:13102" file="f7" line="13102"/>
    <Argument name="pipelineStackSize" type="_82" location="f7:13103" file="f7" line="13103"/>
  </Function>
  <Struct id="_3015" name="VkPhysicalDeviceRayQueryFeaturesKHR" context="_1" location="f7:13110" file="f7" line="13110" members="_7748 _7749 _7750" size="192" align="64"/>
  <Typedef id="_3016" name="VkPhysicalDeviceRayQueryFeaturesKHR" type="_7751" context="_1" location="f7:13114" file="f7" line="13114"/>
  <FundamentalType id="_3017" name="__int128" size="128" align="128"/>
  <FundamentalType id="_3018" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_3019" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_7752 _7753 _7754 _7755" size="256" align="64"/>
  <PointerType id="_3020" type="_7756" size="64" align="64"/>
  <ArrayType id="_3021" min="0" max="0" type="_7757"/>
  <FundamentalType id="_3022" name="long int" size="64" align="64"/>
  <FundamentalType id="_3023" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_3024" name="int" size="32" align="32"/>
  <Field id="_3025" name="__clang_max_align_nonce1" type="_7758" context="_10" access="public" location="f2:20" file="f2" line="20" offset="0"/>
  <Field id="_3026" name="__clang_max_align_nonce2" type="_7759" context="_10" access="public" location="f2:22" file="f2" line="22" offset="128"/>
  <ElaboratedType id="_3027" type="_10"/>
  <FundamentalType id="_3028" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_3029" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_3030" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_3031" name="signed char" size="8" align="8"/>
  <FundamentalType id="_3032" name="short int" size="16" align="16"/>
  <Field id="_3033" name="__val" type="_7760" context="_46" access="public" location="f3:155" file="f3" line="155" offset="0"/>
  <ElaboratedType id="_3034" type="_46"/>
  <PointerType id="_3035" type="_4150" size="64" align="64"/>
  <PointerType id="_3036" type="_7761" size="64" align="64"/>
  <PointerType id="_3037" type="_7762" size="64" align="64"/>
  <PointerType id="_3038" type="_7763" size="64" align="64"/>
  <PointerType id="_3039" type="_7764" size="64" align="64"/>
  <PointerType id="_3040" type="_7765" size="64" align="64"/>
  <PointerType id="_3041" type="_7766" size="64" align="64"/>
  <PointerType id="_3042" type="_7767" size="64" align="64"/>
  <PointerType id="_3043" type="_7768" size="64" align="64"/>
  <PointerType id="_3044" type="_7769" size="64" align="64"/>
  <PointerType id="_3045" type="_7770" size="64" align="64"/>
  <PointerType id="_3046" type="_7771" size="64" align="64"/>
  <PointerType id="_3047" type="_7772" size="64" align="64"/>
  <PointerType id="_3048" type="_7773" size="64" align="64"/>
  <PointerType id="_3049" type="_7774" size="64" align="64"/>
  <PointerType id="_3050" type="_7775" size="64" align="64"/>
  <PointerType id="_3051" type="_7776" size="64" align="64"/>
  <PointerType id="_3052" type="_7777" size="64" align="64"/>
  <PointerType id="_3053" type="_7778" size="64" align="64"/>
  <PointerType id="_3054" type="_7779" size="64" align="64"/>
  <PointerType id="_3055" type="_7780" size="64" align="64"/>
  <PointerType id="_3056" type="_7781" size="64" align="64"/>
  <PointerType id="_3057" type="_7782" size="64" align="64"/>
  <PointerType id="_3058" type="_7783" size="64" align="64"/>
  <PointerType id="_3059" type="_7784" size="64" align="64"/>
  <PointerType id="_3060" type="_7785" size="64" align="64"/>
  <ElaboratedType id="_3061" type="_159"/>
  <ElaboratedType id="_3062" type="_161"/>
  <ElaboratedType id="_3063" type="_163"/>
  <ElaboratedType id="_3064" type="_165"/>
  <ElaboratedType id="_3065" type="_167"/>
  <ElaboratedType id="_3066" type="_169"/>
  <ElaboratedType id="_3067" type="_171"/>
  <ElaboratedType id="_3068" type="_173"/>
  <ElaboratedType id="_3069" type="_175"/>
  <ElaboratedType id="_3070" type="_177"/>
  <ElaboratedType id="_3071" type="_179"/>
  <ElaboratedType id="_3072" type="_181"/>
  <ElaboratedType id="_3073" type="_183"/>
  <ElaboratedType id="_3074" type="_185"/>
  <ElaboratedType id="_3075" type="_187"/>
  <ElaboratedType id="_3076" type="_189"/>
  <ElaboratedType id="_3077" type="_191"/>
  <ElaboratedType id="_3078" type="_193"/>
  <ElaboratedType id="_3079" type="_195"/>
  <ElaboratedType id="_3080" type="_197"/>
  <ElaboratedType id="_3081" type="_199"/>
  <ElaboratedType id="_3082" type="_201"/>
  <ElaboratedType id="_3083" type="_203"/>
  <ElaboratedType id="_3084" type="_205"/>
  <ElaboratedType id="_3085" type="_207"/>
  <ElaboratedType id="_3086" type="_209"/>
  <ElaboratedType id="_3087" type="_211"/>
  <ElaboratedType id="_3088" type="_213"/>
  <ElaboratedType id="_3089" type="_215"/>
  <ElaboratedType id="_3090" type="_217"/>
  <ElaboratedType id="_3091" type="_219"/>
  <ElaboratedType id="_3092" type="_221"/>
  <ElaboratedType id="_3093" type="_223"/>
  <ElaboratedType id="_3094" type="_225"/>
  <ElaboratedType id="_3095" type="_227"/>
  <ElaboratedType id="_3096" type="_229"/>
  <ElaboratedType id="_3097" type="_231"/>
  <ElaboratedType id="_3098" type="_233"/>
  <ElaboratedType id="_3099" type="_236"/>
  <ElaboratedType id="_3100" type="_239"/>
  <ElaboratedType id="_3101" type="_242"/>
  <ElaboratedType id="_3102" type="_245"/>
  <ElaboratedType id="_3103" type="_248"/>
  <ElaboratedType id="_3104" type="_252"/>
  <ElaboratedType id="_3105" type="_255"/>
  <ElaboratedType id="_3106" type="_258"/>
  <ElaboratedType id="_3107" type="_262"/>
  <ElaboratedType id="_3108" type="_265"/>
  <ElaboratedType id="_3109" type="_269"/>
  <ElaboratedType id="_3110" type="_272"/>
  <ElaboratedType id="_3111" type="_275"/>
  <ElaboratedType id="_3112" type="_279"/>
  <ElaboratedType id="_3113" type="_282"/>
  <ElaboratedType id="_3114" type="_286"/>
  <ElaboratedType id="_3115" type="_289"/>
  <ElaboratedType id="_3116" type="_292"/>
  <ElaboratedType id="_3117" type="_296"/>
  <ElaboratedType id="_3118" type="_299"/>
  <ElaboratedType id="_3119" type="_302"/>
  <ElaboratedType id="_3120" type="_305"/>
  <ElaboratedType id="_3121" type="_308"/>
  <ElaboratedType id="_3122" type="_311"/>
  <ElaboratedType id="_3123" type="_314"/>
  <ElaboratedType id="_3124" type="_316"/>
  <ElaboratedType id="_3125" type="_330"/>
  <ElaboratedType id="_3126" type="_333"/>
  <ElaboratedType id="_3127" type="_337"/>
  <ElaboratedType id="_3128" type="_340"/>
  <ElaboratedType id="_3129" type="_343"/>
  <ElaboratedType id="_3130" type="_346"/>
  <ElaboratedType id="_3131" type="_349"/>
  <ElaboratedType id="_3132" type="_352"/>
  <ElaboratedType id="_3133" type="_355"/>
  <ElaboratedType id="_3134" type="_358"/>
  <ElaboratedType id="_3135" type="_361"/>
  <ElaboratedType id="_3136" type="_364"/>
  <ElaboratedType id="_3137" type="_367"/>
  <ElaboratedType id="_3138" type="_370"/>
  <Field id="_3139" name="width" type="_82" context="_373" access="public" location="f7:2338" file="f7" line="2338" offset="0"/>
  <Field id="_3140" name="height" type="_82" context="_373" access="public" location="f7:2339" file="f7" line="2339" offset="32"/>
  <ElaboratedType id="_3141" type="_373"/>
  <Field id="_3142" name="width" type="_82" context="_375" access="public" location="f7:2343" file="f7" line="2343" offset="0"/>
  <Field id="_3143" name="height" type="_82" context="_375" access="public" location="f7:2344" file="f7" line="2344" offset="32"/>
  <Field id="_3144" name="depth" type="_82" context="_375" access="public" location="f7:2345" file="f7" line="2345" offset="64"/>
  <ElaboratedType id="_3145" type="_375"/>
  <Field id="_3146" name="x" type="_78" context="_377" access="public" location="f7:2349" file="f7" line="2349" offset="0"/>
  <Field id="_3147" name="y" type="_78" context="_377" access="public" location="f7:2350" file="f7" line="2350" offset="32"/>
  <ElaboratedType id="_3148" type="_377"/>
  <Field id="_3149" name="x" type="_78" context="_379" access="public" location="f7:2354" file="f7" line="2354" offset="0"/>
  <Field id="_3150" name="y" type="_78" context="_379" access="public" location="f7:2355" file="f7" line="2355" offset="32"/>
  <Field id="_3151" name="z" type="_78" context="_379" access="public" location="f7:2356" file="f7" line="2356" offset="64"/>
  <ElaboratedType id="_3152" type="_379"/>
  <Field id="_3153" name="offset" type="_378" context="_381" access="public" location="f7:2360" file="f7" line="2360" offset="0"/>
  <Field id="_3154" name="extent" type="_374" context="_381" access="public" location="f7:2361" file="f7" line="2361" offset="64"/>
  <ElaboratedType id="_3155" type="_381"/>
  <Field id="_3156" name="sType" type="_162" context="_383" access="public" location="f7:2365" file="f7" line="2365" offset="0"/>
  <Field id="_3157" name="pNext" type="_7786" context="_383" access="public" location="f7:2366" file="f7" line="2366" offset="64"/>
  <ElaboratedType id="_3158" type="_383"/>
  <Field id="_3159" name="sType" type="_162" context="_385" access="public" location="f7:2370" file="f7" line="2370" offset="0"/>
  <Field id="_3160" name="pNext" type="_7787" context="_385" access="public" location="f7:2371" file="f7" line="2371" offset="64"/>
  <ElaboratedType id="_3161" type="_385"/>
  <Field id="_3162" name="sType" type="_162" context="_387" access="public" location="f7:2375" file="f7" line="2375" offset="0"/>
  <Field id="_3163" name="pNext" type="_4239" context="_387" access="public" location="f7:2376" file="f7" line="2376" offset="64"/>
  <Field id="_3164" name="srcAccessMask" type="_235" context="_387" access="public" location="f7:2377" file="f7" line="2377" offset="128"/>
  <Field id="_3165" name="dstAccessMask" type="_235" context="_387" access="public" location="f7:2378" file="f7" line="2378" offset="160"/>
  <Field id="_3166" name="srcQueueFamilyIndex" type="_82" context="_387" access="public" location="f7:2379" file="f7" line="2379" offset="192"/>
  <Field id="_3167" name="dstQueueFamilyIndex" type="_82" context="_387" access="public" location="f7:2380" file="f7" line="2380" offset="224"/>
  <Field id="_3168" name="buffer" type="_110" context="_387" access="public" location="f7:2381" file="f7" line="2381" offset="256"/>
  <Field id="_3169" name="offset" type="_106" context="_387" access="public" location="f7:2382" file="f7" line="2382" offset="320"/>
  <Field id="_3170" name="size" type="_106" context="_387" access="public" location="f7:2383" file="f7" line="2383" offset="384"/>
  <ElaboratedType id="_3171" type="_387"/>
  <Field id="_3172" name="x" type="_82" context="_389" access="public" location="f7:2387" file="f7" line="2387" offset="0"/>
  <Field id="_3173" name="y" type="_82" context="_389" access="public" location="f7:2388" file="f7" line="2388" offset="32"/>
  <Field id="_3174" name="z" type="_82" context="_389" access="public" location="f7:2389" file="f7" line="2389" offset="64"/>
  <ElaboratedType id="_3175" type="_389"/>
  <Field id="_3176" name="indexCount" type="_82" context="_391" access="public" location="f7:2393" file="f7" line="2393" offset="0"/>
  <Field id="_3177" name="instanceCount" type="_82" context="_391" access="public" location="f7:2394" file="f7" line="2394" offset="32"/>
  <Field id="_3178" name="firstIndex" type="_82" context="_391" access="public" location="f7:2395" file="f7" line="2395" offset="64"/>
  <Field id="_3179" name="vertexOffset" type="_78" context="_391" access="public" location="f7:2396" file="f7" line="2396" offset="96"/>
  <Field id="_3180" name="firstInstance" type="_82" context="_391" access="public" location="f7:2397" file="f7" line="2397" offset="128"/>
  <ElaboratedType id="_3181" type="_391"/>
  <Field id="_3182" name="vertexCount" type="_82" context="_393" access="public" location="f7:2401" file="f7" line="2401" offset="0"/>
  <Field id="_3183" name="instanceCount" type="_82" context="_393" access="public" location="f7:2402" file="f7" line="2402" offset="32"/>
  <Field id="_3184" name="firstVertex" type="_82" context="_393" access="public" location="f7:2403" file="f7" line="2403" offset="64"/>
  <Field id="_3185" name="firstInstance" type="_82" context="_393" access="public" location="f7:2404" file="f7" line="2404" offset="96"/>
  <ElaboratedType id="_3186" type="_393"/>
  <Field id="_3187" name="aspectMask" type="_238" context="_395" access="public" location="f7:2408" file="f7" line="2408" offset="0"/>
  <Field id="_3188" name="baseMipLevel" type="_82" context="_395" access="public" location="f7:2409" file="f7" line="2409" offset="32"/>
  <Field id="_3189" name="levelCount" type="_82" context="_395" access="public" location="f7:2410" file="f7" line="2410" offset="64"/>
  <Field id="_3190" name="baseArrayLayer" type="_82" context="_395" access="public" location="f7:2411" file="f7" line="2411" offset="96"/>
  <Field id="_3191" name="layerCount" type="_82" context="_395" access="public" location="f7:2412" file="f7" line="2412" offset="128"/>
  <ElaboratedType id="_3192" type="_395"/>
  <Field id="_3193" name="sType" type="_162" context="_397" access="public" location="f7:2416" file="f7" line="2416" offset="0"/>
  <Field id="_3194" name="pNext" type="_4239" context="_397" access="public" location="f7:2417" file="f7" line="2417" offset="64"/>
  <Field id="_3195" name="srcAccessMask" type="_235" context="_397" access="public" location="f7:2418" file="f7" line="2418" offset="128"/>
  <Field id="_3196" name="dstAccessMask" type="_235" context="_397" access="public" location="f7:2419" file="f7" line="2419" offset="160"/>
  <Field id="_3197" name="oldLayout" type="_164" context="_397" access="public" location="f7:2420" file="f7" line="2420" offset="192"/>
  <Field id="_3198" name="newLayout" type="_164" context="_397" access="public" location="f7:2421" file="f7" line="2421" offset="224"/>
  <Field id="_3199" name="srcQueueFamilyIndex" type="_82" context="_397" access="public" location="f7:2422" file="f7" line="2422" offset="256"/>
  <Field id="_3200" name="dstQueueFamilyIndex" type="_82" context="_397" access="public" location="f7:2423" file="f7" line="2423" offset="288"/>
  <Field id="_3201" name="image" type="_112" context="_397" access="public" location="f7:2424" file="f7" line="2424" offset="320"/>
  <Field id="_3202" name="subresourceRange" type="_396" context="_397" access="public" location="f7:2425" file="f7" line="2425" offset="384"/>
  <ElaboratedType id="_3203" type="_397"/>
  <Field id="_3204" name="sType" type="_162" context="_399" access="public" location="f7:2429" file="f7" line="2429" offset="0"/>
  <Field id="_3205" name="pNext" type="_4239" context="_399" access="public" location="f7:2430" file="f7" line="2430" offset="64"/>
  <Field id="_3206" name="srcAccessMask" type="_235" context="_399" access="public" location="f7:2431" file="f7" line="2431" offset="128"/>
  <Field id="_3207" name="dstAccessMask" type="_235" context="_399" access="public" location="f7:2432" file="f7" line="2432" offset="160"/>
  <ElaboratedType id="_3208" type="_399"/>
  <Field id="_3209" name="headerSize" type="_82" context="_401" access="public" location="f7:2436" file="f7" line="2436" offset="0"/>
  <Field id="_3210" name="headerVersion" type="_168" context="_401" access="public" location="f7:2437" file="f7" line="2437" offset="32"/>
  <Field id="_3211" name="vendorID" type="_82" context="_401" access="public" location="f7:2438" file="f7" line="2438" offset="64"/>
  <Field id="_3212" name="deviceID" type="_82" context="_401" access="public" location="f7:2439" file="f7" line="2439" offset="96"/>
  <Field id="_3213" name="pipelineCacheUUID" type="_7788" context="_401" access="public" location="f7:2440" file="f7" line="2440" offset="128"/>
  <ElaboratedType id="_3214" type="_401"/>
  <PointerType id="_3215" type="_7789" size="64" align="64"/>
  <PointerType id="_3216" type="_7790" size="64" align="64"/>
  <PointerType id="_3217" type="_7791" size="64" align="64"/>
  <PointerType id="_3218" type="_7792" size="64" align="64"/>
  <PointerType id="_3219" type="_7793" size="64" align="64"/>
  <Field id="_3220" name="pUserData" type="_3035" context="_409" access="public" location="f7:2474" file="f7" line="2474" offset="0"/>
  <Field id="_3221" name="pfnAllocation" type="_403" context="_409" access="public" location="f7:2475" file="f7" line="2475" offset="64"/>
  <Field id="_3222" name="pfnReallocation" type="_407" context="_409" access="public" location="f7:2476" file="f7" line="2476" offset="128"/>
  <Field id="_3223" name="pfnFree" type="_404" context="_409" access="public" location="f7:2477" file="f7" line="2477" offset="192"/>
  <Field id="_3224" name="pfnInternalAllocation" type="_405" context="_409" access="public" location="f7:2478" file="f7" line="2478" offset="256"/>
  <Field id="_3225" name="pfnInternalFree" type="_406" context="_409" access="public" location="f7:2479" file="f7" line="2479" offset="320"/>
  <ElaboratedType id="_3226" type="_409"/>
  <Field id="_3227" name="sType" type="_162" context="_411" access="public" location="f7:2483" file="f7" line="2483" offset="0"/>
  <Field id="_3228" name="pNext" type="_4239" context="_411" access="public" location="f7:2484" file="f7" line="2484" offset="64"/>
  <Field id="_3229" name="pApplicationName" type="_4159" context="_411" access="public" location="f7:2485" file="f7" line="2485" offset="128"/>
  <Field id="_3230" name="applicationVersion" type="_82" context="_411" access="public" location="f7:2486" file="f7" line="2486" offset="192"/>
  <Field id="_3231" name="pEngineName" type="_4159" context="_411" access="public" location="f7:2487" file="f7" line="2487" offset="256"/>
  <Field id="_3232" name="engineVersion" type="_82" context="_411" access="public" location="f7:2488" file="f7" line="2488" offset="320"/>
  <Field id="_3233" name="apiVersion" type="_82" context="_411" access="public" location="f7:2489" file="f7" line="2489" offset="352"/>
  <ElaboratedType id="_3234" type="_411"/>
  <Field id="_3235" name="linearTilingFeatures" type="_241" context="_413" access="public" location="f7:2493" file="f7" line="2493" offset="0"/>
  <Field id="_3236" name="optimalTilingFeatures" type="_241" context="_413" access="public" location="f7:2494" file="f7" line="2494" offset="32"/>
  <Field id="_3237" name="bufferFeatures" type="_241" context="_413" access="public" location="f7:2495" file="f7" line="2495" offset="64"/>
  <ElaboratedType id="_3238" type="_413"/>
  <Field id="_3239" name="maxExtent" type="_376" context="_415" access="public" location="f7:2499" file="f7" line="2499" offset="0"/>
  <Field id="_3240" name="maxMipLevels" type="_82" context="_415" access="public" location="f7:2500" file="f7" line="2500" offset="96"/>
  <Field id="_3241" name="maxArrayLayers" type="_82" context="_415" access="public" location="f7:2501" file="f7" line="2501" offset="128"/>
  <Field id="_3242" name="sampleCounts" type="_247" context="_415" access="public" location="f7:2502" file="f7" line="2502" offset="160"/>
  <Field id="_3243" name="maxResourceSize" type="_106" context="_415" access="public" location="f7:2503" file="f7" line="2503" offset="192"/>
  <ElaboratedType id="_3244" type="_415"/>
  <Field id="_3245" name="sType" type="_162" context="_417" access="public" location="f7:2507" file="f7" line="2507" offset="0"/>
  <Field id="_3246" name="pNext" type="_4239" context="_417" access="public" location="f7:2508" file="f7" line="2508" offset="64"/>
  <Field id="_3247" name="flags" type="_251" context="_417" access="public" location="f7:2509" file="f7" line="2509" offset="128"/>
  <Field id="_3248" name="pApplicationInfo" type="_7794" context="_417" access="public" location="f7:2510" file="f7" line="2510" offset="192"/>
  <Field id="_3249" name="enabledLayerCount" type="_82" context="_417" access="public" location="f7:2511" file="f7" line="2511" offset="256"/>
  <Field id="_3250" name="ppEnabledLayerNames" type="_7795" context="_417" access="public" location="f7:2512" file="f7" line="2512" offset="320"/>
  <Field id="_3251" name="enabledExtensionCount" type="_82" context="_417" access="public" location="f7:2513" file="f7" line="2513" offset="384"/>
  <Field id="_3252" name="ppEnabledExtensionNames" type="_7795" context="_417" access="public" location="f7:2514" file="f7" line="2514" offset="448"/>
  <ElaboratedType id="_3253" type="_417"/>
  <Field id="_3254" name="size" type="_106" context="_419" access="public" location="f7:2518" file="f7" line="2518" offset="0"/>
  <Field id="_3255" name="flags" type="_254" context="_419" access="public" location="f7:2519" file="f7" line="2519" offset="64"/>
  <ElaboratedType id="_3256" type="_419"/>
  <Field id="_3257" name="propertyFlags" type="_257" context="_421" access="public" location="f7:2523" file="f7" line="2523" offset="0"/>
  <Field id="_3258" name="heapIndex" type="_82" context="_421" access="public" location="f7:2524" file="f7" line="2524" offset="32"/>
  <ElaboratedType id="_3259" type="_421"/>
  <Field id="_3260" name="robustBufferAccess" type="_104" context="_423" access="public" location="f7:2528" file="f7" line="2528" offset="0"/>
  <Field id="_3261" name="fullDrawIndexUint32" type="_104" context="_423" access="public" location="f7:2529" file="f7" line="2529" offset="32"/>
  <Field id="_3262" name="imageCubeArray" type="_104" context="_423" access="public" location="f7:2530" file="f7" line="2530" offset="64"/>
  <Field id="_3263" name="independentBlend" type="_104" context="_423" access="public" location="f7:2531" file="f7" line="2531" offset="96"/>
  <Field id="_3264" name="geometryShader" type="_104" context="_423" access="public" location="f7:2532" file="f7" line="2532" offset="128"/>
  <Field id="_3265" name="tessellationShader" type="_104" context="_423" access="public" location="f7:2533" file="f7" line="2533" offset="160"/>
  <Field id="_3266" name="sampleRateShading" type="_104" context="_423" access="public" location="f7:2534" file="f7" line="2534" offset="192"/>
  <Field id="_3267" name="dualSrcBlend" type="_104" context="_423" access="public" location="f7:2535" file="f7" line="2535" offset="224"/>
  <Field id="_3268" name="logicOp" type="_104" context="_423" access="public" location="f7:2536" file="f7" line="2536" offset="256"/>
  <Field id="_3269" name="multiDrawIndirect" type="_104" context="_423" access="public" location="f7:2537" file="f7" line="2537" offset="288"/>
  <Field id="_3270" name="drawIndirectFirstInstance" type="_104" context="_423" access="public" location="f7:2538" file="f7" line="2538" offset="320"/>
  <Field id="_3271" name="depthClamp" type="_104" context="_423" access="public" location="f7:2539" file="f7" line="2539" offset="352"/>
  <Field id="_3272" name="depthBiasClamp" type="_104" context="_423" access="public" location="f7:2540" file="f7" line="2540" offset="384"/>
  <Field id="_3273" name="fillModeNonSolid" type="_104" context="_423" access="public" location="f7:2541" file="f7" line="2541" offset="416"/>
  <Field id="_3274" name="depthBounds" type="_104" context="_423" access="public" location="f7:2542" file="f7" line="2542" offset="448"/>
  <Field id="_3275" name="wideLines" type="_104" context="_423" access="public" location="f7:2543" file="f7" line="2543" offset="480"/>
  <Field id="_3276" name="largePoints" type="_104" context="_423" access="public" location="f7:2544" file="f7" line="2544" offset="512"/>
  <Field id="_3277" name="alphaToOne" type="_104" context="_423" access="public" location="f7:2545" file="f7" line="2545" offset="544"/>
  <Field id="_3278" name="multiViewport" type="_104" context="_423" access="public" location="f7:2546" file="f7" line="2546" offset="576"/>
  <Field id="_3279" name="samplerAnisotropy" type="_104" context="_423" access="public" location="f7:2547" file="f7" line="2547" offset="608"/>
  <Field id="_3280" name="textureCompressionETC2" type="_104" context="_423" access="public" location="f7:2548" file="f7" line="2548" offset="640"/>
  <Field id="_3281" name="textureCompressionASTC_LDR" type="_104" context="_423" access="public" location="f7:2549" file="f7" line="2549" offset="672"/>
  <Field id="_3282" name="textureCompressionBC" type="_104" context="_423" access="public" location="f7:2550" file="f7" line="2550" offset="704"/>
  <Field id="_3283" name="occlusionQueryPrecise" type="_104" context="_423" access="public" location="f7:2551" file="f7" line="2551" offset="736"/>
  <Field id="_3284" name="pipelineStatisticsQuery" type="_104" context="_423" access="public" location="f7:2552" file="f7" line="2552" offset="768"/>
  <Field id="_3285" name="vertexPipelineStoresAndAtomics" type="_104" context="_423" access="public" location="f7:2553" file="f7" line="2553" offset="800"/>
  <Field id="_3286" name="fragmentStoresAndAtomics" type="_104" context="_423" access="public" location="f7:2554" file="f7" line="2554" offset="832"/>
  <Field id="_3287" name="shaderTessellationAndGeometryPointSize" type="_104" context="_423" access="public" location="f7:2555" file="f7" line="2555" offset="864"/>
  <Field id="_3288" name="shaderImageGatherExtended" type="_104" context="_423" access="public" location="f7:2556" file="f7" line="2556" offset="896"/>
  <Field id="_3289" name="shaderStorageImageExtendedFormats" type="_104" context="_423" access="public" location="f7:2557" file="f7" line="2557" offset="928"/>
  <Field id="_3290" name="shaderStorageImageMultisample" type="_104" context="_423" access="public" location="f7:2558" file="f7" line="2558" offset="960"/>
  <Field id="_3291" name="shaderStorageImageReadWithoutFormat" type="_104" context="_423" access="public" location="f7:2559" file="f7" line="2559" offset="992"/>
  <Field id="_3292" name="shaderStorageImageWriteWithoutFormat" type="_104" context="_423" access="public" location="f7:2560" file="f7" line="2560" offset="1024"/>
  <Field id="_3293" name="shaderUniformBufferArrayDynamicIndexing" type="_104" context="_423" access="public" location="f7:2561" file="f7" line="2561" offset="1056"/>
  <Field id="_3294" name="shaderSampledImageArrayDynamicIndexing" type="_104" context="_423" access="public" location="f7:2562" file="f7" line="2562" offset="1088"/>
  <Field id="_3295" name="shaderStorageBufferArrayDynamicIndexing" type="_104" context="_423" access="public" location="f7:2563" file="f7" line="2563" offset="1120"/>
  <Field id="_3296" name="shaderStorageImageArrayDynamicIndexing" type="_104" context="_423" access="public" location="f7:2564" file="f7" line="2564" offset="1152"/>
  <Field id="_3297" name="shaderClipDistance" type="_104" context="_423" access="public" location="f7:2565" file="f7" line="2565" offset="1184"/>
  <Field id="_3298" name="shaderCullDistance" type="_104" context="_423" access="public" location="f7:2566" file="f7" line="2566" offset="1216"/>
  <Field id="_3299" name="shaderFloat64" type="_104" context="_423" access="public" location="f7:2567" file="f7" line="2567" offset="1248"/>
  <Field id="_3300" name="shaderInt64" type="_104" context="_423" access="public" location="f7:2568" file="f7" line="2568" offset="1280"/>
  <Field id="_3301" name="shaderInt16" type="_104" context="_423" access="public" location="f7:2569" file="f7" line="2569" offset="1312"/>
  <Field id="_3302" name="shaderResourceResidency" type="_104" context="_423" access="public" location="f7:2570" file="f7" line="2570" offset="1344"/>
  <Field id="_3303" name="shaderResourceMinLod" type="_104" context="_423" access="public" location="f7:2571" file="f7" line="2571" offset="1376"/>
  <Field id="_3304" name="sparseBinding" type="_104" context="_423" access="public" location="f7:2572" file="f7" line="2572" offset="1408"/>
  <Field id="_3305" name="sparseResidencyBuffer" type="_104" context="_423" access="public" location="f7:2573" file="f7" line="2573" offset="1440"/>
  <Field id="_3306" name="sparseResidencyImage2D" type="_104" context="_423" access="public" location="f7:2574" file="f7" line="2574" offset="1472"/>
  <Field id="_3307" name="sparseResidencyImage3D" type="_104" context="_423" access="public" location="f7:2575" file="f7" line="2575" offset="1504"/>
  <Field id="_3308" name="sparseResidency2Samples" type="_104" context="_423" access="public" location="f7:2576" file="f7" line="2576" offset="1536"/>
  <Field id="_3309" name="sparseResidency4Samples" type="_104" context="_423" access="public" location="f7:2577" file="f7" line="2577" offset="1568"/>
  <Field id="_3310" name="sparseResidency8Samples" type="_104" context="_423" access="public" location="f7:2578" file="f7" line="2578" offset="1600"/>
  <Field id="_3311" name="sparseResidency16Samples" type="_104" context="_423" access="public" location="f7:2579" file="f7" line="2579" offset="1632"/>
  <Field id="_3312" name="sparseResidencyAliased" type="_104" context="_423" access="public" location="f7:2580" file="f7" line="2580" offset="1664"/>
  <Field id="_3313" name="variableMultisampleRate" type="_104" context="_423" access="public" location="f7:2581" file="f7" line="2581" offset="1696"/>
  <Field id="_3314" name="inheritedQueries" type="_104" context="_423" access="public" location="f7:2582" file="f7" line="2582" offset="1728"/>
  <ElaboratedType id="_3315" type="_423"/>
  <Field id="_3316" name="maxImageDimension1D" type="_82" context="_425" access="public" location="f7:2586" file="f7" line="2586" offset="0"/>
  <Field id="_3317" name="maxImageDimension2D" type="_82" context="_425" access="public" location="f7:2587" file="f7" line="2587" offset="32"/>
  <Field id="_3318" name="maxImageDimension3D" type="_82" context="_425" access="public" location="f7:2588" file="f7" line="2588" offset="64"/>
  <Field id="_3319" name="maxImageDimensionCube" type="_82" context="_425" access="public" location="f7:2589" file="f7" line="2589" offset="96"/>
  <Field id="_3320" name="maxImageArrayLayers" type="_82" context="_425" access="public" location="f7:2590" file="f7" line="2590" offset="128"/>
  <Field id="_3321" name="maxTexelBufferElements" type="_82" context="_425" access="public" location="f7:2591" file="f7" line="2591" offset="160"/>
  <Field id="_3322" name="maxUniformBufferRange" type="_82" context="_425" access="public" location="f7:2592" file="f7" line="2592" offset="192"/>
  <Field id="_3323" name="maxStorageBufferRange" type="_82" context="_425" access="public" location="f7:2593" file="f7" line="2593" offset="224"/>
  <Field id="_3324" name="maxPushConstantsSize" type="_82" context="_425" access="public" location="f7:2594" file="f7" line="2594" offset="256"/>
  <Field id="_3325" name="maxMemoryAllocationCount" type="_82" context="_425" access="public" location="f7:2595" file="f7" line="2595" offset="288"/>
  <Field id="_3326" name="maxSamplerAllocationCount" type="_82" context="_425" access="public" location="f7:2596" file="f7" line="2596" offset="320"/>
  <Field id="_3327" name="bufferImageGranularity" type="_106" context="_425" access="public" location="f7:2597" file="f7" line="2597" offset="384"/>
  <Field id="_3328" name="sparseAddressSpaceSize" type="_106" context="_425" access="public" location="f7:2598" file="f7" line="2598" offset="448"/>
  <Field id="_3329" name="maxBoundDescriptorSets" type="_82" context="_425" access="public" location="f7:2599" file="f7" line="2599" offset="512"/>
  <Field id="_3330" name="maxPerStageDescriptorSamplers" type="_82" context="_425" access="public" location="f7:2600" file="f7" line="2600" offset="544"/>
  <Field id="_3331" name="maxPerStageDescriptorUniformBuffers" type="_82" context="_425" access="public" location="f7:2601" file="f7" line="2601" offset="576"/>
  <Field id="_3332" name="maxPerStageDescriptorStorageBuffers" type="_82" context="_425" access="public" location="f7:2602" file="f7" line="2602" offset="608"/>
  <Field id="_3333" name="maxPerStageDescriptorSampledImages" type="_82" context="_425" access="public" location="f7:2603" file="f7" line="2603" offset="640"/>
  <Field id="_3334" name="maxPerStageDescriptorStorageImages" type="_82" context="_425" access="public" location="f7:2604" file="f7" line="2604" offset="672"/>
  <Field id="_3335" name="maxPerStageDescriptorInputAttachments" type="_82" context="_425" access="public" location="f7:2605" file="f7" line="2605" offset="704"/>
  <Field id="_3336" name="maxPerStageResources" type="_82" context="_425" access="public" location="f7:2606" file="f7" line="2606" offset="736"/>
  <Field id="_3337" name="maxDescriptorSetSamplers" type="_82" context="_425" access="public" location="f7:2607" file="f7" line="2607" offset="768"/>
  <Field id="_3338" name="maxDescriptorSetUniformBuffers" type="_82" context="_425" access="public" location="f7:2608" file="f7" line="2608" offset="800"/>
  <Field id="_3339" name="maxDescriptorSetUniformBuffersDynamic" type="_82" context="_425" access="public" location="f7:2609" file="f7" line="2609" offset="832"/>
  <Field id="_3340" name="maxDescriptorSetStorageBuffers" type="_82" context="_425" access="public" location="f7:2610" file="f7" line="2610" offset="864"/>
  <Field id="_3341" name="maxDescriptorSetStorageBuffersDynamic" type="_82" context="_425" access="public" location="f7:2611" file="f7" line="2611" offset="896"/>
  <Field id="_3342" name="maxDescriptorSetSampledImages" type="_82" context="_425" access="public" location="f7:2612" file="f7" line="2612" offset="928"/>
  <Field id="_3343" name="maxDescriptorSetStorageImages" type="_82" context="_425" access="public" location="f7:2613" file="f7" line="2613" offset="960"/>
  <Field id="_3344" name="maxDescriptorSetInputAttachments" type="_82" context="_425" access="public" location="f7:2614" file="f7" line="2614" offset="992"/>
  <Field id="_3345" name="maxVertexInputAttributes" type="_82" context="_425" access="public" location="f7:2615" file="f7" line="2615" offset="1024"/>
  <Field id="_3346" name="maxVertexInputBindings" type="_82" context="_425" access="public" location="f7:2616" file="f7" line="2616" offset="1056"/>
  <Field id="_3347" name="maxVertexInputAttributeOffset" type="_82" context="_425" access="public" location="f7:2617" file="f7" line="2617" offset="1088"/>
  <Field id="_3348" name="maxVertexInputBindingStride" type="_82" context="_425" access="public" location="f7:2618" file="f7" line="2618" offset="1120"/>
  <Field id="_3349" name="maxVertexOutputComponents" type="_82" context="_425" access="public" location="f7:2619" file="f7" line="2619" offset="1152"/>
  <Field id="_3350" name="maxTessellationGenerationLevel" type="_82" context="_425" access="public" location="f7:2620" file="f7" line="2620" offset="1184"/>
  <Field id="_3351" name="maxTessellationPatchSize" type="_82" context="_425" access="public" location="f7:2621" file="f7" line="2621" offset="1216"/>
  <Field id="_3352" name="maxTessellationControlPerVertexInputComponents" type="_82" context="_425" access="public" location="f7:2622" file="f7" line="2622" offset="1248"/>
  <Field id="_3353" name="maxTessellationControlPerVertexOutputComponents" type="_82" context="_425" access="public" location="f7:2623" file="f7" line="2623" offset="1280"/>
  <Field id="_3354" name="maxTessellationControlPerPatchOutputComponents" type="_82" context="_425" access="public" location="f7:2624" file="f7" line="2624" offset="1312"/>
  <Field id="_3355" name="maxTessellationControlTotalOutputComponents" type="_82" context="_425" access="public" location="f7:2625" file="f7" line="2625" offset="1344"/>
  <Field id="_3356" name="maxTessellationEvaluationInputComponents" type="_82" context="_425" access="public" location="f7:2626" file="f7" line="2626" offset="1376"/>
  <Field id="_3357" name="maxTessellationEvaluationOutputComponents" type="_82" context="_425" access="public" location="f7:2627" file="f7" line="2627" offset="1408"/>
  <Field id="_3358" name="maxGeometryShaderInvocations" type="_82" context="_425" access="public" location="f7:2628" file="f7" line="2628" offset="1440"/>
  <Field id="_3359" name="maxGeometryInputComponents" type="_82" context="_425" access="public" location="f7:2629" file="f7" line="2629" offset="1472"/>
  <Field id="_3360" name="maxGeometryOutputComponents" type="_82" context="_425" access="public" location="f7:2630" file="f7" line="2630" offset="1504"/>
  <Field id="_3361" name="maxGeometryOutputVertices" type="_82" context="_425" access="public" location="f7:2631" file="f7" line="2631" offset="1536"/>
  <Field id="_3362" name="maxGeometryTotalOutputComponents" type="_82" context="_425" access="public" location="f7:2632" file="f7" line="2632" offset="1568"/>
  <Field id="_3363" name="maxFragmentInputComponents" type="_82" context="_425" access="public" location="f7:2633" file="f7" line="2633" offset="1600"/>
  <Field id="_3364" name="maxFragmentOutputAttachments" type="_82" context="_425" access="public" location="f7:2634" file="f7" line="2634" offset="1632"/>
  <Field id="_3365" name="maxFragmentDualSrcAttachments" type="_82" context="_425" access="public" location="f7:2635" file="f7" line="2635" offset="1664"/>
  <Field id="_3366" name="maxFragmentCombinedOutputResources" type="_82" context="_425" access="public" location="f7:2636" file="f7" line="2636" offset="1696"/>
  <Field id="_3367" name="maxComputeSharedMemorySize" type="_82" context="_425" access="public" location="f7:2637" file="f7" line="2637" offset="1728"/>
  <Field id="_3368" name="maxComputeWorkGroupCount" type="_7796" context="_425" access="public" location="f7:2638" file="f7" line="2638" offset="1760"/>
  <Field id="_3369" name="maxComputeWorkGroupInvocations" type="_82" context="_425" access="public" location="f7:2639" file="f7" line="2639" offset="1856"/>
  <Field id="_3370" name="maxComputeWorkGroupSize" type="_7796" context="_425" access="public" location="f7:2640" file="f7" line="2640" offset="1888"/>
  <Field id="_3371" name="subPixelPrecisionBits" type="_82" context="_425" access="public" location="f7:2641" file="f7" line="2641" offset="1984"/>
  <Field id="_3372" name="subTexelPrecisionBits" type="_82" context="_425" access="public" location="f7:2642" file="f7" line="2642" offset="2016"/>
  <Field id="_3373" name="mipmapPrecisionBits" type="_82" context="_425" access="public" location="f7:2643" file="f7" line="2643" offset="2048"/>
  <Field id="_3374" name="maxDrawIndexedIndexValue" type="_82" context="_425" access="public" location="f7:2644" file="f7" line="2644" offset="2080"/>
  <Field id="_3375" name="maxDrawIndirectCount" type="_82" context="_425" access="public" location="f7:2645" file="f7" line="2645" offset="2112"/>
  <Field id="_3376" name="maxSamplerLodBias" type="_4229" context="_425" access="public" location="f7:2646" file="f7" line="2646" offset="2144"/>
  <Field id="_3377" name="maxSamplerAnisotropy" type="_4229" context="_425" access="public" location="f7:2647" file="f7" line="2647" offset="2176"/>
  <Field id="_3378" name="maxViewports" type="_82" context="_425" access="public" location="f7:2648" file="f7" line="2648" offset="2208"/>
  <Field id="_3379" name="maxViewportDimensions" type="_7797" context="_425" access="public" location="f7:2649" file="f7" line="2649" offset="2240"/>
  <Field id="_3380" name="viewportBoundsRange" type="_7798" context="_425" access="public" location="f7:2650" file="f7" line="2650" offset="2304"/>
  <Field id="_3381" name="viewportSubPixelBits" type="_82" context="_425" access="public" location="f7:2651" file="f7" line="2651" offset="2368"/>
  <Field id="_3382" name="minMemoryMapAlignment" type="_8" context="_425" access="public" location="f7:2652" file="f7" line="2652" offset="2432"/>
  <Field id="_3383" name="minTexelBufferOffsetAlignment" type="_106" context="_425" access="public" location="f7:2653" file="f7" line="2653" offset="2496"/>
  <Field id="_3384" name="minUniformBufferOffsetAlignment" type="_106" context="_425" access="public" location="f7:2654" file="f7" line="2654" offset="2560"/>
  <Field id="_3385" name="minStorageBufferOffsetAlignment" type="_106" context="_425" access="public" location="f7:2655" file="f7" line="2655" offset="2624"/>
  <Field id="_3386" name="minTexelOffset" type="_78" context="_425" access="public" location="f7:2656" file="f7" line="2656" offset="2688"/>
  <Field id="_3387" name="maxTexelOffset" type="_82" context="_425" access="public" location="f7:2657" file="f7" line="2657" offset="2720"/>
  <Field id="_3388" name="minTexelGatherOffset" type="_78" context="_425" access="public" location="f7:2658" file="f7" line="2658" offset="2752"/>
  <Field id="_3389" name="maxTexelGatherOffset" type="_82" context="_425" access="public" location="f7:2659" file="f7" line="2659" offset="2784"/>
  <Field id="_3390" name="minInterpolationOffset" type="_4229" context="_425" access="public" location="f7:2660" file="f7" line="2660" offset="2816"/>
  <Field id="_3391" name="maxInterpolationOffset" type="_4229" context="_425" access="public" location="f7:2661" file="f7" line="2661" offset="2848"/>
  <Field id="_3392" name="subPixelInterpolationOffsetBits" type="_82" context="_425" access="public" location="f7:2662" file="f7" line="2662" offset="2880"/>
  <Field id="_3393" name="maxFramebufferWidth" type="_82" context="_425" access="public" location="f7:2663" file="f7" line="2663" offset="2912"/>
  <Field id="_3394" name="maxFramebufferHeight" type="_82" context="_425" access="public" location="f7:2664" file="f7" line="2664" offset="2944"/>
  <Field id="_3395" name="maxFramebufferLayers" type="_82" context="_425" access="public" location="f7:2665" file="f7" line="2665" offset="2976"/>
  <Field id="_3396" name="framebufferColorSampleCounts" type="_247" context="_425" access="public" location="f7:2666" file="f7" line="2666" offset="3008"/>
  <Field id="_3397" name="framebufferDepthSampleCounts" type="_247" context="_425" access="public" location="f7:2667" file="f7" line="2667" offset="3040"/>
  <Field id="_3398" name="framebufferStencilSampleCounts" type="_247" context="_425" access="public" location="f7:2668" file="f7" line="2668" offset="3072"/>
  <Field id="_3399" name="framebufferNoAttachmentsSampleCounts" type="_247" context="_425" access="public" location="f7:2669" file="f7" line="2669" offset="3104"/>
  <Field id="_3400" name="maxColorAttachments" type="_82" context="_425" access="public" location="f7:2670" file="f7" line="2670" offset="3136"/>
  <Field id="_3401" name="sampledImageColorSampleCounts" type="_247" context="_425" access="public" location="f7:2671" file="f7" line="2671" offset="3168"/>
  <Field id="_3402" name="sampledImageIntegerSampleCounts" type="_247" context="_425" access="public" location="f7:2672" file="f7" line="2672" offset="3200"/>
  <Field id="_3403" name="sampledImageDepthSampleCounts" type="_247" context="_425" access="public" location="f7:2673" file="f7" line="2673" offset="3232"/>
  <Field id="_3404" name="sampledImageStencilSampleCounts" type="_247" context="_425" access="public" location="f7:2674" file="f7" line="2674" offset="3264"/>
  <Field id="_3405" name="storageImageSampleCounts" type="_247" context="_425" access="public" location="f7:2675" file="f7" line="2675" offset="3296"/>
  <Field id="_3406" name="maxSampleMaskWords" type="_82" context="_425" access="public" location="f7:2676" file="f7" line="2676" offset="3328"/>
  <Field id="_3407" name="timestampComputeAndGraphics" type="_104" context="_425" access="public" location="f7:2677" file="f7" line="2677" offset="3360"/>
  <Field id="_3408" name="timestampPeriod" type="_4229" context="_425" access="public" location="f7:2678" file="f7" line="2678" offset="3392"/>
  <Field id="_3409" name="maxClipDistances" type="_82" context="_425" access="public" location="f7:2679" file="f7" line="2679" offset="3424"/>
  <Field id="_3410" name="maxCullDistances" type="_82" context="_425" access="public" location="f7:2680" file="f7" line="2680" offset="3456"/>
  <Field id="_3411" name="maxCombinedClipAndCullDistances" type="_82" context="_425" access="public" location="f7:2681" file="f7" line="2681" offset="3488"/>
  <Field id="_3412" name="discreteQueuePriorities" type="_82" context="_425" access="public" location="f7:2682" file="f7" line="2682" offset="3520"/>
  <Field id="_3413" name="pointSizeRange" type="_7798" context="_425" access="public" location="f7:2683" file="f7" line="2683" offset="3552"/>
  <Field id="_3414" name="lineWidthRange" type="_7798" context="_425" access="public" location="f7:2684" file="f7" line="2684" offset="3616"/>
  <Field id="_3415" name="pointSizeGranularity" type="_4229" context="_425" access="public" location="f7:2685" file="f7" line="2685" offset="3680"/>
  <Field id="_3416" name="lineWidthGranularity" type="_4229" context="_425" access="public" location="f7:2686" file="f7" line="2686" offset="3712"/>
  <Field id="_3417" name="strictLines" type="_104" context="_425" access="public" location="f7:2687" file="f7" line="2687" offset="3744"/>
  <Field id="_3418" name="standardSampleLocations" type="_104" context="_425" access="public" location="f7:2688" file="f7" line="2688" offset="3776"/>
  <Field id="_3419" name="optimalBufferCopyOffsetAlignment" type="_106" context="_425" access="public" location="f7:2689" file="f7" line="2689" offset="3840"/>
  <Field id="_3420" name="optimalBufferCopyRowPitchAlignment" type="_106" context="_425" access="public" location="f7:2690" file="f7" line="2690" offset="3904"/>
  <Field id="_3421" name="nonCoherentAtomSize" type="_106" context="_425" access="public" location="f7:2691" file="f7" line="2691" offset="3968"/>
  <ElaboratedType id="_3422" type="_425"/>
  <Field id="_3423" name="memoryTypeCount" type="_82" context="_427" access="public" location="f7:2695" file="f7" line="2695" offset="0"/>
  <Field id="_3424" name="memoryTypes" type="_7799" context="_427" access="public" location="f7:2696" file="f7" line="2696" offset="32"/>
  <Field id="_3425" name="memoryHeapCount" type="_82" context="_427" access="public" location="f7:2697" file="f7" line="2697" offset="2080"/>
  <Field id="_3426" name="memoryHeaps" type="_7800" context="_427" access="public" location="f7:2698" file="f7" line="2698" offset="2112"/>
  <ElaboratedType id="_3427" type="_427"/>
  <Field id="_3428" name="residencyStandard2DBlockShape" type="_104" context="_429" access="public" location="f7:2702" file="f7" line="2702" offset="0"/>
  <Field id="_3429" name="residencyStandard2DMultisampleBlockShape" type="_104" context="_429" access="public" location="f7:2703" file="f7" line="2703" offset="32"/>
  <Field id="_3430" name="residencyStandard3DBlockShape" type="_104" context="_429" access="public" location="f7:2704" file="f7" line="2704" offset="64"/>
  <Field id="_3431" name="residencyAlignedMipSize" type="_104" context="_429" access="public" location="f7:2705" file="f7" line="2705" offset="96"/>
  <Field id="_3432" name="residencyNonResidentStrict" type="_104" context="_429" access="public" location="f7:2706" file="f7" line="2706" offset="128"/>
  <ElaboratedType id="_3433" type="_429"/>
  <Field id="_3434" name="apiVersion" type="_82" context="_431" access="public" location="f7:2710" file="f7" line="2710" offset="0"/>
  <Field id="_3435" name="driverVersion" type="_82" context="_431" access="public" location="f7:2711" file="f7" line="2711" offset="32"/>
  <Field id="_3436" name="vendorID" type="_82" context="_431" access="public" location="f7:2712" file="f7" line="2712" offset="64"/>
  <Field id="_3437" name="deviceID" type="_82" context="_431" access="public" location="f7:2713" file="f7" line="2713" offset="96"/>
  <Field id="_3438" name="deviceType" type="_182" context="_431" access="public" location="f7:2714" file="f7" line="2714" offset="128"/>
  <Field id="_3439" name="deviceName" type="_7801" context="_431" access="public" location="f7:2715" file="f7" line="2715" offset="160"/>
  <Field id="_3440" name="pipelineCacheUUID" type="_7788" context="_431" access="public" location="f7:2716" file="f7" line="2716" offset="2208"/>
  <Field id="_3441" name="limits" type="_426" context="_431" access="public" location="f7:2717" file="f7" line="2717" offset="2368"/>
  <Field id="_3442" name="sparseProperties" type="_430" context="_431" access="public" location="f7:2718" file="f7" line="2718" offset="6400"/>
  <ElaboratedType id="_3443" type="_431"/>
  <Field id="_3444" name="queueFlags" type="_260" context="_433" access="public" location="f7:2722" file="f7" line="2722" offset="0"/>
  <Field id="_3445" name="queueCount" type="_82" context="_433" access="public" location="f7:2723" file="f7" line="2723" offset="32"/>
  <Field id="_3446" name="timestampValidBits" type="_82" context="_433" access="public" location="f7:2724" file="f7" line="2724" offset="64"/>
  <Field id="_3447" name="minImageTransferGranularity" type="_376" context="_433" access="public" location="f7:2725" file="f7" line="2725" offset="96"/>
  <ElaboratedType id="_3448" type="_433"/>
  <Field id="_3449" name="sType" type="_162" context="_435" access="public" location="f7:2729" file="f7" line="2729" offset="0"/>
  <Field id="_3450" name="pNext" type="_4239" context="_435" access="public" location="f7:2730" file="f7" line="2730" offset="64"/>
  <Field id="_3451" name="flags" type="_264" context="_435" access="public" location="f7:2731" file="f7" line="2731" offset="128"/>
  <Field id="_3452" name="queueFamilyIndex" type="_82" context="_435" access="public" location="f7:2732" file="f7" line="2732" offset="160"/>
  <Field id="_3453" name="queueCount" type="_82" context="_435" access="public" location="f7:2733" file="f7" line="2733" offset="192"/>
  <Field id="_3454" name="pQueuePriorities" type="_4230" context="_435" access="public" location="f7:2734" file="f7" line="2734" offset="256"/>
  <ElaboratedType id="_3455" type="_435"/>
  <Field id="_3456" name="sType" type="_162" context="_437" access="public" location="f7:2738" file="f7" line="2738" offset="0"/>
  <Field id="_3457" name="pNext" type="_4239" context="_437" access="public" location="f7:2739" file="f7" line="2739" offset="64"/>
  <Field id="_3458" name="flags" type="_261" context="_437" access="public" location="f7:2740" file="f7" line="2740" offset="128"/>
  <Field id="_3459" name="queueCreateInfoCount" type="_82" context="_437" access="public" location="f7:2741" file="f7" line="2741" offset="160"/>
  <Field id="_3460" name="pQueueCreateInfos" type="_7802" context="_437" access="public" location="f7:2742" file="f7" line="2742" offset="192"/>
  <Field id="_3461" name="enabledLayerCount" type="_82" context="_437" access="public" location="f7:2743" file="f7" line="2743" offset="256"/>
  <Field id="_3462" name="ppEnabledLayerNames" type="_7795" context="_437" access="public" location="f7:2744" file="f7" line="2744" offset="320"/>
  <Field id="_3463" name="enabledExtensionCount" type="_82" context="_437" access="public" location="f7:2745" file="f7" line="2745" offset="384"/>
  <Field id="_3464" name="ppEnabledExtensionNames" type="_7795" context="_437" access="public" location="f7:2746" file="f7" line="2746" offset="448"/>
  <Field id="_3465" name="pEnabledFeatures" type="_7803" context="_437" access="public" location="f7:2747" file="f7" line="2747" offset="512"/>
  <ElaboratedType id="_3466" type="_437"/>
  <Field id="_3467" name="extensionName" type="_7801" context="_439" access="public" location="f7:2751" file="f7" line="2751" offset="0"/>
  <Field id="_3468" name="specVersion" type="_82" context="_439" access="public" location="f7:2752" file="f7" line="2752" offset="2048"/>
  <ElaboratedType id="_3469" type="_439"/>
  <Field id="_3470" name="layerName" type="_7801" context="_441" access="public" location="f7:2756" file="f7" line="2756" offset="0"/>
  <Field id="_3471" name="specVersion" type="_82" context="_441" access="public" location="f7:2757" file="f7" line="2757" offset="2048"/>
  <Field id="_3472" name="implementationVersion" type="_82" context="_441" access="public" location="f7:2758" file="f7" line="2758" offset="2080"/>
  <Field id="_3473" name="description" type="_7801" context="_441" access="public" location="f7:2759" file="f7" line="2759" offset="2112"/>
  <ElaboratedType id="_3474" type="_441"/>
  <Field id="_3475" name="sType" type="_162" context="_443" access="public" location="f7:2763" file="f7" line="2763" offset="0"/>
  <Field id="_3476" name="pNext" type="_4239" context="_443" access="public" location="f7:2764" file="f7" line="2764" offset="64"/>
  <Field id="_3477" name="waitSemaphoreCount" type="_82" context="_443" access="public" location="f7:2765" file="f7" line="2765" offset="128"/>
  <Field id="_3478" name="pWaitSemaphores" type="_7804" context="_443" access="public" location="f7:2766" file="f7" line="2766" offset="192"/>
  <Field id="_3479" name="pWaitDstStageMask" type="_7805" context="_443" access="public" location="f7:2767" file="f7" line="2767" offset="256"/>
  <Field id="_3480" name="commandBufferCount" type="_82" context="_443" access="public" location="f7:2768" file="f7" line="2768" offset="320"/>
  <Field id="_3481" name="pCommandBuffers" type="_4225" context="_443" access="public" location="f7:2769" file="f7" line="2769" offset="384"/>
  <Field id="_3482" name="signalSemaphoreCount" type="_82" context="_443" access="public" location="f7:2770" file="f7" line="2770" offset="448"/>
  <Field id="_3483" name="pSignalSemaphores" type="_7804" context="_443" access="public" location="f7:2771" file="f7" line="2771" offset="512"/>
  <ElaboratedType id="_3484" type="_443"/>
  <Field id="_3485" name="sType" type="_162" context="_445" access="public" location="f7:2775" file="f7" line="2775" offset="0"/>
  <Field id="_3486" name="pNext" type="_4239" context="_445" access="public" location="f7:2776" file="f7" line="2776" offset="64"/>
  <Field id="_3487" name="memory" type="_128" context="_445" access="public" location="f7:2777" file="f7" line="2777" offset="128"/>
  <Field id="_3488" name="offset" type="_106" context="_445" access="public" location="f7:2778" file="f7" line="2778" offset="192"/>
  <Field id="_3489" name="size" type="_106" context="_445" access="public" location="f7:2779" file="f7" line="2779" offset="256"/>
  <ElaboratedType id="_3490" type="_445"/>
  <Field id="_3491" name="sType" type="_162" context="_447" access="public" location="f7:2783" file="f7" line="2783" offset="0"/>
  <Field id="_3492" name="pNext" type="_4239" context="_447" access="public" location="f7:2784" file="f7" line="2784" offset="64"/>
  <Field id="_3493" name="allocationSize" type="_106" context="_447" access="public" location="f7:2785" file="f7" line="2785" offset="128"/>
  <Field id="_3494" name="memoryTypeIndex" type="_82" context="_447" access="public" location="f7:2786" file="f7" line="2786" offset="192"/>
  <ElaboratedType id="_3495" type="_447"/>
  <Field id="_3496" name="size" type="_106" context="_449" access="public" location="f7:2790" file="f7" line="2790" offset="0"/>
  <Field id="_3497" name="alignment" type="_106" context="_449" access="public" location="f7:2791" file="f7" line="2791" offset="64"/>
  <Field id="_3498" name="memoryTypeBits" type="_82" context="_449" access="public" location="f7:2792" file="f7" line="2792" offset="128"/>
  <ElaboratedType id="_3499" type="_449"/>
  <Field id="_3500" name="resourceOffset" type="_106" context="_451" access="public" location="f7:2796" file="f7" line="2796" offset="0"/>
  <Field id="_3501" name="size" type="_106" context="_451" access="public" location="f7:2797" file="f7" line="2797" offset="64"/>
  <Field id="_3502" name="memory" type="_128" context="_451" access="public" location="f7:2798" file="f7" line="2798" offset="128"/>
  <Field id="_3503" name="memoryOffset" type="_106" context="_451" access="public" location="f7:2799" file="f7" line="2799" offset="192"/>
  <Field id="_3504" name="flags" type="_271" context="_451" access="public" location="f7:2800" file="f7" line="2800" offset="256"/>
  <ElaboratedType id="_3505" type="_451"/>
  <Field id="_3506" name="buffer" type="_110" context="_453" access="public" location="f7:2804" file="f7" line="2804" offset="0"/>
  <Field id="_3507" name="bindCount" type="_82" context="_453" access="public" location="f7:2805" file="f7" line="2805" offset="64"/>
  <Field id="_3508" name="pBinds" type="_7806" context="_453" access="public" location="f7:2806" file="f7" line="2806" offset="128"/>
  <ElaboratedType id="_3509" type="_453"/>
  <Field id="_3510" name="image" type="_112" context="_455" access="public" location="f7:2810" file="f7" line="2810" offset="0"/>
  <Field id="_3511" name="bindCount" type="_82" context="_455" access="public" location="f7:2811" file="f7" line="2811" offset="64"/>
  <Field id="_3512" name="pBinds" type="_7806" context="_455" access="public" location="f7:2812" file="f7" line="2812" offset="128"/>
  <ElaboratedType id="_3513" type="_455"/>
  <Field id="_3514" name="aspectMask" type="_238" context="_457" access="public" location="f7:2816" file="f7" line="2816" offset="0"/>
  <Field id="_3515" name="mipLevel" type="_82" context="_457" access="public" location="f7:2817" file="f7" line="2817" offset="32"/>
  <Field id="_3516" name="arrayLayer" type="_82" context="_457" access="public" location="f7:2818" file="f7" line="2818" offset="64"/>
  <ElaboratedType id="_3517" type="_457"/>
  <Field id="_3518" name="subresource" type="_458" context="_459" access="public" location="f7:2822" file="f7" line="2822" offset="0"/>
  <Field id="_3519" name="offset" type="_380" context="_459" access="public" location="f7:2823" file="f7" line="2823" offset="96"/>
  <Field id="_3520" name="extent" type="_376" context="_459" access="public" location="f7:2824" file="f7" line="2824" offset="192"/>
  <Field id="_3521" name="memory" type="_128" context="_459" access="public" location="f7:2825" file="f7" line="2825" offset="320"/>
  <Field id="_3522" name="memoryOffset" type="_106" context="_459" access="public" location="f7:2826" file="f7" line="2826" offset="384"/>
  <Field id="_3523" name="flags" type="_271" context="_459" access="public" location="f7:2827" file="f7" line="2827" offset="448"/>
  <ElaboratedType id="_3524" type="_459"/>
  <Field id="_3525" name="image" type="_112" context="_461" access="public" location="f7:2831" file="f7" line="2831" offset="0"/>
  <Field id="_3526" name="bindCount" type="_82" context="_461" access="public" location="f7:2832" file="f7" line="2832" offset="64"/>
  <Field id="_3527" name="pBinds" type="_7807" context="_461" access="public" location="f7:2833" file="f7" line="2833" offset="128"/>
  <ElaboratedType id="_3528" type="_461"/>
  <Field id="_3529" name="sType" type="_162" context="_463" access="public" location="f7:2837" file="f7" line="2837" offset="0"/>
  <Field id="_3530" name="pNext" type="_4239" context="_463" access="public" location="f7:2838" file="f7" line="2838" offset="64"/>
  <Field id="_3531" name="waitSemaphoreCount" type="_82" context="_463" access="public" location="f7:2839" file="f7" line="2839" offset="128"/>
  <Field id="_3532" name="pWaitSemaphores" type="_7804" context="_463" access="public" location="f7:2840" file="f7" line="2840" offset="192"/>
  <Field id="_3533" name="bufferBindCount" type="_82" context="_463" access="public" location="f7:2841" file="f7" line="2841" offset="256"/>
  <Field id="_3534" name="pBufferBinds" type="_7808" context="_463" access="public" location="f7:2842" file="f7" line="2842" offset="320"/>
  <Field id="_3535" name="imageOpaqueBindCount" type="_82" context="_463" access="public" location="f7:2843" file="f7" line="2843" offset="384"/>
  <Field id="_3536" name="pImageOpaqueBinds" type="_7809" context="_463" access="public" location="f7:2844" file="f7" line="2844" offset="448"/>
  <Field id="_3537" name="imageBindCount" type="_82" context="_463" access="public" location="f7:2845" file="f7" line="2845" offset="512"/>
  <Field id="_3538" name="pImageBinds" type="_7810" context="_463" access="public" location="f7:2846" file="f7" line="2846" offset="576"/>
  <Field id="_3539" name="signalSemaphoreCount" type="_82" context="_463" access="public" location="f7:2847" file="f7" line="2847" offset="640"/>
  <Field id="_3540" name="pSignalSemaphores" type="_7804" context="_463" access="public" location="f7:2848" file="f7" line="2848" offset="704"/>
  <ElaboratedType id="_3541" type="_463"/>
  <Field id="_3542" name="aspectMask" type="_238" context="_465" access="public" location="f7:2852" file="f7" line="2852" offset="0"/>
  <Field id="_3543" name="imageGranularity" type="_376" context="_465" access="public" location="f7:2853" file="f7" line="2853" offset="32"/>
  <Field id="_3544" name="flags" type="_274" context="_465" access="public" location="f7:2854" file="f7" line="2854" offset="128"/>
  <ElaboratedType id="_3545" type="_465"/>
  <Field id="_3546" name="formatProperties" type="_466" context="_467" access="public" location="f7:2858" file="f7" line="2858" offset="0"/>
  <Field id="_3547" name="imageMipTailFirstLod" type="_82" context="_467" access="public" location="f7:2859" file="f7" line="2859" offset="160"/>
  <Field id="_3548" name="imageMipTailSize" type="_106" context="_467" access="public" location="f7:2860" file="f7" line="2860" offset="192"/>
  <Field id="_3549" name="imageMipTailOffset" type="_106" context="_467" access="public" location="f7:2861" file="f7" line="2861" offset="256"/>
  <Field id="_3550" name="imageMipTailStride" type="_106" context="_467" access="public" location="f7:2862" file="f7" line="2862" offset="320"/>
  <ElaboratedType id="_3551" type="_467"/>
  <Field id="_3552" name="sType" type="_162" context="_469" access="public" location="f7:2866" file="f7" line="2866" offset="0"/>
  <Field id="_3553" name="pNext" type="_4239" context="_469" access="public" location="f7:2867" file="f7" line="2867" offset="64"/>
  <Field id="_3554" name="flags" type="_277" context="_469" access="public" location="f7:2868" file="f7" line="2868" offset="128"/>
  <ElaboratedType id="_3555" type="_469"/>
  <Field id="_3556" name="sType" type="_162" context="_471" access="public" location="f7:2872" file="f7" line="2872" offset="0"/>
  <Field id="_3557" name="pNext" type="_4239" context="_471" access="public" location="f7:2873" file="f7" line="2873" offset="64"/>
  <Field id="_3558" name="flags" type="_278" context="_471" access="public" location="f7:2874" file="f7" line="2874" offset="128"/>
  <ElaboratedType id="_3559" type="_471"/>
  <Field id="_3560" name="sType" type="_162" context="_473" access="public" location="f7:2878" file="f7" line="2878" offset="0"/>
  <Field id="_3561" name="pNext" type="_4239" context="_473" access="public" location="f7:2879" file="f7" line="2879" offset="64"/>
  <Field id="_3562" name="flags" type="_281" context="_473" access="public" location="f7:2880" file="f7" line="2880" offset="128"/>
  <ElaboratedType id="_3563" type="_473"/>
  <Field id="_3564" name="sType" type="_162" context="_475" access="public" location="f7:2884" file="f7" line="2884" offset="0"/>
  <Field id="_3565" name="pNext" type="_4239" context="_475" access="public" location="f7:2885" file="f7" line="2885" offset="64"/>
  <Field id="_3566" name="flags" type="_285" context="_475" access="public" location="f7:2886" file="f7" line="2886" offset="128"/>
  <Field id="_3567" name="queryType" type="_184" context="_475" access="public" location="f7:2887" file="f7" line="2887" offset="160"/>
  <Field id="_3568" name="queryCount" type="_82" context="_475" access="public" location="f7:2888" file="f7" line="2888" offset="192"/>
  <Field id="_3569" name="pipelineStatistics" type="_284" context="_475" access="public" location="f7:2889" file="f7" line="2889" offset="224"/>
  <ElaboratedType id="_3570" type="_475"/>
  <Field id="_3571" name="sType" type="_162" context="_477" access="public" location="f7:2893" file="f7" line="2893" offset="0"/>
  <Field id="_3572" name="pNext" type="_4239" context="_477" access="public" location="f7:2894" file="f7" line="2894" offset="64"/>
  <Field id="_3573" name="flags" type="_291" context="_477" access="public" location="f7:2895" file="f7" line="2895" offset="128"/>
  <Field id="_3574" name="size" type="_106" context="_477" access="public" location="f7:2896" file="f7" line="2896" offset="192"/>
  <Field id="_3575" name="usage" type="_294" context="_477" access="public" location="f7:2897" file="f7" line="2897" offset="256"/>
  <Field id="_3576" name="sharingMode" type="_186" context="_477" access="public" location="f7:2898" file="f7" line="2898" offset="288"/>
  <Field id="_3577" name="queueFamilyIndexCount" type="_82" context="_477" access="public" location="f7:2899" file="f7" line="2899" offset="320"/>
  <Field id="_3578" name="pQueueFamilyIndices" type="_4232" context="_477" access="public" location="f7:2900" file="f7" line="2900" offset="384"/>
  <ElaboratedType id="_3579" type="_477"/>
  <Field id="_3580" name="sType" type="_162" context="_479" access="public" location="f7:2904" file="f7" line="2904" offset="0"/>
  <Field id="_3581" name="pNext" type="_4239" context="_479" access="public" location="f7:2905" file="f7" line="2905" offset="64"/>
  <Field id="_3582" name="flags" type="_295" context="_479" access="public" location="f7:2906" file="f7" line="2906" offset="128"/>
  <Field id="_3583" name="buffer" type="_110" context="_479" access="public" location="f7:2907" file="f7" line="2907" offset="192"/>
  <Field id="_3584" name="format" type="_176" context="_479" access="public" location="f7:2908" file="f7" line="2908" offset="256"/>
  <Field id="_3585" name="offset" type="_106" context="_479" access="public" location="f7:2909" file="f7" line="2909" offset="320"/>
  <Field id="_3586" name="range" type="_106" context="_479" access="public" location="f7:2910" file="f7" line="2910" offset="384"/>
  <ElaboratedType id="_3587" type="_479"/>
  <Field id="_3588" name="sType" type="_162" context="_481" access="public" location="f7:2914" file="f7" line="2914" offset="0"/>
  <Field id="_3589" name="pNext" type="_4239" context="_481" access="public" location="f7:2915" file="f7" line="2915" offset="64"/>
  <Field id="_3590" name="flags" type="_244" context="_481" access="public" location="f7:2916" file="f7" line="2916" offset="128"/>
  <Field id="_3591" name="imageType" type="_180" context="_481" access="public" location="f7:2917" file="f7" line="2917" offset="160"/>
  <Field id="_3592" name="format" type="_176" context="_481" access="public" location="f7:2918" file="f7" line="2918" offset="192"/>
  <Field id="_3593" name="extent" type="_376" context="_481" access="public" location="f7:2919" file="f7" line="2919" offset="224"/>
  <Field id="_3594" name="mipLevels" type="_82" context="_481" access="public" location="f7:2920" file="f7" line="2920" offset="320"/>
  <Field id="_3595" name="arrayLayers" type="_82" context="_481" access="public" location="f7:2921" file="f7" line="2921" offset="352"/>
  <Field id="_3596" name="samples" type="_246" context="_481" access="public" location="f7:2922" file="f7" line="2922" offset="384"/>
  <Field id="_3597" name="tiling" type="_178" context="_481" access="public" location="f7:2923" file="f7" line="2923" offset="416"/>
  <Field id="_3598" name="usage" type="_250" context="_481" access="public" location="f7:2924" file="f7" line="2924" offset="448"/>
  <Field id="_3599" name="sharingMode" type="_186" context="_481" access="public" location="f7:2925" file="f7" line="2925" offset="480"/>
  <Field id="_3600" name="queueFamilyIndexCount" type="_82" context="_481" access="public" location="f7:2926" file="f7" line="2926" offset="512"/>
  <Field id="_3601" name="pQueueFamilyIndices" type="_4232" context="_481" access="public" location="f7:2927" file="f7" line="2927" offset="576"/>
  <Field id="_3602" name="initialLayout" type="_164" context="_481" access="public" location="f7:2928" file="f7" line="2928" offset="640"/>
  <ElaboratedType id="_3603" type="_481"/>
  <Field id="_3604" name="offset" type="_106" context="_483" access="public" location="f7:2932" file="f7" line="2932" offset="0"/>
  <Field id="_3605" name="size" type="_106" context="_483" access="public" location="f7:2933" file="f7" line="2933" offset="64"/>
  <Field id="_3606" name="rowPitch" type="_106" context="_483" access="public" location="f7:2934" file="f7" line="2934" offset="128"/>
  <Field id="_3607" name="arrayPitch" type="_106" context="_483" access="public" location="f7:2935" file="f7" line="2935" offset="192"/>
  <Field id="_3608" name="depthPitch" type="_106" context="_483" access="public" location="f7:2936" file="f7" line="2936" offset="256"/>
  <ElaboratedType id="_3609" type="_483"/>
  <Field id="_3610" name="r" type="_188" context="_485" access="public" location="f7:2940" file="f7" line="2940" offset="0"/>
  <Field id="_3611" name="g" type="_188" context="_485" access="public" location="f7:2941" file="f7" line="2941" offset="32"/>
  <Field id="_3612" name="b" type="_188" context="_485" access="public" location="f7:2942" file="f7" line="2942" offset="64"/>
  <Field id="_3613" name="a" type="_188" context="_485" access="public" location="f7:2943" file="f7" line="2943" offset="96"/>
  <ElaboratedType id="_3614" type="_485"/>
  <Field id="_3615" name="sType" type="_162" context="_487" access="public" location="f7:2947" file="f7" line="2947" offset="0"/>
  <Field id="_3616" name="pNext" type="_4239" context="_487" access="public" location="f7:2948" file="f7" line="2948" offset="64"/>
  <Field id="_3617" name="flags" type="_298" context="_487" access="public" location="f7:2949" file="f7" line="2949" offset="128"/>
  <Field id="_3618" name="image" type="_112" context="_487" access="public" location="f7:2950" file="f7" line="2950" offset="192"/>
  <Field id="_3619" name="viewType" type="_190" context="_487" access="public" location="f7:2951" file="f7" line="2951" offset="256"/>
  <Field id="_3620" name="format" type="_176" context="_487" access="public" location="f7:2952" file="f7" line="2952" offset="288"/>
  <Field id="_3621" name="components" type="_486" context="_487" access="public" location="f7:2953" file="f7" line="2953" offset="320"/>
  <Field id="_3622" name="subresourceRange" type="_396" context="_487" access="public" location="f7:2954" file="f7" line="2954" offset="448"/>
  <ElaboratedType id="_3623" type="_487"/>
  <Field id="_3624" name="sType" type="_162" context="_489" access="public" location="f7:2958" file="f7" line="2958" offset="0"/>
  <Field id="_3625" name="pNext" type="_4239" context="_489" access="public" location="f7:2959" file="f7" line="2959" offset="64"/>
  <Field id="_3626" name="flags" type="_301" context="_489" access="public" location="f7:2960" file="f7" line="2960" offset="128"/>
  <Field id="_3627" name="codeSize" type="_8" context="_489" access="public" location="f7:2961" file="f7" line="2961" offset="192"/>
  <Field id="_3628" name="pCode" type="_4232" context="_489" access="public" location="f7:2962" file="f7" line="2962" offset="256"/>
  <ElaboratedType id="_3629" type="_489"/>
  <Field id="_3630" name="sType" type="_162" context="_491" access="public" location="f7:2966" file="f7" line="2966" offset="0"/>
  <Field id="_3631" name="pNext" type="_4239" context="_491" access="public" location="f7:2967" file="f7" line="2967" offset="64"/>
  <Field id="_3632" name="flags" type="_304" context="_491" access="public" location="f7:2968" file="f7" line="2968" offset="128"/>
  <Field id="_3633" name="initialDataSize" type="_8" context="_491" access="public" location="f7:2969" file="f7" line="2969" offset="192"/>
  <Field id="_3634" name="pInitialData" type="_4239" context="_491" access="public" location="f7:2970" file="f7" line="2970" offset="256"/>
  <ElaboratedType id="_3635" type="_491"/>
  <Field id="_3636" name="constantID" type="_82" context="_493" access="public" location="f7:2974" file="f7" line="2974" offset="0"/>
  <Field id="_3637" name="offset" type="_82" context="_493" access="public" location="f7:2975" file="f7" line="2975" offset="32"/>
  <Field id="_3638" name="size" type="_8" context="_493" access="public" location="f7:2976" file="f7" line="2976" offset="64"/>
  <ElaboratedType id="_3639" type="_493"/>
  <Field id="_3640" name="mapEntryCount" type="_82" context="_495" access="public" location="f7:2980" file="f7" line="2980" offset="0"/>
  <Field id="_3641" name="pMapEntries" type="_7811" context="_495" access="public" location="f7:2981" file="f7" line="2981" offset="64"/>
  <Field id="_3642" name="dataSize" type="_8" context="_495" access="public" location="f7:2982" file="f7" line="2982" offset="128"/>
  <Field id="_3643" name="pData" type="_4239" context="_495" access="public" location="f7:2983" file="f7" line="2983" offset="192"/>
  <ElaboratedType id="_3644" type="_495"/>
  <Field id="_3645" name="sType" type="_162" context="_497" access="public" location="f7:2987" file="f7" line="2987" offset="0"/>
  <Field id="_3646" name="pNext" type="_4239" context="_497" access="public" location="f7:2988" file="f7" line="2988" offset="64"/>
  <Field id="_3647" name="flags" type="_313" context="_497" access="public" location="f7:2989" file="f7" line="2989" offset="128"/>
  <Field id="_3648" name="stage" type="_315" context="_497" access="public" location="f7:2990" file="f7" line="2990" offset="160"/>
  <Field id="_3649" name="module" type="_138" context="_497" access="public" location="f7:2991" file="f7" line="2991" offset="192"/>
  <Field id="_3650" name="pName" type="_4159" context="_497" access="public" location="f7:2992" file="f7" line="2992" offset="256"/>
  <Field id="_3651" name="pSpecializationInfo" type="_7812" context="_497" access="public" location="f7:2993" file="f7" line="2993" offset="320"/>
  <ElaboratedType id="_3652" type="_497"/>
  <Field id="_3653" name="sType" type="_162" context="_499" access="public" location="f7:2997" file="f7" line="2997" offset="0"/>
  <Field id="_3654" name="pNext" type="_4239" context="_499" access="public" location="f7:2998" file="f7" line="2998" offset="64"/>
  <Field id="_3655" name="flags" type="_310" context="_499" access="public" location="f7:2999" file="f7" line="2999" offset="128"/>
  <Field id="_3656" name="stage" type="_498" context="_499" access="public" location="f7:3000" file="f7" line="3000" offset="192"/>
  <Field id="_3657" name="layout" type="_142" context="_499" access="public" location="f7:3001" file="f7" line="3001" offset="576"/>
  <Field id="_3658" name="basePipelineHandle" type="_144" context="_499" access="public" location="f7:3002" file="f7" line="3002" offset="640"/>
  <Field id="_3659" name="basePipelineIndex" type="_78" context="_499" access="public" location="f7:3003" file="f7" line="3003" offset="704"/>
  <ElaboratedType id="_3660" type="_499"/>
  <Field id="_3661" name="binding" type="_82" context="_501" access="public" location="f7:3007" file="f7" line="3007" offset="0"/>
  <Field id="_3662" name="stride" type="_82" context="_501" access="public" location="f7:3008" file="f7" line="3008" offset="32"/>
  <Field id="_3663" name="inputRate" type="_202" context="_501" access="public" location="f7:3009" file="f7" line="3009" offset="64"/>
  <ElaboratedType id="_3664" type="_501"/>
  <Field id="_3665" name="location" type="_82" context="_503" access="public" location="f7:3013" file="f7" line="3013" offset="0"/>
  <Field id="_3666" name="binding" type="_82" context="_503" access="public" location="f7:3014" file="f7" line="3014" offset="32"/>
  <Field id="_3667" name="format" type="_176" context="_503" access="public" location="f7:3015" file="f7" line="3015" offset="64"/>
  <Field id="_3668" name="offset" type="_82" context="_503" access="public" location="f7:3016" file="f7" line="3016" offset="96"/>
  <ElaboratedType id="_3669" type="_503"/>
  <Field id="_3670" name="sType" type="_162" context="_505" access="public" location="f7:3020" file="f7" line="3020" offset="0"/>
  <Field id="_3671" name="pNext" type="_4239" context="_505" access="public" location="f7:3021" file="f7" line="3021" offset="64"/>
  <Field id="_3672" name="flags" type="_319" context="_505" access="public" location="f7:3022" file="f7" line="3022" offset="128"/>
  <Field id="_3673" name="vertexBindingDescriptionCount" type="_82" context="_505" access="public" location="f7:3023" file="f7" line="3023" offset="160"/>
  <Field id="_3674" name="pVertexBindingDescriptions" type="_7813" context="_505" access="public" location="f7:3024" file="f7" line="3024" offset="192"/>
  <Field id="_3675" name="vertexAttributeDescriptionCount" type="_82" context="_505" access="public" location="f7:3025" file="f7" line="3025" offset="256"/>
  <Field id="_3676" name="pVertexAttributeDescriptions" type="_7814" context="_505" access="public" location="f7:3026" file="f7" line="3026" offset="320"/>
  <ElaboratedType id="_3677" type="_505"/>
  <Field id="_3678" name="sType" type="_162" context="_507" access="public" location="f7:3030" file="f7" line="3030" offset="0"/>
  <Field id="_3679" name="pNext" type="_4239" context="_507" access="public" location="f7:3031" file="f7" line="3031" offset="64"/>
  <Field id="_3680" name="flags" type="_320" context="_507" access="public" location="f7:3032" file="f7" line="3032" offset="128"/>
  <Field id="_3681" name="topology" type="_204" context="_507" access="public" location="f7:3033" file="f7" line="3033" offset="160"/>
  <Field id="_3682" name="primitiveRestartEnable" type="_104" context="_507" access="public" location="f7:3034" file="f7" line="3034" offset="192"/>
  <ElaboratedType id="_3683" type="_507"/>
  <Field id="_3684" name="sType" type="_162" context="_509" access="public" location="f7:3038" file="f7" line="3038" offset="0"/>
  <Field id="_3685" name="pNext" type="_4239" context="_509" access="public" location="f7:3039" file="f7" line="3039" offset="64"/>
  <Field id="_3686" name="flags" type="_321" context="_509" access="public" location="f7:3040" file="f7" line="3040" offset="128"/>
  <Field id="_3687" name="patchControlPoints" type="_82" context="_509" access="public" location="f7:3041" file="f7" line="3041" offset="160"/>
  <ElaboratedType id="_3688" type="_509"/>
  <Field id="_3689" name="x" type="_4229" context="_511" access="public" location="f7:3045" file="f7" line="3045" offset="0"/>
  <Field id="_3690" name="y" type="_4229" context="_511" access="public" location="f7:3046" file="f7" line="3046" offset="32"/>
  <Field id="_3691" name="width" type="_4229" context="_511" access="public" location="f7:3047" file="f7" line="3047" offset="64"/>
  <Field id="_3692" name="height" type="_4229" context="_511" access="public" location="f7:3048" file="f7" line="3048" offset="96"/>
  <Field id="_3693" name="minDepth" type="_4229" context="_511" access="public" location="f7:3049" file="f7" line="3049" offset="128"/>
  <Field id="_3694" name="maxDepth" type="_4229" context="_511" access="public" location="f7:3050" file="f7" line="3050" offset="160"/>
  <ElaboratedType id="_3695" type="_511"/>
  <Field id="_3696" name="sType" type="_162" context="_513" access="public" location="f7:3054" file="f7" line="3054" offset="0"/>
  <Field id="_3697" name="pNext" type="_4239" context="_513" access="public" location="f7:3055" file="f7" line="3055" offset="64"/>
  <Field id="_3698" name="flags" type="_322" context="_513" access="public" location="f7:3056" file="f7" line="3056" offset="128"/>
  <Field id="_3699" name="viewportCount" type="_82" context="_513" access="public" location="f7:3057" file="f7" line="3057" offset="160"/>
  <Field id="_3700" name="pViewports" type="_4227" context="_513" access="public" location="f7:3058" file="f7" line="3058" offset="192"/>
  <Field id="_3701" name="scissorCount" type="_82" context="_513" access="public" location="f7:3059" file="f7" line="3059" offset="256"/>
  <Field id="_3702" name="pScissors" type="_4228" context="_513" access="public" location="f7:3060" file="f7" line="3060" offset="320"/>
  <ElaboratedType id="_3703" type="_513"/>
  <Field id="_3704" name="sType" type="_162" context="_515" access="public" location="f7:3064" file="f7" line="3064" offset="0"/>
  <Field id="_3705" name="pNext" type="_4239" context="_515" access="public" location="f7:3065" file="f7" line="3065" offset="64"/>
  <Field id="_3706" name="flags" type="_323" context="_515" access="public" location="f7:3066" file="f7" line="3066" offset="128"/>
  <Field id="_3707" name="depthClampEnable" type="_104" context="_515" access="public" location="f7:3067" file="f7" line="3067" offset="160"/>
  <Field id="_3708" name="rasterizerDiscardEnable" type="_104" context="_515" access="public" location="f7:3068" file="f7" line="3068" offset="192"/>
  <Field id="_3709" name="polygonMode" type="_206" context="_515" access="public" location="f7:3069" file="f7" line="3069" offset="224"/>
  <Field id="_3710" name="cullMode" type="_318" context="_515" access="public" location="f7:3070" file="f7" line="3070" offset="256"/>
  <Field id="_3711" name="frontFace" type="_200" context="_515" access="public" location="f7:3071" file="f7" line="3071" offset="288"/>
  <Field id="_3712" name="depthBiasEnable" type="_104" context="_515" access="public" location="f7:3072" file="f7" line="3072" offset="320"/>
  <Field id="_3713" name="depthBiasConstantFactor" type="_4229" context="_515" access="public" location="f7:3073" file="f7" line="3073" offset="352"/>
  <Field id="_3714" name="depthBiasClamp" type="_4229" context="_515" access="public" location="f7:3074" file="f7" line="3074" offset="384"/>
  <Field id="_3715" name="depthBiasSlopeFactor" type="_4229" context="_515" access="public" location="f7:3075" file="f7" line="3075" offset="416"/>
  <Field id="_3716" name="lineWidth" type="_4229" context="_515" access="public" location="f7:3076" file="f7" line="3076" offset="448"/>
  <ElaboratedType id="_3717" type="_515"/>
  <Field id="_3718" name="sType" type="_162" context="_517" access="public" location="f7:3080" file="f7" line="3080" offset="0"/>
  <Field id="_3719" name="pNext" type="_4239" context="_517" access="public" location="f7:3081" file="f7" line="3081" offset="64"/>
  <Field id="_3720" name="flags" type="_324" context="_517" access="public" location="f7:3082" file="f7" line="3082" offset="128"/>
  <Field id="_3721" name="rasterizationSamples" type="_246" context="_517" access="public" location="f7:3083" file="f7" line="3083" offset="160"/>
  <Field id="_3722" name="sampleShadingEnable" type="_104" context="_517" access="public" location="f7:3084" file="f7" line="3084" offset="192"/>
  <Field id="_3723" name="minSampleShading" type="_4229" context="_517" access="public" location="f7:3085" file="f7" line="3085" offset="224"/>
  <Field id="_3724" name="pSampleMask" type="_7815" context="_517" access="public" location="f7:3086" file="f7" line="3086" offset="256"/>
  <Field id="_3725" name="alphaToCoverageEnable" type="_104" context="_517" access="public" location="f7:3087" file="f7" line="3087" offset="320"/>
  <Field id="_3726" name="alphaToOneEnable" type="_104" context="_517" access="public" location="f7:3088" file="f7" line="3088" offset="352"/>
  <ElaboratedType id="_3727" type="_517"/>
  <Field id="_3728" name="failOp" type="_208" context="_519" access="public" location="f7:3092" file="f7" line="3092" offset="0"/>
  <Field id="_3729" name="passOp" type="_208" context="_519" access="public" location="f7:3093" file="f7" line="3093" offset="32"/>
  <Field id="_3730" name="depthFailOp" type="_208" context="_519" access="public" location="f7:3094" file="f7" line="3094" offset="64"/>
  <Field id="_3731" name="compareOp" type="_196" context="_519" access="public" location="f7:3095" file="f7" line="3095" offset="96"/>
  <Field id="_3732" name="compareMask" type="_82" context="_519" access="public" location="f7:3096" file="f7" line="3096" offset="128"/>
  <Field id="_3733" name="writeMask" type="_82" context="_519" access="public" location="f7:3097" file="f7" line="3097" offset="160"/>
  <Field id="_3734" name="reference" type="_82" context="_519" access="public" location="f7:3098" file="f7" line="3098" offset="192"/>
  <ElaboratedType id="_3735" type="_519"/>
  <Field id="_3736" name="sType" type="_162" context="_521" access="public" location="f7:3102" file="f7" line="3102" offset="0"/>
  <Field id="_3737" name="pNext" type="_4239" context="_521" access="public" location="f7:3103" file="f7" line="3103" offset="64"/>
  <Field id="_3738" name="flags" type="_325" context="_521" access="public" location="f7:3104" file="f7" line="3104" offset="128"/>
  <Field id="_3739" name="depthTestEnable" type="_104" context="_521" access="public" location="f7:3105" file="f7" line="3105" offset="160"/>
  <Field id="_3740" name="depthWriteEnable" type="_104" context="_521" access="public" location="f7:3106" file="f7" line="3106" offset="192"/>
  <Field id="_3741" name="depthCompareOp" type="_196" context="_521" access="public" location="f7:3107" file="f7" line="3107" offset="224"/>
  <Field id="_3742" name="depthBoundsTestEnable" type="_104" context="_521" access="public" location="f7:3108" file="f7" line="3108" offset="256"/>
  <Field id="_3743" name="stencilTestEnable" type="_104" context="_521" access="public" location="f7:3109" file="f7" line="3109" offset="288"/>
  <Field id="_3744" name="front" type="_520" context="_521" access="public" location="f7:3110" file="f7" line="3110" offset="320"/>
  <Field id="_3745" name="back" type="_520" context="_521" access="public" location="f7:3111" file="f7" line="3111" offset="544"/>
  <Field id="_3746" name="minDepthBounds" type="_4229" context="_521" access="public" location="f7:3112" file="f7" line="3112" offset="768"/>
  <Field id="_3747" name="maxDepthBounds" type="_4229" context="_521" access="public" location="f7:3113" file="f7" line="3113" offset="800"/>
  <ElaboratedType id="_3748" type="_521"/>
  <Field id="_3749" name="blendEnable" type="_104" context="_523" access="public" location="f7:3117" file="f7" line="3117" offset="0"/>
  <Field id="_3750" name="srcColorBlendFactor" type="_192" context="_523" access="public" location="f7:3118" file="f7" line="3118" offset="32"/>
  <Field id="_3751" name="dstColorBlendFactor" type="_192" context="_523" access="public" location="f7:3119" file="f7" line="3119" offset="64"/>
  <Field id="_3752" name="colorBlendOp" type="_194" context="_523" access="public" location="f7:3120" file="f7" line="3120" offset="96"/>
  <Field id="_3753" name="srcAlphaBlendFactor" type="_192" context="_523" access="public" location="f7:3121" file="f7" line="3121" offset="128"/>
  <Field id="_3754" name="dstAlphaBlendFactor" type="_192" context="_523" access="public" location="f7:3122" file="f7" line="3122" offset="160"/>
  <Field id="_3755" name="alphaBlendOp" type="_194" context="_523" access="public" location="f7:3123" file="f7" line="3123" offset="192"/>
  <Field id="_3756" name="colorWriteMask" type="_307" context="_523" access="public" location="f7:3124" file="f7" line="3124" offset="224"/>
  <ElaboratedType id="_3757" type="_523"/>
  <Field id="_3758" name="sType" type="_162" context="_525" access="public" location="f7:3128" file="f7" line="3128" offset="0"/>
  <Field id="_3759" name="pNext" type="_4239" context="_525" access="public" location="f7:3129" file="f7" line="3129" offset="64"/>
  <Field id="_3760" name="flags" type="_326" context="_525" access="public" location="f7:3130" file="f7" line="3130" offset="128"/>
  <Field id="_3761" name="logicOpEnable" type="_104" context="_525" access="public" location="f7:3131" file="f7" line="3131" offset="160"/>
  <Field id="_3762" name="logicOp" type="_210" context="_525" access="public" location="f7:3132" file="f7" line="3132" offset="192"/>
  <Field id="_3763" name="attachmentCount" type="_82" context="_525" access="public" location="f7:3133" file="f7" line="3133" offset="224"/>
  <Field id="_3764" name="pAttachments" type="_7816" context="_525" access="public" location="f7:3134" file="f7" line="3134" offset="256"/>
  <Field id="_3765" name="blendConstants" type="_7817" context="_525" access="public" location="f7:3135" file="f7" line="3135" offset="320"/>
  <ElaboratedType id="_3766" type="_525"/>
  <Field id="_3767" name="sType" type="_162" context="_527" access="public" location="f7:3139" file="f7" line="3139" offset="0"/>
  <Field id="_3768" name="pNext" type="_4239" context="_527" access="public" location="f7:3140" file="f7" line="3140" offset="64"/>
  <Field id="_3769" name="flags" type="_327" context="_527" access="public" location="f7:3141" file="f7" line="3141" offset="128"/>
  <Field id="_3770" name="dynamicStateCount" type="_82" context="_527" access="public" location="f7:3142" file="f7" line="3142" offset="160"/>
  <Field id="_3771" name="pDynamicStates" type="_7818" context="_527" access="public" location="f7:3143" file="f7" line="3143" offset="192"/>
  <ElaboratedType id="_3772" type="_527"/>
  <Field id="_3773" name="sType" type="_162" context="_529" access="public" location="f7:3147" file="f7" line="3147" offset="0"/>
  <Field id="_3774" name="pNext" type="_4239" context="_529" access="public" location="f7:3148" file="f7" line="3148" offset="64"/>
  <Field id="_3775" name="flags" type="_310" context="_529" access="public" location="f7:3149" file="f7" line="3149" offset="128"/>
  <Field id="_3776" name="stageCount" type="_82" context="_529" access="public" location="f7:3150" file="f7" line="3150" offset="160"/>
  <Field id="_3777" name="pStages" type="_7819" context="_529" access="public" location="f7:3151" file="f7" line="3151" offset="192"/>
  <Field id="_3778" name="pVertexInputState" type="_7820" context="_529" access="public" location="f7:3152" file="f7" line="3152" offset="256"/>
  <Field id="_3779" name="pInputAssemblyState" type="_7821" context="_529" access="public" location="f7:3153" file="f7" line="3153" offset="320"/>
  <Field id="_3780" name="pTessellationState" type="_7822" context="_529" access="public" location="f7:3154" file="f7" line="3154" offset="384"/>
  <Field id="_3781" name="pViewportState" type="_7823" context="_529" access="public" location="f7:3155" file="f7" line="3155" offset="448"/>
  <Field id="_3782" name="pRasterizationState" type="_7824" context="_529" access="public" location="f7:3156" file="f7" line="3156" offset="512"/>
  <Field id="_3783" name="pMultisampleState" type="_7825" context="_529" access="public" location="f7:3157" file="f7" line="3157" offset="576"/>
  <Field id="_3784" name="pDepthStencilState" type="_7826" context="_529" access="public" location="f7:3158" file="f7" line="3158" offset="640"/>
  <Field id="_3785" name="pColorBlendState" type="_7827" context="_529" access="public" location="f7:3159" file="f7" line="3159" offset="704"/>
  <Field id="_3786" name="pDynamicState" type="_7828" context="_529" access="public" location="f7:3160" file="f7" line="3160" offset="768"/>
  <Field id="_3787" name="layout" type="_142" context="_529" access="public" location="f7:3161" file="f7" line="3161" offset="832"/>
  <Field id="_3788" name="renderPass" type="_146" context="_529" access="public" location="f7:3162" file="f7" line="3162" offset="896"/>
  <Field id="_3789" name="subpass" type="_82" context="_529" access="public" location="f7:3163" file="f7" line="3163" offset="960"/>
  <Field id="_3790" name="basePipelineHandle" type="_144" context="_529" access="public" location="f7:3164" file="f7" line="3164" offset="1024"/>
  <Field id="_3791" name="basePipelineIndex" type="_78" context="_529" access="public" location="f7:3165" file="f7" line="3165" offset="1088"/>
  <ElaboratedType id="_3792" type="_529"/>
  <Field id="_3793" name="stageFlags" type="_329" context="_531" access="public" location="f7:3169" file="f7" line="3169" offset="0"/>
  <Field id="_3794" name="offset" type="_82" context="_531" access="public" location="f7:3170" file="f7" line="3170" offset="32"/>
  <Field id="_3795" name="size" type="_82" context="_531" access="public" location="f7:3171" file="f7" line="3171" offset="64"/>
  <ElaboratedType id="_3796" type="_531"/>
  <Field id="_3797" name="sType" type="_162" context="_533" access="public" location="f7:3175" file="f7" line="3175" offset="0"/>
  <Field id="_3798" name="pNext" type="_4239" context="_533" access="public" location="f7:3176" file="f7" line="3176" offset="64"/>
  <Field id="_3799" name="flags" type="_328" context="_533" access="public" location="f7:3177" file="f7" line="3177" offset="128"/>
  <Field id="_3800" name="setLayoutCount" type="_82" context="_533" access="public" location="f7:3178" file="f7" line="3178" offset="160"/>
  <Field id="_3801" name="pSetLayouts" type="_7829" context="_533" access="public" location="f7:3179" file="f7" line="3179" offset="192"/>
  <Field id="_3802" name="pushConstantRangeCount" type="_82" context="_533" access="public" location="f7:3180" file="f7" line="3180" offset="256"/>
  <Field id="_3803" name="pPushConstantRanges" type="_7830" context="_533" access="public" location="f7:3181" file="f7" line="3181" offset="320"/>
  <ElaboratedType id="_3804" type="_533"/>
  <Field id="_3805" name="sType" type="_162" context="_535" access="public" location="f7:3185" file="f7" line="3185" offset="0"/>
  <Field id="_3806" name="pNext" type="_4239" context="_535" access="public" location="f7:3186" file="f7" line="3186" offset="64"/>
  <Field id="_3807" name="flags" type="_332" context="_535" access="public" location="f7:3187" file="f7" line="3187" offset="128"/>
  <Field id="_3808" name="magFilter" type="_214" context="_535" access="public" location="f7:3188" file="f7" line="3188" offset="160"/>
  <Field id="_3809" name="minFilter" type="_214" context="_535" access="public" location="f7:3189" file="f7" line="3189" offset="192"/>
  <Field id="_3810" name="mipmapMode" type="_218" context="_535" access="public" location="f7:3190" file="f7" line="3190" offset="224"/>
  <Field id="_3811" name="addressModeU" type="_216" context="_535" access="public" location="f7:3191" file="f7" line="3191" offset="256"/>
  <Field id="_3812" name="addressModeV" type="_216" context="_535" access="public" location="f7:3192" file="f7" line="3192" offset="288"/>
  <Field id="_3813" name="addressModeW" type="_216" context="_535" access="public" location="f7:3193" file="f7" line="3193" offset="320"/>
  <Field id="_3814" name="mipLodBias" type="_4229" context="_535" access="public" location="f7:3194" file="f7" line="3194" offset="352"/>
  <Field id="_3815" name="anisotropyEnable" type="_104" context="_535" access="public" location="f7:3195" file="f7" line="3195" offset="384"/>
  <Field id="_3816" name="maxAnisotropy" type="_4229" context="_535" access="public" location="f7:3196" file="f7" line="3196" offset="416"/>
  <Field id="_3817" name="compareEnable" type="_104" context="_535" access="public" location="f7:3197" file="f7" line="3197" offset="448"/>
  <Field id="_3818" name="compareOp" type="_196" context="_535" access="public" location="f7:3198" file="f7" line="3198" offset="480"/>
  <Field id="_3819" name="minLod" type="_4229" context="_535" access="public" location="f7:3199" file="f7" line="3199" offset="512"/>
  <Field id="_3820" name="maxLod" type="_4229" context="_535" access="public" location="f7:3200" file="f7" line="3200" offset="544"/>
  <Field id="_3821" name="borderColor" type="_212" context="_535" access="public" location="f7:3201" file="f7" line="3201" offset="576"/>
  <Field id="_3822" name="unnormalizedCoordinates" type="_104" context="_535" access="public" location="f7:3202" file="f7" line="3202" offset="608"/>
  <ElaboratedType id="_3823" type="_535"/>
  <Field id="_3824" name="sType" type="_162" context="_537" access="public" location="f7:3206" file="f7" line="3206" offset="0"/>
  <Field id="_3825" name="pNext" type="_4239" context="_537" access="public" location="f7:3207" file="f7" line="3207" offset="64"/>
  <Field id="_3826" name="srcSet" type="_152" context="_537" access="public" location="f7:3208" file="f7" line="3208" offset="128"/>
  <Field id="_3827" name="srcBinding" type="_82" context="_537" access="public" location="f7:3209" file="f7" line="3209" offset="192"/>
  <Field id="_3828" name="srcArrayElement" type="_82" context="_537" access="public" location="f7:3210" file="f7" line="3210" offset="224"/>
  <Field id="_3829" name="dstSet" type="_152" context="_537" access="public" location="f7:3211" file="f7" line="3211" offset="256"/>
  <Field id="_3830" name="dstBinding" type="_82" context="_537" access="public" location="f7:3212" file="f7" line="3212" offset="320"/>
  <Field id="_3831" name="dstArrayElement" type="_82" context="_537" access="public" location="f7:3213" file="f7" line="3213" offset="352"/>
  <Field id="_3832" name="descriptorCount" type="_82" context="_537" access="public" location="f7:3214" file="f7" line="3214" offset="384"/>
  <ElaboratedType id="_3833" type="_537"/>
  <Field id="_3834" name="buffer" type="_110" context="_539" access="public" location="f7:3218" file="f7" line="3218" offset="0"/>
  <Field id="_3835" name="offset" type="_106" context="_539" access="public" location="f7:3219" file="f7" line="3219" offset="64"/>
  <Field id="_3836" name="range" type="_106" context="_539" access="public" location="f7:3220" file="f7" line="3220" offset="128"/>
  <ElaboratedType id="_3837" type="_539"/>
  <Field id="_3838" name="sampler" type="_150" context="_541" access="public" location="f7:3224" file="f7" line="3224" offset="0"/>
  <Field id="_3839" name="imageView" type="_136" context="_541" access="public" location="f7:3225" file="f7" line="3225" offset="64"/>
  <Field id="_3840" name="imageLayout" type="_164" context="_541" access="public" location="f7:3226" file="f7" line="3226" offset="128"/>
  <ElaboratedType id="_3841" type="_541"/>
  <Field id="_3842" name="type" type="_220" context="_543" access="public" location="f7:3230" file="f7" line="3230" offset="0"/>
  <Field id="_3843" name="descriptorCount" type="_82" context="_543" access="public" location="f7:3231" file="f7" line="3231" offset="32"/>
  <ElaboratedType id="_3844" type="_543"/>
  <Field id="_3845" name="sType" type="_162" context="_545" access="public" location="f7:3235" file="f7" line="3235" offset="0"/>
  <Field id="_3846" name="pNext" type="_4239" context="_545" access="public" location="f7:3236" file="f7" line="3236" offset="64"/>
  <Field id="_3847" name="flags" type="_335" context="_545" access="public" location="f7:3237" file="f7" line="3237" offset="128"/>
  <Field id="_3848" name="maxSets" type="_82" context="_545" access="public" location="f7:3238" file="f7" line="3238" offset="160"/>
  <Field id="_3849" name="poolSizeCount" type="_82" context="_545" access="public" location="f7:3239" file="f7" line="3239" offset="192"/>
  <Field id="_3850" name="pPoolSizes" type="_7831" context="_545" access="public" location="f7:3240" file="f7" line="3240" offset="256"/>
  <ElaboratedType id="_3851" type="_545"/>
  <Field id="_3852" name="sType" type="_162" context="_547" access="public" location="f7:3244" file="f7" line="3244" offset="0"/>
  <Field id="_3853" name="pNext" type="_4239" context="_547" access="public" location="f7:3245" file="f7" line="3245" offset="64"/>
  <Field id="_3854" name="descriptorPool" type="_154" context="_547" access="public" location="f7:3246" file="f7" line="3246" offset="128"/>
  <Field id="_3855" name="descriptorSetCount" type="_82" context="_547" access="public" location="f7:3247" file="f7" line="3247" offset="192"/>
  <Field id="_3856" name="pSetLayouts" type="_7829" context="_547" access="public" location="f7:3248" file="f7" line="3248" offset="256"/>
  <ElaboratedType id="_3857" type="_547"/>
  <Field id="_3858" name="binding" type="_82" context="_549" access="public" location="f7:3252" file="f7" line="3252" offset="0"/>
  <Field id="_3859" name="descriptorType" type="_220" context="_549" access="public" location="f7:3253" file="f7" line="3253" offset="32"/>
  <Field id="_3860" name="descriptorCount" type="_82" context="_549" access="public" location="f7:3254" file="f7" line="3254" offset="64"/>
  <Field id="_3861" name="stageFlags" type="_329" context="_549" access="public" location="f7:3255" file="f7" line="3255" offset="96"/>
  <Field id="_3862" name="pImmutableSamplers" type="_7832" context="_549" access="public" location="f7:3256" file="f7" line="3256" offset="128"/>
  <ElaboratedType id="_3863" type="_549"/>
  <Field id="_3864" name="sType" type="_162" context="_551" access="public" location="f7:3260" file="f7" line="3260" offset="0"/>
  <Field id="_3865" name="pNext" type="_4239" context="_551" access="public" location="f7:3261" file="f7" line="3261" offset="64"/>
  <Field id="_3866" name="flags" type="_339" context="_551" access="public" location="f7:3262" file="f7" line="3262" offset="128"/>
  <Field id="_3867" name="bindingCount" type="_82" context="_551" access="public" location="f7:3263" file="f7" line="3263" offset="160"/>
  <Field id="_3868" name="pBindings" type="_7833" context="_551" access="public" location="f7:3264" file="f7" line="3264" offset="192"/>
  <ElaboratedType id="_3869" type="_551"/>
  <Field id="_3870" name="sType" type="_162" context="_553" access="public" location="f7:3268" file="f7" line="3268" offset="0"/>
  <Field id="_3871" name="pNext" type="_4239" context="_553" access="public" location="f7:3269" file="f7" line="3269" offset="64"/>
  <Field id="_3872" name="dstSet" type="_152" context="_553" access="public" location="f7:3270" file="f7" line="3270" offset="128"/>
  <Field id="_3873" name="dstBinding" type="_82" context="_553" access="public" location="f7:3271" file="f7" line="3271" offset="192"/>
  <Field id="_3874" name="dstArrayElement" type="_82" context="_553" access="public" location="f7:3272" file="f7" line="3272" offset="224"/>
  <Field id="_3875" name="descriptorCount" type="_82" context="_553" access="public" location="f7:3273" file="f7" line="3273" offset="256"/>
  <Field id="_3876" name="descriptorType" type="_220" context="_553" access="public" location="f7:3274" file="f7" line="3274" offset="288"/>
  <Field id="_3877" name="pImageInfo" type="_7834" context="_553" access="public" location="f7:3275" file="f7" line="3275" offset="320"/>
  <Field id="_3878" name="pBufferInfo" type="_7835" context="_553" access="public" location="f7:3276" file="f7" line="3276" offset="384"/>
  <Field id="_3879" name="pTexelBufferView" type="_7836" context="_553" access="public" location="f7:3277" file="f7" line="3277" offset="448"/>
  <ElaboratedType id="_3880" type="_553"/>
  <Field id="_3881" name="flags" type="_342" context="_555" access="public" location="f7:3281" file="f7" line="3281" offset="0"/>
  <Field id="_3882" name="format" type="_176" context="_555" access="public" location="f7:3282" file="f7" line="3282" offset="32"/>
  <Field id="_3883" name="samples" type="_246" context="_555" access="public" location="f7:3283" file="f7" line="3283" offset="64"/>
  <Field id="_3884" name="loadOp" type="_222" context="_555" access="public" location="f7:3284" file="f7" line="3284" offset="96"/>
  <Field id="_3885" name="storeOp" type="_224" context="_555" access="public" location="f7:3285" file="f7" line="3285" offset="128"/>
  <Field id="_3886" name="stencilLoadOp" type="_222" context="_555" access="public" location="f7:3286" file="f7" line="3286" offset="160"/>
  <Field id="_3887" name="stencilStoreOp" type="_224" context="_555" access="public" location="f7:3287" file="f7" line="3287" offset="192"/>
  <Field id="_3888" name="initialLayout" type="_164" context="_555" access="public" location="f7:3288" file="f7" line="3288" offset="224"/>
  <Field id="_3889" name="finalLayout" type="_164" context="_555" access="public" location="f7:3289" file="f7" line="3289" offset="256"/>
  <ElaboratedType id="_3890" type="_555"/>
  <Field id="_3891" name="attachment" type="_82" context="_557" access="public" location="f7:3293" file="f7" line="3293" offset="0"/>
  <Field id="_3892" name="layout" type="_164" context="_557" access="public" location="f7:3294" file="f7" line="3294" offset="32"/>
  <ElaboratedType id="_3893" type="_557"/>
  <Field id="_3894" name="sType" type="_162" context="_559" access="public" location="f7:3298" file="f7" line="3298" offset="0"/>
  <Field id="_3895" name="pNext" type="_4239" context="_559" access="public" location="f7:3299" file="f7" line="3299" offset="64"/>
  <Field id="_3896" name="flags" type="_348" context="_559" access="public" location="f7:3300" file="f7" line="3300" offset="128"/>
  <Field id="_3897" name="renderPass" type="_146" context="_559" access="public" location="f7:3301" file="f7" line="3301" offset="192"/>
  <Field id="_3898" name="attachmentCount" type="_82" context="_559" access="public" location="f7:3302" file="f7" line="3302" offset="256"/>
  <Field id="_3899" name="pAttachments" type="_7837" context="_559" access="public" location="f7:3303" file="f7" line="3303" offset="320"/>
  <Field id="_3900" name="width" type="_82" context="_559" access="public" location="f7:3304" file="f7" line="3304" offset="384"/>
  <Field id="_3901" name="height" type="_82" context="_559" access="public" location="f7:3305" file="f7" line="3305" offset="416"/>
  <Field id="_3902" name="layers" type="_82" context="_559" access="public" location="f7:3306" file="f7" line="3306" offset="448"/>
  <ElaboratedType id="_3903" type="_559"/>
  <Field id="_3904" name="flags" type="_354" context="_561" access="public" location="f7:3310" file="f7" line="3310" offset="0"/>
  <Field id="_3905" name="pipelineBindPoint" type="_226" context="_561" access="public" location="f7:3311" file="f7" line="3311" offset="32"/>
  <Field id="_3906" name="inputAttachmentCount" type="_82" context="_561" access="public" location="f7:3312" file="f7" line="3312" offset="64"/>
  <Field id="_3907" name="pInputAttachments" type="_7838" context="_561" access="public" location="f7:3313" file="f7" line="3313" offset="128"/>
  <Field id="_3908" name="colorAttachmentCount" type="_82" context="_561" access="public" location="f7:3314" file="f7" line="3314" offset="192"/>
  <Field id="_3909" name="pColorAttachments" type="_7838" context="_561" access="public" location="f7:3315" file="f7" line="3315" offset="256"/>
  <Field id="_3910" name="pResolveAttachments" type="_7838" context="_561" access="public" location="f7:3316" file="f7" line="3316" offset="320"/>
  <Field id="_3911" name="pDepthStencilAttachment" type="_7838" context="_561" access="public" location="f7:3317" file="f7" line="3317" offset="384"/>
  <Field id="_3912" name="preserveAttachmentCount" type="_82" context="_561" access="public" location="f7:3318" file="f7" line="3318" offset="448"/>
  <Field id="_3913" name="pPreserveAttachments" type="_4232" context="_561" access="public" location="f7:3319" file="f7" line="3319" offset="512"/>
  <ElaboratedType id="_3914" type="_561"/>
  <Field id="_3915" name="srcSubpass" type="_82" context="_563" access="public" location="f7:3323" file="f7" line="3323" offset="0"/>
  <Field id="_3916" name="dstSubpass" type="_82" context="_563" access="public" location="f7:3324" file="f7" line="3324" offset="32"/>
  <Field id="_3917" name="srcStageMask" type="_267" context="_563" access="public" location="f7:3325" file="f7" line="3325" offset="64"/>
  <Field id="_3918" name="dstStageMask" type="_267" context="_563" access="public" location="f7:3326" file="f7" line="3326" offset="96"/>
  <Field id="_3919" name="srcAccessMask" type="_235" context="_563" access="public" location="f7:3327" file="f7" line="3327" offset="128"/>
  <Field id="_3920" name="dstAccessMask" type="_235" context="_563" access="public" location="f7:3328" file="f7" line="3328" offset="160"/>
  <Field id="_3921" name="dependencyFlags" type="_345" context="_563" access="public" location="f7:3329" file="f7" line="3329" offset="192"/>
  <ElaboratedType id="_3922" type="_563"/>
  <Field id="_3923" name="sType" type="_162" context="_565" access="public" location="f7:3333" file="f7" line="3333" offset="0"/>
  <Field id="_3924" name="pNext" type="_4239" context="_565" access="public" location="f7:3334" file="f7" line="3334" offset="64"/>
  <Field id="_3925" name="flags" type="_351" context="_565" access="public" location="f7:3335" file="f7" line="3335" offset="128"/>
  <Field id="_3926" name="attachmentCount" type="_82" context="_565" access="public" location="f7:3336" file="f7" line="3336" offset="160"/>
  <Field id="_3927" name="pAttachments" type="_7839" context="_565" access="public" location="f7:3337" file="f7" line="3337" offset="192"/>
  <Field id="_3928" name="subpassCount" type="_82" context="_565" access="public" location="f7:3338" file="f7" line="3338" offset="256"/>
  <Field id="_3929" name="pSubpasses" type="_7840" context="_565" access="public" location="f7:3339" file="f7" line="3339" offset="320"/>
  <Field id="_3930" name="dependencyCount" type="_82" context="_565" access="public" location="f7:3340" file="f7" line="3340" offset="384"/>
  <Field id="_3931" name="pDependencies" type="_7841" context="_565" access="public" location="f7:3341" file="f7" line="3341" offset="448"/>
  <ElaboratedType id="_3932" type="_565"/>
  <Field id="_3933" name="sType" type="_162" context="_567" access="public" location="f7:3345" file="f7" line="3345" offset="0"/>
  <Field id="_3934" name="pNext" type="_4239" context="_567" access="public" location="f7:3346" file="f7" line="3346" offset="64"/>
  <Field id="_3935" name="flags" type="_357" context="_567" access="public" location="f7:3347" file="f7" line="3347" offset="128"/>
  <Field id="_3936" name="queueFamilyIndex" type="_82" context="_567" access="public" location="f7:3348" file="f7" line="3348" offset="160"/>
  <ElaboratedType id="_3937" type="_567"/>
  <Field id="_3938" name="sType" type="_162" context="_569" access="public" location="f7:3352" file="f7" line="3352" offset="0"/>
  <Field id="_3939" name="pNext" type="_4239" context="_569" access="public" location="f7:3353" file="f7" line="3353" offset="64"/>
  <Field id="_3940" name="commandPool" type="_158" context="_569" access="public" location="f7:3354" file="f7" line="3354" offset="128"/>
  <Field id="_3941" name="level" type="_228" context="_569" access="public" location="f7:3355" file="f7" line="3355" offset="192"/>
  <Field id="_3942" name="commandBufferCount" type="_82" context="_569" access="public" location="f7:3356" file="f7" line="3356" offset="224"/>
  <ElaboratedType id="_3943" type="_569"/>
  <Field id="_3944" name="sType" type="_162" context="_571" access="public" location="f7:3360" file="f7" line="3360" offset="0"/>
  <Field id="_3945" name="pNext" type="_4239" context="_571" access="public" location="f7:3361" file="f7" line="3361" offset="64"/>
  <Field id="_3946" name="renderPass" type="_146" context="_571" access="public" location="f7:3362" file="f7" line="3362" offset="128"/>
  <Field id="_3947" name="subpass" type="_82" context="_571" access="public" location="f7:3363" file="f7" line="3363" offset="192"/>
  <Field id="_3948" name="framebuffer" type="_156" context="_571" access="public" location="f7:3364" file="f7" line="3364" offset="256"/>
  <Field id="_3949" name="occlusionQueryEnable" type="_104" context="_571" access="public" location="f7:3365" file="f7" line="3365" offset="320"/>
  <Field id="_3950" name="queryFlags" type="_366" context="_571" access="public" location="f7:3366" file="f7" line="3366" offset="352"/>
  <Field id="_3951" name="pipelineStatistics" type="_284" context="_571" access="public" location="f7:3367" file="f7" line="3367" offset="384"/>
  <ElaboratedType id="_3952" type="_571"/>
  <Field id="_3953" name="sType" type="_162" context="_573" access="public" location="f7:3371" file="f7" line="3371" offset="0"/>
  <Field id="_3954" name="pNext" type="_4239" context="_573" access="public" location="f7:3372" file="f7" line="3372" offset="64"/>
  <Field id="_3955" name="flags" type="_363" context="_573" access="public" location="f7:3373" file="f7" line="3373" offset="128"/>
  <Field id="_3956" name="pInheritanceInfo" type="_7842" context="_573" access="public" location="f7:3374" file="f7" line="3374" offset="192"/>
  <ElaboratedType id="_3957" type="_573"/>
  <Field id="_3958" name="srcOffset" type="_106" context="_575" access="public" location="f7:3378" file="f7" line="3378" offset="0"/>
  <Field id="_3959" name="dstOffset" type="_106" context="_575" access="public" location="f7:3379" file="f7" line="3379" offset="64"/>
  <Field id="_3960" name="size" type="_106" context="_575" access="public" location="f7:3380" file="f7" line="3380" offset="128"/>
  <ElaboratedType id="_3961" type="_575"/>
  <Field id="_3962" name="aspectMask" type="_238" context="_577" access="public" location="f7:3384" file="f7" line="3384" offset="0"/>
  <Field id="_3963" name="mipLevel" type="_82" context="_577" access="public" location="f7:3385" file="f7" line="3385" offset="32"/>
  <Field id="_3964" name="baseArrayLayer" type="_82" context="_577" access="public" location="f7:3386" file="f7" line="3386" offset="64"/>
  <Field id="_3965" name="layerCount" type="_82" context="_577" access="public" location="f7:3387" file="f7" line="3387" offset="96"/>
  <ElaboratedType id="_3966" type="_577"/>
  <Field id="_3967" name="bufferOffset" type="_106" context="_579" access="public" location="f7:3391" file="f7" line="3391" offset="0"/>
  <Field id="_3968" name="bufferRowLength" type="_82" context="_579" access="public" location="f7:3392" file="f7" line="3392" offset="64"/>
  <Field id="_3969" name="bufferImageHeight" type="_82" context="_579" access="public" location="f7:3393" file="f7" line="3393" offset="96"/>
  <Field id="_3970" name="imageSubresource" type="_578" context="_579" access="public" location="f7:3394" file="f7" line="3394" offset="128"/>
  <Field id="_3971" name="imageOffset" type="_380" context="_579" access="public" location="f7:3395" file="f7" line="3395" offset="256"/>
  <Field id="_3972" name="imageExtent" type="_376" context="_579" access="public" location="f7:3396" file="f7" line="3396" offset="352"/>
  <ElaboratedType id="_3973" type="_579"/>
  <Field id="_3974" name="float32" type="_7817" context="_581" access="public" location="f7:3400" file="f7" line="3400" offset="0"/>
  <Field id="_3975" name="int32" type="_7843" context="_581" access="public" location="f7:3401" file="f7" line="3401" offset="0"/>
  <Field id="_3976" name="uint32" type="_7844" context="_581" access="public" location="f7:3402" file="f7" line="3402" offset="0"/>
  <ElaboratedType id="_3977" type="_581"/>
  <Field id="_3978" name="depth" type="_4229" context="_583" access="public" location="f7:3406" file="f7" line="3406" offset="0"/>
  <Field id="_3979" name="stencil" type="_82" context="_583" access="public" location="f7:3407" file="f7" line="3407" offset="32"/>
  <ElaboratedType id="_3980" type="_583"/>
  <Field id="_3981" name="color" type="_582" context="_585" access="public" location="f7:3411" file="f7" line="3411" offset="0"/>
  <Field id="_3982" name="depthStencil" type="_584" context="_585" access="public" location="f7:3412" file="f7" line="3412" offset="0"/>
  <ElaboratedType id="_3983" type="_585"/>
  <Field id="_3984" name="aspectMask" type="_238" context="_587" access="public" location="f7:3416" file="f7" line="3416" offset="0"/>
  <Field id="_3985" name="colorAttachment" type="_82" context="_587" access="public" location="f7:3417" file="f7" line="3417" offset="32"/>
  <Field id="_3986" name="clearValue" type="_586" context="_587" access="public" location="f7:3418" file="f7" line="3418" offset="64"/>
  <ElaboratedType id="_3987" type="_587"/>
  <Field id="_3988" name="rect" type="_382" context="_589" access="public" location="f7:3422" file="f7" line="3422" offset="0"/>
  <Field id="_3989" name="baseArrayLayer" type="_82" context="_589" access="public" location="f7:3423" file="f7" line="3423" offset="128"/>
  <Field id="_3990" name="layerCount" type="_82" context="_589" access="public" location="f7:3424" file="f7" line="3424" offset="160"/>
  <ElaboratedType id="_3991" type="_589"/>
  <Field id="_3992" name="srcSubresource" type="_578" context="_591" access="public" location="f7:3428" file="f7" line="3428" offset="0"/>
  <Field id="_3993" name="srcOffsets" type="_7845" context="_591" access="public" location="f7:3429" file="f7" line="3429" offset="128"/>
  <Field id="_3994" name="dstSubresource" type="_578" context="_591" access="public" location="f7:3430" file="f7" line="3430" offset="320"/>
  <Field id="_3995" name="dstOffsets" type="_7845" context="_591" access="public" location="f7:3431" file="f7" line="3431" offset="448"/>
  <ElaboratedType id="_3996" type="_591"/>
  <Field id="_3997" name="srcSubresource" type="_578" context="_593" access="public" location="f7:3435" file="f7" line="3435" offset="0"/>
  <Field id="_3998" name="srcOffset" type="_380" context="_593" access="public" location="f7:3436" file="f7" line="3436" offset="128"/>
  <Field id="_3999" name="dstSubresource" type="_578" context="_593" access="public" location="f7:3437" file="f7" line="3437" offset="224"/>
  <Field id="_4000" name="dstOffset" type="_380" context="_593" access="public" location="f7:3438" file="f7" line="3438" offset="352"/>
  <Field id="_4001" name="extent" type="_376" context="_593" access="public" location="f7:3439" file="f7" line="3439" offset="448"/>
  <ElaboratedType id="_4002" type="_593"/>
  <Field id="_4003" name="srcSubresource" type="_578" context="_595" access="public" location="f7:3443" file="f7" line="3443" offset="0"/>
  <Field id="_4004" name="srcOffset" type="_380" context="_595" access="public" location="f7:3444" file="f7" line="3444" offset="128"/>
  <Field id="_4005" name="dstSubresource" type="_578" context="_595" access="public" location="f7:3445" file="f7" line="3445" offset="224"/>
  <Field id="_4006" name="dstOffset" type="_380" context="_595" access="public" location="f7:3446" file="f7" line="3446" offset="352"/>
  <Field id="_4007" name="extent" type="_376" context="_595" access="public" location="f7:3447" file="f7" line="3447" offset="448"/>
  <ElaboratedType id="_4008" type="_595"/>
  <Field id="_4009" name="sType" type="_162" context="_597" access="public" location="f7:3451" file="f7" line="3451" offset="0"/>
  <Field id="_4010" name="pNext" type="_4239" context="_597" access="public" location="f7:3452" file="f7" line="3452" offset="64"/>
  <Field id="_4011" name="renderPass" type="_146" context="_597" access="public" location="f7:3453" file="f7" line="3453" offset="128"/>
  <Field id="_4012" name="framebuffer" type="_156" context="_597" access="public" location="f7:3454" file="f7" line="3454" offset="192"/>
  <Field id="_4013" name="renderArea" type="_382" context="_597" access="public" location="f7:3455" file="f7" line="3455" offset="256"/>
  <Field id="_4014" name="clearValueCount" type="_82" context="_597" access="public" location="f7:3456" file="f7" line="3456" offset="384"/>
  <Field id="_4015" name="pClearValues" type="_7846" context="_597" access="public" location="f7:3457" file="f7" line="3457" offset="448"/>
  <ElaboratedType id="_4016" type="_597"/>
  <PointerType id="_4017" type="_7847" size="64" align="64"/>
  <PointerType id="_4018" type="_7848" size="64" align="64"/>
  <PointerType id="_4019" type="_7849" size="64" align="64"/>
  <PointerType id="_4020" type="_7850" size="64" align="64"/>
  <PointerType id="_4021" type="_7851" size="64" align="64"/>
  <PointerType id="_4022" type="_7852" size="64" align="64"/>
  <PointerType id="_4023" type="_7853" size="64" align="64"/>
  <PointerType id="_4024" type="_7854" size="64" align="64"/>
  <PointerType id="_4025" type="_7855" size="64" align="64"/>
  <PointerType id="_4026" type="_7856" size="64" align="64"/>
  <PointerType id="_4027" type="_7857" size="64" align="64"/>
  <PointerType id="_4028" type="_7858" size="64" align="64"/>
  <PointerType id="_4029" type="_7859" size="64" align="64"/>
  <PointerType id="_4030" type="_7860" size="64" align="64"/>
  <PointerType id="_4031" type="_7861" size="64" align="64"/>
  <PointerType id="_4032" type="_7862" size="64" align="64"/>
  <PointerType id="_4033" type="_7863" size="64" align="64"/>
  <PointerType id="_4034" type="_7864" size="64" align="64"/>
  <PointerType id="_4035" type="_7865" size="64" align="64"/>
  <PointerType id="_4036" type="_7866" size="64" align="64"/>
  <PointerType id="_4037" type="_7867" size="64" align="64"/>
  <PointerType id="_4038" type="_7868" size="64" align="64"/>
  <PointerType id="_4039" type="_7869" size="64" align="64"/>
  <PointerType id="_4040" type="_7870" size="64" align="64"/>
  <PointerType id="_4041" type="_7871" size="64" align="64"/>
  <PointerType id="_4042" type="_7872" size="64" align="64"/>
  <PointerType id="_4043" type="_7873" size="64" align="64"/>
  <PointerType id="_4044" type="_7874" size="64" align="64"/>
  <PointerType id="_4045" type="_7875" size="64" align="64"/>
  <PointerType id="_4046" type="_7876" size="64" align="64"/>
  <PointerType id="_4047" type="_7877" size="64" align="64"/>
  <PointerType id="_4048" type="_7878" size="64" align="64"/>
  <PointerType id="_4049" type="_7879" size="64" align="64"/>
  <PointerType id="_4050" type="_7880" size="64" align="64"/>
  <PointerType id="_4051" type="_7881" size="64" align="64"/>
  <PointerType id="_4052" type="_7882" size="64" align="64"/>
  <PointerType id="_4053" type="_7883" size="64" align="64"/>
  <PointerType id="_4054" type="_7884" size="64" align="64"/>
  <PointerType id="_4055" type="_7885" size="64" align="64"/>
  <PointerType id="_4056" type="_7886" size="64" align="64"/>
  <PointerType id="_4057" type="_7887" size="64" align="64"/>
  <PointerType id="_4058" type="_7888" size="64" align="64"/>
  <PointerType id="_4059" type="_7889" size="64" align="64"/>
  <PointerType id="_4060" type="_7890" size="64" align="64"/>
  <PointerType id="_4061" type="_7891" size="64" align="64"/>
  <PointerType id="_4062" type="_7892" size="64" align="64"/>
  <PointerType id="_4063" type="_7893" size="64" align="64"/>
  <PointerType id="_4064" type="_7894" size="64" align="64"/>
  <PointerType id="_4065" type="_7895" size="64" align="64"/>
  <PointerType id="_4066" type="_7896" size="64" align="64"/>
  <PointerType id="_4067" type="_7897" size="64" align="64"/>
  <PointerType id="_4068" type="_7898" size="64" align="64"/>
  <PointerType id="_4069" type="_7899" size="64" align="64"/>
  <PointerType id="_4070" type="_7900" size="64" align="64"/>
  <PointerType id="_4071" type="_7901" size="64" align="64"/>
  <PointerType id="_4072" type="_7902" size="64" align="64"/>
  <PointerType id="_4073" type="_7903" size="64" align="64"/>
  <PointerType id="_4074" type="_7904" size="64" align="64"/>
  <PointerType id="_4075" type="_7905" size="64" align="64"/>
  <PointerType id="_4076" type="_7906" size="64" align="64"/>
  <PointerType id="_4077" type="_7907" size="64" align="64"/>
  <PointerType id="_4078" type="_7908" size="64" align="64"/>
  <PointerType id="_4079" type="_7909" size="64" align="64"/>
  <PointerType id="_4080" type="_7910" size="64" align="64"/>
  <PointerType id="_4081" type="_7911" size="64" align="64"/>
  <PointerType id="_4082" type="_7912" size="64" align="64"/>
  <PointerType id="_4083" type="_7913" size="64" align="64"/>
  <PointerType id="_4084" type="_7914" size="64" align="64"/>
  <PointerType id="_4085" type="_7915" size="64" align="64"/>
  <PointerType id="_4086" type="_7916" size="64" align="64"/>
  <PointerType id="_4087" type="_7917" size="64" align="64"/>
  <PointerType id="_4088" type="_7918" size="64" align="64"/>
  <PointerType id="_4089" type="_7919" size="64" align="64"/>
  <PointerType id="_4090" type="_7920" size="64" align="64"/>
  <PointerType id="_4091" type="_7921" size="64" align="64"/>
  <PointerType id="_4092" type="_7922" size="64" align="64"/>
  <PointerType id="_4093" type="_7923" size="64" align="64"/>
  <PointerType id="_4094" type="_7924" size="64" align="64"/>
  <PointerType id="_4095" type="_7925" size="64" align="64"/>
  <PointerType id="_4096" type="_7926" size="64" align="64"/>
  <PointerType id="_4097" type="_7927" size="64" align="64"/>
  <PointerType id="_4098" type="_7928" size="64" align="64"/>
  <PointerType id="_4099" type="_7929" size="64" align="64"/>
  <PointerType id="_4100" type="_7930" size="64" align="64"/>
  <PointerType id="_4101" type="_7931" size="64" align="64"/>
  <PointerType id="_4102" type="_7932" size="64" align="64"/>
  <PointerType id="_4103" type="_7933" size="64" align="64"/>
  <PointerType id="_4104" type="_7934" size="64" align="64"/>
  <PointerType id="_4105" type="_7935" size="64" align="64"/>
  <PointerType id="_4106" type="_7936" size="64" align="64"/>
  <PointerType id="_4107" type="_7937" size="64" align="64"/>
  <PointerType id="_4108" type="_7938" size="64" align="64"/>
  <PointerType id="_4109" type="_7939" size="64" align="64"/>
  <PointerType id="_4110" type="_7940" size="64" align="64"/>
  <PointerType id="_4111" type="_7941" size="64" align="64"/>
  <PointerType id="_4112" type="_7942" size="64" align="64"/>
  <PointerType id="_4113" type="_7943" size="64" align="64"/>
  <PointerType id="_4114" type="_7944" size="64" align="64"/>
  <PointerType id="_4115" type="_7945" size="64" align="64"/>
  <PointerType id="_4116" type="_7946" size="64" align="64"/>
  <PointerType id="_4117" type="_7947" size="64" align="64"/>
  <PointerType id="_4118" type="_7948" size="64" align="64"/>
  <PointerType id="_4119" type="_7949" size="64" align="64"/>
  <PointerType id="_4120" type="_7950" size="64" align="64"/>
  <PointerType id="_4121" type="_7951" size="64" align="64"/>
  <PointerType id="_4122" type="_7952" size="64" align="64"/>
  <PointerType id="_4123" type="_7953" size="64" align="64"/>
  <PointerType id="_4124" type="_7954" size="64" align="64"/>
  <PointerType id="_4125" type="_7955" size="64" align="64"/>
  <PointerType id="_4126" type="_7956" size="64" align="64"/>
  <PointerType id="_4127" type="_7957" size="64" align="64"/>
  <PointerType id="_4128" type="_7958" size="64" align="64"/>
  <PointerType id="_4129" type="_7959" size="64" align="64"/>
  <PointerType id="_4130" type="_7960" size="64" align="64"/>
  <PointerType id="_4131" type="_7961" size="64" align="64"/>
  <PointerType id="_4132" type="_7962" size="64" align="64"/>
  <PointerType id="_4133" type="_7963" size="64" align="64"/>
  <PointerType id="_4134" type="_7964" size="64" align="64"/>
  <PointerType id="_4135" type="_7965" size="64" align="64"/>
  <PointerType id="_4136" type="_7966" size="64" align="64"/>
  <PointerType id="_4137" type="_7967" size="64" align="64"/>
  <PointerType id="_4138" type="_7968" size="64" align="64"/>
  <PointerType id="_4139" type="_7969" size="64" align="64"/>
  <PointerType id="_4140" type="_7970" size="64" align="64"/>
  <PointerType id="_4141" type="_7971" size="64" align="64"/>
  <PointerType id="_4142" type="_7972" size="64" align="64"/>
  <PointerType id="_4143" type="_7973" size="64" align="64"/>
  <PointerType id="_4144" type="_7974" size="64" align="64"/>
  <PointerType id="_4145" type="_7975" size="64" align="64"/>
  <PointerType id="_4146" type="_7976" size="64" align="64"/>
  <PointerType id="_4147" type="_418c" size="64" align="64"/>
  <CvQualifiedType id="_418c" type="_418" const="1"/>
  <PointerType id="_4148" type="_410c" size="64" align="64"/>
  <CvQualifiedType id="_410c" type="_410" const="1"/>
  <PointerType id="_4149" type="_114" size="64" align="64"/>
  <FundamentalType id="_4150" name="void" size="0" align="8"/>
  <PointerType id="_4151" type="_82" size="64" align="64"/>
  <PointerType id="_4152" type="_116" size="64" align="64"/>
  <PointerType id="_4153" type="_424" size="64" align="64"/>
  <PointerType id="_4154" type="_414" size="64" align="64"/>
  <PointerType id="_4155" type="_416" size="64" align="64"/>
  <PointerType id="_4156" type="_432" size="64" align="64"/>
  <PointerType id="_4157" type="_434" size="64" align="64"/>
  <PointerType id="_4158" type="_428" size="64" align="64"/>
  <PointerType id="_4159" type="_7756c" size="64" align="64"/>
  <PointerType id="_4160" type="_438c" size="64" align="64"/>
  <CvQualifiedType id="_438c" type="_438" const="1"/>
  <PointerType id="_4161" type="_118" size="64" align="64"/>
  <PointerType id="_4162" type="_440" size="64" align="64"/>
  <PointerType id="_4163" type="_442" size="64" align="64"/>
  <PointerType id="_4164" type="_120" size="64" align="64"/>
  <PointerType id="_4165" type="_444c" size="64" align="64"/>
  <CvQualifiedType id="_444c" type="_444" const="1"/>
  <PointerType id="_4166" type="_448c" size="64" align="64"/>
  <CvQualifiedType id="_448c" type="_448" const="1"/>
  <PointerType id="_4167" type="_128" size="64" align="64"/>
  <PointerType id="_4168" type="_3035" size="64" align="64"/>
  <PointerType id="_4169" type="_446c" size="64" align="64"/>
  <CvQualifiedType id="_446c" type="_446" const="1"/>
  <PointerType id="_4170" type="_106" size="64" align="64"/>
  <PointerType id="_4171" type="_450" size="64" align="64"/>
  <PointerType id="_4172" type="_468" size="64" align="64"/>
  <PointerType id="_4173" type="_466" size="64" align="64"/>
  <PointerType id="_4174" type="_464c" size="64" align="64"/>
  <CvQualifiedType id="_464c" type="_464" const="1"/>
  <PointerType id="_4175" type="_470c" size="64" align="64"/>
  <CvQualifiedType id="_470c" type="_470" const="1"/>
  <PointerType id="_4176" type="_126" size="64" align="64"/>
  <PointerType id="_4177" type="_126c" size="64" align="64"/>
  <CvQualifiedType id="_126c" type="_126" const="1"/>
  <PointerType id="_4178" type="_472c" size="64" align="64"/>
  <CvQualifiedType id="_472c" type="_472" const="1"/>
  <PointerType id="_4179" type="_122" size="64" align="64"/>
  <PointerType id="_4180" type="_474c" size="64" align="64"/>
  <CvQualifiedType id="_474c" type="_474" const="1"/>
  <PointerType id="_4181" type="_130" size="64" align="64"/>
  <PointerType id="_4182" type="_476c" size="64" align="64"/>
  <CvQualifiedType id="_476c" type="_476" const="1"/>
  <PointerType id="_4183" type="_132" size="64" align="64"/>
  <PointerType id="_4184" type="_478c" size="64" align="64"/>
  <CvQualifiedType id="_478c" type="_478" const="1"/>
  <PointerType id="_4185" type="_110" size="64" align="64"/>
  <PointerType id="_4186" type="_480c" size="64" align="64"/>
  <CvQualifiedType id="_480c" type="_480" const="1"/>
  <PointerType id="_4187" type="_134" size="64" align="64"/>
  <PointerType id="_4188" type="_482c" size="64" align="64"/>
  <CvQualifiedType id="_482c" type="_482" const="1"/>
  <PointerType id="_4189" type="_112" size="64" align="64"/>
  <PointerType id="_4190" type="_458c" size="64" align="64"/>
  <CvQualifiedType id="_458c" type="_458" const="1"/>
  <PointerType id="_4191" type="_484" size="64" align="64"/>
  <PointerType id="_4192" type="_488c" size="64" align="64"/>
  <CvQualifiedType id="_488c" type="_488" const="1"/>
  <PointerType id="_4193" type="_136" size="64" align="64"/>
  <PointerType id="_4194" type="_490c" size="64" align="64"/>
  <CvQualifiedType id="_490c" type="_490" const="1"/>
  <PointerType id="_4195" type="_138" size="64" align="64"/>
  <PointerType id="_4196" type="_492c" size="64" align="64"/>
  <CvQualifiedType id="_492c" type="_492" const="1"/>
  <PointerType id="_4197" type="_140" size="64" align="64"/>
  <PointerType id="_4198" type="_8" size="64" align="64"/>
  <PointerType id="_4199" type="_140c" size="64" align="64"/>
  <CvQualifiedType id="_140c" type="_140" const="1"/>
  <PointerType id="_4200" type="_530c" size="64" align="64"/>
  <CvQualifiedType id="_530c" type="_530" const="1"/>
  <PointerType id="_4201" type="_144" size="64" align="64"/>
  <PointerType id="_4202" type="_500c" size="64" align="64"/>
  <CvQualifiedType id="_500c" type="_500" const="1"/>
  <PointerType id="_4203" type="_534c" size="64" align="64"/>
  <CvQualifiedType id="_534c" type="_534" const="1"/>
  <PointerType id="_4204" type="_142" size="64" align="64"/>
  <PointerType id="_4205" type="_536c" size="64" align="64"/>
  <CvQualifiedType id="_536c" type="_536" const="1"/>
  <PointerType id="_4206" type="_150" size="64" align="64"/>
  <PointerType id="_4207" type="_552c" size="64" align="64"/>
  <CvQualifiedType id="_552c" type="_552" const="1"/>
  <PointerType id="_4208" type="_148" size="64" align="64"/>
  <PointerType id="_4209" type="_546c" size="64" align="64"/>
  <CvQualifiedType id="_546c" type="_546" const="1"/>
  <PointerType id="_4210" type="_154" size="64" align="64"/>
  <PointerType id="_4211" type="_548c" size="64" align="64"/>
  <CvQualifiedType id="_548c" type="_548" const="1"/>
  <PointerType id="_4212" type="_152" size="64" align="64"/>
  <PointerType id="_4213" type="_152c" size="64" align="64"/>
  <CvQualifiedType id="_152c" type="_152" const="1"/>
  <PointerType id="_4214" type="_554c" size="64" align="64"/>
  <CvQualifiedType id="_554c" type="_554" const="1"/>
  <PointerType id="_4215" type="_538c" size="64" align="64"/>
  <CvQualifiedType id="_538c" type="_538" const="1"/>
  <PointerType id="_4216" type="_560c" size="64" align="64"/>
  <CvQualifiedType id="_560c" type="_560" const="1"/>
  <PointerType id="_4217" type="_156" size="64" align="64"/>
  <PointerType id="_4218" type="_566c" size="64" align="64"/>
  <CvQualifiedType id="_566c" type="_566" const="1"/>
  <PointerType id="_4219" type="_146" size="64" align="64"/>
  <PointerType id="_4220" type="_374" size="64" align="64"/>
  <PointerType id="_4221" type="_568c" size="64" align="64"/>
  <CvQualifiedType id="_568c" type="_568" const="1"/>
  <PointerType id="_4222" type="_158" size="64" align="64"/>
  <PointerType id="_4223" type="_570c" size="64" align="64"/>
  <CvQualifiedType id="_570c" type="_570" const="1"/>
  <PointerType id="_4224" type="_124" size="64" align="64"/>
  <PointerType id="_4225" type="_124c" size="64" align="64"/>
  <CvQualifiedType id="_124c" type="_124" const="1"/>
  <PointerType id="_4226" type="_574c" size="64" align="64"/>
  <CvQualifiedType id="_574c" type="_574" const="1"/>
  <PointerType id="_4227" type="_512c" size="64" align="64"/>
  <CvQualifiedType id="_512c" type="_512" const="1"/>
  <PointerType id="_4228" type="_382c" size="64" align="64"/>
  <CvQualifiedType id="_382c" type="_382" const="1"/>
  <FundamentalType id="_4229" name="float" size="32" align="32"/>
  <PointerType id="_4230" type="_4229c" size="64" align="64"/>
  <CvQualifiedType id="_4229c" type="_4229" const="1"/>
  <ArrayType id="_4231" min="0" max="3" type="_4229c"/>
  <PointerType id="_4232" type="_82c" size="64" align="64"/>
  <CvQualifiedType id="_82c" type="_82" const="1"/>
  <PointerType id="_4233" type="_110c" size="64" align="64"/>
  <CvQualifiedType id="_110c" type="_110" const="1"/>
  <PointerType id="_4234" type="_106c" size="64" align="64"/>
  <CvQualifiedType id="_106c" type="_106" const="1"/>
  <PointerType id="_4235" type="_576c" size="64" align="64"/>
  <CvQualifiedType id="_576c" type="_576" const="1"/>
  <PointerType id="_4236" type="_594c" size="64" align="64"/>
  <CvQualifiedType id="_594c" type="_594" const="1"/>
  <PointerType id="_4237" type="_592c" size="64" align="64"/>
  <CvQualifiedType id="_592c" type="_592" const="1"/>
  <PointerType id="_4238" type="_580c" size="64" align="64"/>
  <CvQualifiedType id="_580c" type="_580" const="1"/>
  <PointerType id="_4239" type="_4150c" size="64" align="64"/>
  <CvQualifiedType id="_4150c" type="_4150" const="1"/>
  <PointerType id="_4240" type="_582c" size="64" align="64"/>
  <CvQualifiedType id="_582c" type="_582" const="1"/>
  <PointerType id="_4241" type="_396c" size="64" align="64"/>
  <CvQualifiedType id="_396c" type="_396" const="1"/>
  <PointerType id="_4242" type="_584c" size="64" align="64"/>
  <CvQualifiedType id="_584c" type="_584" const="1"/>
  <PointerType id="_4243" type="_588c" size="64" align="64"/>
  <CvQualifiedType id="_588c" type="_588" const="1"/>
  <PointerType id="_4244" type="_590c" size="64" align="64"/>
  <CvQualifiedType id="_590c" type="_590" const="1"/>
  <PointerType id="_4245" type="_596c" size="64" align="64"/>
  <CvQualifiedType id="_596c" type="_596" const="1"/>
  <PointerType id="_4246" type="_130c" size="64" align="64"/>
  <CvQualifiedType id="_130c" type="_130" const="1"/>
  <PointerType id="_4247" type="_400c" size="64" align="64"/>
  <CvQualifiedType id="_400c" type="_400" const="1"/>
  <PointerType id="_4248" type="_388c" size="64" align="64"/>
  <CvQualifiedType id="_388c" type="_388" const="1"/>
  <PointerType id="_4249" type="_398c" size="64" align="64"/>
  <CvQualifiedType id="_398c" type="_398" const="1"/>
  <PointerType id="_4250" type="_598c" size="64" align="64"/>
  <CvQualifiedType id="_598c" type="_598" const="1"/>
  <PointerType id="_4251" type="_7977" size="64" align="64"/>
  <PointerType id="_4252" type="_7978" size="64" align="64"/>
  <ElaboratedType id="_4253" type="_877"/>
  <ElaboratedType id="_4254" type="_879"/>
  <ElaboratedType id="_4255" type="_881"/>
  <ElaboratedType id="_4256" type="_883"/>
  <ElaboratedType id="_4257" type="_885"/>
  <ElaboratedType id="_4258" type="_887"/>
  <ElaboratedType id="_4259" type="_889"/>
  <ElaboratedType id="_4260" type="_892"/>
  <ElaboratedType id="_4261" type="_895"/>
  <ElaboratedType id="_4262" type="_900"/>
  <ElaboratedType id="_4263" type="_903"/>
  <ElaboratedType id="_4264" type="_906"/>
  <ElaboratedType id="_4265" type="_909"/>
  <ElaboratedType id="_4266" type="_912"/>
  <ElaboratedType id="_4267" type="_915"/>
  <ElaboratedType id="_4268" type="_918"/>
  <ElaboratedType id="_4269" type="_921"/>
  <Field id="_4270" name="sType" type="_162" context="_924" access="public" location="f7:4599" file="f7" line="4599" offset="0"/>
  <Field id="_4271" name="pNext" type="_3035" context="_924" access="public" location="f7:4600" file="f7" line="4600" offset="64"/>
  <Field id="_4272" name="subgroupSize" type="_82" context="_924" access="public" location="f7:4601" file="f7" line="4601" offset="128"/>
  <Field id="_4273" name="supportedStages" type="_329" context="_924" access="public" location="f7:4602" file="f7" line="4602" offset="160"/>
  <Field id="_4274" name="supportedOperations" type="_891" context="_924" access="public" location="f7:4603" file="f7" line="4603" offset="192"/>
  <Field id="_4275" name="quadOperationsInAllStages" type="_104" context="_924" access="public" location="f7:4604" file="f7" line="4604" offset="224"/>
  <ElaboratedType id="_4276" type="_924"/>
  <Field id="_4277" name="sType" type="_162" context="_926" access="public" location="f7:4608" file="f7" line="4608" offset="0"/>
  <Field id="_4278" name="pNext" type="_4239" context="_926" access="public" location="f7:4609" file="f7" line="4609" offset="64"/>
  <Field id="_4279" name="buffer" type="_110" context="_926" access="public" location="f7:4610" file="f7" line="4610" offset="128"/>
  <Field id="_4280" name="memory" type="_128" context="_926" access="public" location="f7:4611" file="f7" line="4611" offset="192"/>
  <Field id="_4281" name="memoryOffset" type="_106" context="_926" access="public" location="f7:4612" file="f7" line="4612" offset="256"/>
  <ElaboratedType id="_4282" type="_926"/>
  <Field id="_4283" name="sType" type="_162" context="_928" access="public" location="f7:4616" file="f7" line="4616" offset="0"/>
  <Field id="_4284" name="pNext" type="_4239" context="_928" access="public" location="f7:4617" file="f7" line="4617" offset="64"/>
  <Field id="_4285" name="image" type="_112" context="_928" access="public" location="f7:4618" file="f7" line="4618" offset="128"/>
  <Field id="_4286" name="memory" type="_128" context="_928" access="public" location="f7:4619" file="f7" line="4619" offset="192"/>
  <Field id="_4287" name="memoryOffset" type="_106" context="_928" access="public" location="f7:4620" file="f7" line="4620" offset="256"/>
  <ElaboratedType id="_4288" type="_928"/>
  <Field id="_4289" name="sType" type="_162" context="_930" access="public" location="f7:4624" file="f7" line="4624" offset="0"/>
  <Field id="_4290" name="pNext" type="_3035" context="_930" access="public" location="f7:4625" file="f7" line="4625" offset="64"/>
  <Field id="_4291" name="storageBuffer16BitAccess" type="_104" context="_930" access="public" location="f7:4626" file="f7" line="4626" offset="128"/>
  <Field id="_4292" name="uniformAndStorageBuffer16BitAccess" type="_104" context="_930" access="public" location="f7:4627" file="f7" line="4627" offset="160"/>
  <Field id="_4293" name="storagePushConstant16" type="_104" context="_930" access="public" location="f7:4628" file="f7" line="4628" offset="192"/>
  <Field id="_4294" name="storageInputOutput16" type="_104" context="_930" access="public" location="f7:4629" file="f7" line="4629" offset="224"/>
  <ElaboratedType id="_4295" type="_930"/>
  <Field id="_4296" name="sType" type="_162" context="_932" access="public" location="f7:4633" file="f7" line="4633" offset="0"/>
  <Field id="_4297" name="pNext" type="_3035" context="_932" access="public" location="f7:4634" file="f7" line="4634" offset="64"/>
  <Field id="_4298" name="prefersDedicatedAllocation" type="_104" context="_932" access="public" location="f7:4635" file="f7" line="4635" offset="128"/>
  <Field id="_4299" name="requiresDedicatedAllocation" type="_104" context="_932" access="public" location="f7:4636" file="f7" line="4636" offset="160"/>
  <ElaboratedType id="_4300" type="_932"/>
  <Field id="_4301" name="sType" type="_162" context="_934" access="public" location="f7:4640" file="f7" line="4640" offset="0"/>
  <Field id="_4302" name="pNext" type="_4239" context="_934" access="public" location="f7:4641" file="f7" line="4641" offset="64"/>
  <Field id="_4303" name="image" type="_112" context="_934" access="public" location="f7:4642" file="f7" line="4642" offset="128"/>
  <Field id="_4304" name="buffer" type="_110" context="_934" access="public" location="f7:4643" file="f7" line="4643" offset="192"/>
  <ElaboratedType id="_4305" type="_934"/>
  <Field id="_4306" name="sType" type="_162" context="_936" access="public" location="f7:4647" file="f7" line="4647" offset="0"/>
  <Field id="_4307" name="pNext" type="_4239" context="_936" access="public" location="f7:4648" file="f7" line="4648" offset="64"/>
  <Field id="_4308" name="flags" type="_897" context="_936" access="public" location="f7:4649" file="f7" line="4649" offset="128"/>
  <Field id="_4309" name="deviceMask" type="_82" context="_936" access="public" location="f7:4650" file="f7" line="4650" offset="160"/>
  <ElaboratedType id="_4310" type="_936"/>
  <Field id="_4311" name="sType" type="_162" context="_938" access="public" location="f7:4654" file="f7" line="4654" offset="0"/>
  <Field id="_4312" name="pNext" type="_4239" context="_938" access="public" location="f7:4655" file="f7" line="4655" offset="64"/>
  <Field id="_4313" name="deviceMask" type="_82" context="_938" access="public" location="f7:4656" file="f7" line="4656" offset="128"/>
  <Field id="_4314" name="deviceRenderAreaCount" type="_82" context="_938" access="public" location="f7:4657" file="f7" line="4657" offset="160"/>
  <Field id="_4315" name="pDeviceRenderAreas" type="_4228" context="_938" access="public" location="f7:4658" file="f7" line="4658" offset="192"/>
  <ElaboratedType id="_4316" type="_938"/>
  <Field id="_4317" name="sType" type="_162" context="_940" access="public" location="f7:4662" file="f7" line="4662" offset="0"/>
  <Field id="_4318" name="pNext" type="_4239" context="_940" access="public" location="f7:4663" file="f7" line="4663" offset="64"/>
  <Field id="_4319" name="deviceMask" type="_82" context="_940" access="public" location="f7:4664" file="f7" line="4664" offset="128"/>
  <ElaboratedType id="_4320" type="_940"/>
  <Field id="_4321" name="sType" type="_162" context="_942" access="public" location="f7:4668" file="f7" line="4668" offset="0"/>
  <Field id="_4322" name="pNext" type="_4239" context="_942" access="public" location="f7:4669" file="f7" line="4669" offset="64"/>
  <Field id="_4323" name="waitSemaphoreCount" type="_82" context="_942" access="public" location="f7:4670" file="f7" line="4670" offset="128"/>
  <Field id="_4324" name="pWaitSemaphoreDeviceIndices" type="_4232" context="_942" access="public" location="f7:4671" file="f7" line="4671" offset="192"/>
  <Field id="_4325" name="commandBufferCount" type="_82" context="_942" access="public" location="f7:4672" file="f7" line="4672" offset="256"/>
  <Field id="_4326" name="pCommandBufferDeviceMasks" type="_4232" context="_942" access="public" location="f7:4673" file="f7" line="4673" offset="320"/>
  <Field id="_4327" name="signalSemaphoreCount" type="_82" context="_942" access="public" location="f7:4674" file="f7" line="4674" offset="384"/>
  <Field id="_4328" name="pSignalSemaphoreDeviceIndices" type="_4232" context="_942" access="public" location="f7:4675" file="f7" line="4675" offset="448"/>
  <ElaboratedType id="_4329" type="_942"/>
  <Field id="_4330" name="sType" type="_162" context="_944" access="public" location="f7:4679" file="f7" line="4679" offset="0"/>
  <Field id="_4331" name="pNext" type="_4239" context="_944" access="public" location="f7:4680" file="f7" line="4680" offset="64"/>
  <Field id="_4332" name="resourceDeviceIndex" type="_82" context="_944" access="public" location="f7:4681" file="f7" line="4681" offset="128"/>
  <Field id="_4333" name="memoryDeviceIndex" type="_82" context="_944" access="public" location="f7:4682" file="f7" line="4682" offset="160"/>
  <ElaboratedType id="_4334" type="_944"/>
  <Field id="_4335" name="sType" type="_162" context="_946" access="public" location="f7:4686" file="f7" line="4686" offset="0"/>
  <Field id="_4336" name="pNext" type="_4239" context="_946" access="public" location="f7:4687" file="f7" line="4687" offset="64"/>
  <Field id="_4337" name="deviceIndexCount" type="_82" context="_946" access="public" location="f7:4688" file="f7" line="4688" offset="128"/>
  <Field id="_4338" name="pDeviceIndices" type="_4232" context="_946" access="public" location="f7:4689" file="f7" line="4689" offset="192"/>
  <ElaboratedType id="_4339" type="_946"/>
  <Field id="_4340" name="sType" type="_162" context="_948" access="public" location="f7:4693" file="f7" line="4693" offset="0"/>
  <Field id="_4341" name="pNext" type="_4239" context="_948" access="public" location="f7:4694" file="f7" line="4694" offset="64"/>
  <Field id="_4342" name="deviceIndexCount" type="_82" context="_948" access="public" location="f7:4695" file="f7" line="4695" offset="128"/>
  <Field id="_4343" name="pDeviceIndices" type="_4232" context="_948" access="public" location="f7:4696" file="f7" line="4696" offset="192"/>
  <Field id="_4344" name="splitInstanceBindRegionCount" type="_82" context="_948" access="public" location="f7:4697" file="f7" line="4697" offset="256"/>
  <Field id="_4345" name="pSplitInstanceBindRegions" type="_4228" context="_948" access="public" location="f7:4698" file="f7" line="4698" offset="320"/>
  <ElaboratedType id="_4346" type="_948"/>
  <Field id="_4347" name="sType" type="_162" context="_950" access="public" location="f7:4702" file="f7" line="4702" offset="0"/>
  <Field id="_4348" name="pNext" type="_3035" context="_950" access="public" location="f7:4703" file="f7" line="4703" offset="64"/>
  <Field id="_4349" name="physicalDeviceCount" type="_82" context="_950" access="public" location="f7:4704" file="f7" line="4704" offset="128"/>
  <Field id="_4350" name="physicalDevices" type="_7979" context="_950" access="public" location="f7:4705" file="f7" line="4705" offset="192"/>
  <Field id="_4351" name="subsetAllocation" type="_104" context="_950" access="public" location="f7:4706" file="f7" line="4706" offset="2240"/>
  <ElaboratedType id="_4352" type="_950"/>
  <Field id="_4353" name="sType" type="_162" context="_952" access="public" location="f7:4710" file="f7" line="4710" offset="0"/>
  <Field id="_4354" name="pNext" type="_4239" context="_952" access="public" location="f7:4711" file="f7" line="4711" offset="64"/>
  <Field id="_4355" name="physicalDeviceCount" type="_82" context="_952" access="public" location="f7:4712" file="f7" line="4712" offset="128"/>
  <Field id="_4356" name="pPhysicalDevices" type="_7980" context="_952" access="public" location="f7:4713" file="f7" line="4713" offset="192"/>
  <ElaboratedType id="_4357" type="_952"/>
  <Field id="_4358" name="sType" type="_162" context="_954" access="public" location="f7:4717" file="f7" line="4717" offset="0"/>
  <Field id="_4359" name="pNext" type="_4239" context="_954" access="public" location="f7:4718" file="f7" line="4718" offset="64"/>
  <Field id="_4360" name="buffer" type="_110" context="_954" access="public" location="f7:4719" file="f7" line="4719" offset="128"/>
  <ElaboratedType id="_4361" type="_954"/>
  <Field id="_4362" name="sType" type="_162" context="_956" access="public" location="f7:4723" file="f7" line="4723" offset="0"/>
  <Field id="_4363" name="pNext" type="_4239" context="_956" access="public" location="f7:4724" file="f7" line="4724" offset="64"/>
  <Field id="_4364" name="image" type="_112" context="_956" access="public" location="f7:4725" file="f7" line="4725" offset="128"/>
  <ElaboratedType id="_4365" type="_956"/>
  <Field id="_4366" name="sType" type="_162" context="_958" access="public" location="f7:4729" file="f7" line="4729" offset="0"/>
  <Field id="_4367" name="pNext" type="_4239" context="_958" access="public" location="f7:4730" file="f7" line="4730" offset="64"/>
  <Field id="_4368" name="image" type="_112" context="_958" access="public" location="f7:4731" file="f7" line="4731" offset="128"/>
  <ElaboratedType id="_4369" type="_958"/>
  <Field id="_4370" name="sType" type="_162" context="_960" access="public" location="f7:4735" file="f7" line="4735" offset="0"/>
  <Field id="_4371" name="pNext" type="_3035" context="_960" access="public" location="f7:4736" file="f7" line="4736" offset="64"/>
  <Field id="_4372" name="memoryRequirements" type="_450" context="_960" access="public" location="f7:4737" file="f7" line="4737" offset="128"/>
  <ElaboratedType id="_4373" type="_960"/>
  <Field id="_4374" name="sType" type="_162" context="_962" access="public" location="f7:4741" file="f7" line="4741" offset="0"/>
  <Field id="_4375" name="pNext" type="_3035" context="_962" access="public" location="f7:4742" file="f7" line="4742" offset="64"/>
  <Field id="_4376" name="memoryRequirements" type="_468" context="_962" access="public" location="f7:4743" file="f7" line="4743" offset="128"/>
  <ElaboratedType id="_4377" type="_962"/>
  <Field id="_4378" name="sType" type="_162" context="_964" access="public" location="f7:4747" file="f7" line="4747" offset="0"/>
  <Field id="_4379" name="pNext" type="_3035" context="_964" access="public" location="f7:4748" file="f7" line="4748" offset="64"/>
  <Field id="_4380" name="features" type="_424" context="_964" access="public" location="f7:4749" file="f7" line="4749" offset="128"/>
  <ElaboratedType id="_4381" type="_964"/>
  <Field id="_4382" name="sType" type="_162" context="_966" access="public" location="f7:4753" file="f7" line="4753" offset="0"/>
  <Field id="_4383" name="pNext" type="_3035" context="_966" access="public" location="f7:4754" file="f7" line="4754" offset="64"/>
  <Field id="_4384" name="properties" type="_432" context="_966" access="public" location="f7:4755" file="f7" line="4755" offset="128"/>
  <ElaboratedType id="_4385" type="_966"/>
  <Field id="_4386" name="sType" type="_162" context="_968" access="public" location="f7:4759" file="f7" line="4759" offset="0"/>
  <Field id="_4387" name="pNext" type="_3035" context="_968" access="public" location="f7:4760" file="f7" line="4760" offset="64"/>
  <Field id="_4388" name="formatProperties" type="_414" context="_968" access="public" location="f7:4761" file="f7" line="4761" offset="128"/>
  <ElaboratedType id="_4389" type="_968"/>
  <Field id="_4390" name="sType" type="_162" context="_970" access="public" location="f7:4765" file="f7" line="4765" offset="0"/>
  <Field id="_4391" name="pNext" type="_3035" context="_970" access="public" location="f7:4766" file="f7" line="4766" offset="64"/>
  <Field id="_4392" name="imageFormatProperties" type="_416" context="_970" access="public" location="f7:4767" file="f7" line="4767" offset="128"/>
  <ElaboratedType id="_4393" type="_970"/>
  <Field id="_4394" name="sType" type="_162" context="_972" access="public" location="f7:4771" file="f7" line="4771" offset="0"/>
  <Field id="_4395" name="pNext" type="_4239" context="_972" access="public" location="f7:4772" file="f7" line="4772" offset="64"/>
  <Field id="_4396" name="format" type="_176" context="_972" access="public" location="f7:4773" file="f7" line="4773" offset="128"/>
  <Field id="_4397" name="type" type="_180" context="_972" access="public" location="f7:4774" file="f7" line="4774" offset="160"/>
  <Field id="_4398" name="tiling" type="_178" context="_972" access="public" location="f7:4775" file="f7" line="4775" offset="192"/>
  <Field id="_4399" name="usage" type="_250" context="_972" access="public" location="f7:4776" file="f7" line="4776" offset="224"/>
  <Field id="_4400" name="flags" type="_244" context="_972" access="public" location="f7:4777" file="f7" line="4777" offset="256"/>
  <ElaboratedType id="_4401" type="_972"/>
  <Field id="_4402" name="sType" type="_162" context="_974" access="public" location="f7:4781" file="f7" line="4781" offset="0"/>
  <Field id="_4403" name="pNext" type="_3035" context="_974" access="public" location="f7:4782" file="f7" line="4782" offset="64"/>
  <Field id="_4404" name="queueFamilyProperties" type="_434" context="_974" access="public" location="f7:4783" file="f7" line="4783" offset="128"/>
  <ElaboratedType id="_4405" type="_974"/>
  <Field id="_4406" name="sType" type="_162" context="_976" access="public" location="f7:4787" file="f7" line="4787" offset="0"/>
  <Field id="_4407" name="pNext" type="_3035" context="_976" access="public" location="f7:4788" file="f7" line="4788" offset="64"/>
  <Field id="_4408" name="memoryProperties" type="_428" context="_976" access="public" location="f7:4789" file="f7" line="4789" offset="128"/>
  <ElaboratedType id="_4409" type="_976"/>
  <Field id="_4410" name="sType" type="_162" context="_978" access="public" location="f7:4793" file="f7" line="4793" offset="0"/>
  <Field id="_4411" name="pNext" type="_3035" context="_978" access="public" location="f7:4794" file="f7" line="4794" offset="64"/>
  <Field id="_4412" name="properties" type="_466" context="_978" access="public" location="f7:4795" file="f7" line="4795" offset="128"/>
  <ElaboratedType id="_4413" type="_978"/>
  <Field id="_4414" name="sType" type="_162" context="_980" access="public" location="f7:4799" file="f7" line="4799" offset="0"/>
  <Field id="_4415" name="pNext" type="_4239" context="_980" access="public" location="f7:4800" file="f7" line="4800" offset="64"/>
  <Field id="_4416" name="format" type="_176" context="_980" access="public" location="f7:4801" file="f7" line="4801" offset="128"/>
  <Field id="_4417" name="type" type="_180" context="_980" access="public" location="f7:4802" file="f7" line="4802" offset="160"/>
  <Field id="_4418" name="samples" type="_246" context="_980" access="public" location="f7:4803" file="f7" line="4803" offset="192"/>
  <Field id="_4419" name="usage" type="_250" context="_980" access="public" location="f7:4804" file="f7" line="4804" offset="224"/>
  <Field id="_4420" name="tiling" type="_178" context="_980" access="public" location="f7:4805" file="f7" line="4805" offset="256"/>
  <ElaboratedType id="_4421" type="_980"/>
  <Field id="_4422" name="sType" type="_162" context="_982" access="public" location="f7:4809" file="f7" line="4809" offset="0"/>
  <Field id="_4423" name="pNext" type="_3035" context="_982" access="public" location="f7:4810" file="f7" line="4810" offset="64"/>
  <Field id="_4424" name="pointClippingBehavior" type="_878" context="_982" access="public" location="f7:4811" file="f7" line="4811" offset="128"/>
  <ElaboratedType id="_4425" type="_982"/>
  <Field id="_4426" name="subpass" type="_82" context="_984" access="public" location="f7:4815" file="f7" line="4815" offset="0"/>
  <Field id="_4427" name="inputAttachmentIndex" type="_82" context="_984" access="public" location="f7:4816" file="f7" line="4816" offset="32"/>
  <Field id="_4428" name="aspectMask" type="_238" context="_984" access="public" location="f7:4817" file="f7" line="4817" offset="64"/>
  <ElaboratedType id="_4429" type="_984"/>
  <Field id="_4430" name="sType" type="_162" context="_986" access="public" location="f7:4821" file="f7" line="4821" offset="0"/>
  <Field id="_4431" name="pNext" type="_4239" context="_986" access="public" location="f7:4822" file="f7" line="4822" offset="64"/>
  <Field id="_4432" name="aspectReferenceCount" type="_82" context="_986" access="public" location="f7:4823" file="f7" line="4823" offset="128"/>
  <Field id="_4433" name="pAspectReferences" type="_7981" context="_986" access="public" location="f7:4824" file="f7" line="4824" offset="192"/>
  <ElaboratedType id="_4434" type="_986"/>
  <Field id="_4435" name="sType" type="_162" context="_988" access="public" location="f7:4828" file="f7" line="4828" offset="0"/>
  <Field id="_4436" name="pNext" type="_4239" context="_988" access="public" location="f7:4829" file="f7" line="4829" offset="64"/>
  <Field id="_4437" name="usage" type="_250" context="_988" access="public" location="f7:4830" file="f7" line="4830" offset="128"/>
  <ElaboratedType id="_4438" type="_988"/>
  <Field id="_4439" name="sType" type="_162" context="_990" access="public" location="f7:4834" file="f7" line="4834" offset="0"/>
  <Field id="_4440" name="pNext" type="_4239" context="_990" access="public" location="f7:4835" file="f7" line="4835" offset="64"/>
  <Field id="_4441" name="domainOrigin" type="_880" context="_990" access="public" location="f7:4836" file="f7" line="4836" offset="128"/>
  <ElaboratedType id="_4442" type="_990"/>
  <Field id="_4443" name="sType" type="_162" context="_992" access="public" location="f7:4840" file="f7" line="4840" offset="0"/>
  <Field id="_4444" name="pNext" type="_4239" context="_992" access="public" location="f7:4841" file="f7" line="4841" offset="64"/>
  <Field id="_4445" name="subpassCount" type="_82" context="_992" access="public" location="f7:4842" file="f7" line="4842" offset="128"/>
  <Field id="_4446" name="pViewMasks" type="_4232" context="_992" access="public" location="f7:4843" file="f7" line="4843" offset="192"/>
  <Field id="_4447" name="dependencyCount" type="_82" context="_992" access="public" location="f7:4844" file="f7" line="4844" offset="256"/>
  <Field id="_4448" name="pViewOffsets" type="_7534" context="_992" access="public" location="f7:4845" file="f7" line="4845" offset="320"/>
  <Field id="_4449" name="correlationMaskCount" type="_82" context="_992" access="public" location="f7:4846" file="f7" line="4846" offset="384"/>
  <Field id="_4450" name="pCorrelationMasks" type="_4232" context="_992" access="public" location="f7:4847" file="f7" line="4847" offset="448"/>
  <ElaboratedType id="_4451" type="_992"/>
  <Field id="_4452" name="sType" type="_162" context="_994" access="public" location="f7:4851" file="f7" line="4851" offset="0"/>
  <Field id="_4453" name="pNext" type="_3035" context="_994" access="public" location="f7:4852" file="f7" line="4852" offset="64"/>
  <Field id="_4454" name="multiview" type="_104" context="_994" access="public" location="f7:4853" file="f7" line="4853" offset="128"/>
  <Field id="_4455" name="multiviewGeometryShader" type="_104" context="_994" access="public" location="f7:4854" file="f7" line="4854" offset="160"/>
  <Field id="_4456" name="multiviewTessellationShader" type="_104" context="_994" access="public" location="f7:4855" file="f7" line="4855" offset="192"/>
  <ElaboratedType id="_4457" type="_994"/>
  <Field id="_4458" name="sType" type="_162" context="_996" access="public" location="f7:4859" file="f7" line="4859" offset="0"/>
  <Field id="_4459" name="pNext" type="_3035" context="_996" access="public" location="f7:4860" file="f7" line="4860" offset="64"/>
  <Field id="_4460" name="maxMultiviewViewCount" type="_82" context="_996" access="public" location="f7:4861" file="f7" line="4861" offset="128"/>
  <Field id="_4461" name="maxMultiviewInstanceIndex" type="_82" context="_996" access="public" location="f7:4862" file="f7" line="4862" offset="160"/>
  <ElaboratedType id="_4462" type="_996"/>
  <Field id="_4463" name="sType" type="_162" context="_998" access="public" location="f7:4866" file="f7" line="4866" offset="0"/>
  <Field id="_4464" name="pNext" type="_3035" context="_998" access="public" location="f7:4867" file="f7" line="4867" offset="64"/>
  <Field id="_4465" name="variablePointersStorageBuffer" type="_104" context="_998" access="public" location="f7:4868" file="f7" line="4868" offset="128"/>
  <Field id="_4466" name="variablePointers" type="_104" context="_998" access="public" location="f7:4869" file="f7" line="4869" offset="160"/>
  <ElaboratedType id="_4467" type="_998"/>
  <Field id="_4468" name="sType" type="_162" context="_1001" access="public" location="f7:4875" file="f7" line="4875" offset="0"/>
  <Field id="_4469" name="pNext" type="_3035" context="_1001" access="public" location="f7:4876" file="f7" line="4876" offset="64"/>
  <Field id="_4470" name="protectedMemory" type="_104" context="_1001" access="public" location="f7:4877" file="f7" line="4877" offset="128"/>
  <ElaboratedType id="_4471" type="_1001"/>
  <Field id="_4472" name="sType" type="_162" context="_1003" access="public" location="f7:4881" file="f7" line="4881" offset="0"/>
  <Field id="_4473" name="pNext" type="_3035" context="_1003" access="public" location="f7:4882" file="f7" line="4882" offset="64"/>
  <Field id="_4474" name="protectedNoFault" type="_104" context="_1003" access="public" location="f7:4883" file="f7" line="4883" offset="128"/>
  <ElaboratedType id="_4475" type="_1003"/>
  <Field id="_4476" name="sType" type="_162" context="_1005" access="public" location="f7:4887" file="f7" line="4887" offset="0"/>
  <Field id="_4477" name="pNext" type="_4239" context="_1005" access="public" location="f7:4888" file="f7" line="4888" offset="64"/>
  <Field id="_4478" name="flags" type="_264" context="_1005" access="public" location="f7:4889" file="f7" line="4889" offset="128"/>
  <Field id="_4479" name="queueFamilyIndex" type="_82" context="_1005" access="public" location="f7:4890" file="f7" line="4890" offset="160"/>
  <Field id="_4480" name="queueIndex" type="_82" context="_1005" access="public" location="f7:4891" file="f7" line="4891" offset="192"/>
  <ElaboratedType id="_4481" type="_1005"/>
  <Field id="_4482" name="sType" type="_162" context="_1007" access="public" location="f7:4895" file="f7" line="4895" offset="0"/>
  <Field id="_4483" name="pNext" type="_4239" context="_1007" access="public" location="f7:4896" file="f7" line="4896" offset="64"/>
  <Field id="_4484" name="protectedSubmit" type="_104" context="_1007" access="public" location="f7:4897" file="f7" line="4897" offset="128"/>
  <ElaboratedType id="_4485" type="_1007"/>
  <Field id="_4486" name="sType" type="_162" context="_1009" access="public" location="f7:4901" file="f7" line="4901" offset="0"/>
  <Field id="_4487" name="pNext" type="_4239" context="_1009" access="public" location="f7:4902" file="f7" line="4902" offset="64"/>
  <Field id="_4488" name="format" type="_176" context="_1009" access="public" location="f7:4903" file="f7" line="4903" offset="128"/>
  <Field id="_4489" name="ycbcrModel" type="_882" context="_1009" access="public" location="f7:4904" file="f7" line="4904" offset="160"/>
  <Field id="_4490" name="ycbcrRange" type="_884" context="_1009" access="public" location="f7:4905" file="f7" line="4905" offset="192"/>
  <Field id="_4491" name="components" type="_486" context="_1009" access="public" location="f7:4906" file="f7" line="4906" offset="224"/>
  <Field id="_4492" name="xChromaOffset" type="_886" context="_1009" access="public" location="f7:4907" file="f7" line="4907" offset="352"/>
  <Field id="_4493" name="yChromaOffset" type="_886" context="_1009" access="public" location="f7:4908" file="f7" line="4908" offset="384"/>
  <Field id="_4494" name="chromaFilter" type="_214" context="_1009" access="public" location="f7:4909" file="f7" line="4909" offset="416"/>
  <Field id="_4495" name="forceExplicitReconstruction" type="_104" context="_1009" access="public" location="f7:4910" file="f7" line="4910" offset="448"/>
  <ElaboratedType id="_4496" type="_1009"/>
  <Field id="_4497" name="sType" type="_162" context="_1011" access="public" location="f7:4914" file="f7" line="4914" offset="0"/>
  <Field id="_4498" name="pNext" type="_4239" context="_1011" access="public" location="f7:4915" file="f7" line="4915" offset="64"/>
  <Field id="_4499" name="conversion" type="_874" context="_1011" access="public" location="f7:4916" file="f7" line="4916" offset="128"/>
  <ElaboratedType id="_4500" type="_1011"/>
  <Field id="_4501" name="sType" type="_162" context="_1013" access="public" location="f7:4920" file="f7" line="4920" offset="0"/>
  <Field id="_4502" name="pNext" type="_4239" context="_1013" access="public" location="f7:4921" file="f7" line="4921" offset="64"/>
  <Field id="_4503" name="planeAspect" type="_237" context="_1013" access="public" location="f7:4922" file="f7" line="4922" offset="128"/>
  <ElaboratedType id="_4504" type="_1013"/>
  <Field id="_4505" name="sType" type="_162" context="_1015" access="public" location="f7:4926" file="f7" line="4926" offset="0"/>
  <Field id="_4506" name="pNext" type="_4239" context="_1015" access="public" location="f7:4927" file="f7" line="4927" offset="64"/>
  <Field id="_4507" name="planeAspect" type="_237" context="_1015" access="public" location="f7:4928" file="f7" line="4928" offset="128"/>
  <ElaboratedType id="_4508" type="_1015"/>
  <Field id="_4509" name="sType" type="_162" context="_1017" access="public" location="f7:4932" file="f7" line="4932" offset="0"/>
  <Field id="_4510" name="pNext" type="_3035" context="_1017" access="public" location="f7:4933" file="f7" line="4933" offset="64"/>
  <Field id="_4511" name="samplerYcbcrConversion" type="_104" context="_1017" access="public" location="f7:4934" file="f7" line="4934" offset="128"/>
  <ElaboratedType id="_4512" type="_1017"/>
  <Field id="_4513" name="sType" type="_162" context="_1019" access="public" location="f7:4938" file="f7" line="4938" offset="0"/>
  <Field id="_4514" name="pNext" type="_3035" context="_1019" access="public" location="f7:4939" file="f7" line="4939" offset="64"/>
  <Field id="_4515" name="combinedImageSamplerDescriptorCount" type="_82" context="_1019" access="public" location="f7:4940" file="f7" line="4940" offset="128"/>
  <ElaboratedType id="_4516" type="_1019"/>
  <Field id="_4517" name="dstBinding" type="_82" context="_1021" access="public" location="f7:4944" file="f7" line="4944" offset="0"/>
  <Field id="_4518" name="dstArrayElement" type="_82" context="_1021" access="public" location="f7:4945" file="f7" line="4945" offset="32"/>
  <Field id="_4519" name="descriptorCount" type="_82" context="_1021" access="public" location="f7:4946" file="f7" line="4946" offset="64"/>
  <Field id="_4520" name="descriptorType" type="_220" context="_1021" access="public" location="f7:4947" file="f7" line="4947" offset="96"/>
  <Field id="_4521" name="offset" type="_8" context="_1021" access="public" location="f7:4948" file="f7" line="4948" offset="128"/>
  <Field id="_4522" name="stride" type="_8" context="_1021" access="public" location="f7:4949" file="f7" line="4949" offset="192"/>
  <ElaboratedType id="_4523" type="_1021"/>
  <Field id="_4524" name="sType" type="_162" context="_1023" access="public" location="f7:4953" file="f7" line="4953" offset="0"/>
  <Field id="_4525" name="pNext" type="_4239" context="_1023" access="public" location="f7:4954" file="f7" line="4954" offset="64"/>
  <Field id="_4526" name="flags" type="_899" context="_1023" access="public" location="f7:4955" file="f7" line="4955" offset="128"/>
  <Field id="_4527" name="descriptorUpdateEntryCount" type="_82" context="_1023" access="public" location="f7:4956" file="f7" line="4956" offset="160"/>
  <Field id="_4528" name="pDescriptorUpdateEntries" type="_7982" context="_1023" access="public" location="f7:4957" file="f7" line="4957" offset="192"/>
  <Field id="_4529" name="templateType" type="_888" context="_1023" access="public" location="f7:4958" file="f7" line="4958" offset="256"/>
  <Field id="_4530" name="descriptorSetLayout" type="_148" context="_1023" access="public" location="f7:4959" file="f7" line="4959" offset="320"/>
  <Field id="_4531" name="pipelineBindPoint" type="_226" context="_1023" access="public" location="f7:4960" file="f7" line="4960" offset="384"/>
  <Field id="_4532" name="pipelineLayout" type="_142" context="_1023" access="public" location="f7:4961" file="f7" line="4961" offset="448"/>
  <Field id="_4533" name="set" type="_82" context="_1023" access="public" location="f7:4962" file="f7" line="4962" offset="512"/>
  <ElaboratedType id="_4534" type="_1023"/>
  <Field id="_4535" name="externalMemoryFeatures" type="_905" context="_1025" access="public" location="f7:4966" file="f7" line="4966" offset="0"/>
  <Field id="_4536" name="exportFromImportedHandleTypes" type="_902" context="_1025" access="public" location="f7:4967" file="f7" line="4967" offset="32"/>
  <Field id="_4537" name="compatibleHandleTypes" type="_902" context="_1025" access="public" location="f7:4968" file="f7" line="4968" offset="64"/>
  <ElaboratedType id="_4538" type="_1025"/>
  <Field id="_4539" name="sType" type="_162" context="_1027" access="public" location="f7:4972" file="f7" line="4972" offset="0"/>
  <Field id="_4540" name="pNext" type="_4239" context="_1027" access="public" location="f7:4973" file="f7" line="4973" offset="64"/>
  <Field id="_4541" name="handleType" type="_901" context="_1027" access="public" location="f7:4974" file="f7" line="4974" offset="128"/>
  <ElaboratedType id="_4542" type="_1027"/>
  <Field id="_4543" name="sType" type="_162" context="_1029" access="public" location="f7:4978" file="f7" line="4978" offset="0"/>
  <Field id="_4544" name="pNext" type="_3035" context="_1029" access="public" location="f7:4979" file="f7" line="4979" offset="64"/>
  <Field id="_4545" name="externalMemoryProperties" type="_1026" context="_1029" access="public" location="f7:4980" file="f7" line="4980" offset="128"/>
  <ElaboratedType id="_4546" type="_1029"/>
  <Field id="_4547" name="sType" type="_162" context="_1031" access="public" location="f7:4984" file="f7" line="4984" offset="0"/>
  <Field id="_4548" name="pNext" type="_4239" context="_1031" access="public" location="f7:4985" file="f7" line="4985" offset="64"/>
  <Field id="_4549" name="flags" type="_291" context="_1031" access="public" location="f7:4986" file="f7" line="4986" offset="128"/>
  <Field id="_4550" name="usage" type="_294" context="_1031" access="public" location="f7:4987" file="f7" line="4987" offset="160"/>
  <Field id="_4551" name="handleType" type="_901" context="_1031" access="public" location="f7:4988" file="f7" line="4988" offset="192"/>
  <ElaboratedType id="_4552" type="_1031"/>
  <Field id="_4553" name="sType" type="_162" context="_1033" access="public" location="f7:4992" file="f7" line="4992" offset="0"/>
  <Field id="_4554" name="pNext" type="_3035" context="_1033" access="public" location="f7:4993" file="f7" line="4993" offset="64"/>
  <Field id="_4555" name="externalMemoryProperties" type="_1026" context="_1033" access="public" location="f7:4994" file="f7" line="4994" offset="128"/>
  <ElaboratedType id="_4556" type="_1033"/>
  <Field id="_4557" name="sType" type="_162" context="_1035" access="public" location="f7:4998" file="f7" line="4998" offset="0"/>
  <Field id="_4558" name="pNext" type="_3035" context="_1035" access="public" location="f7:4999" file="f7" line="4999" offset="64"/>
  <Field id="_4559" name="deviceUUID" type="_7788" context="_1035" access="public" location="f7:5000" file="f7" line="5000" offset="128"/>
  <Field id="_4560" name="driverUUID" type="_7788" context="_1035" access="public" location="f7:5001" file="f7" line="5001" offset="256"/>
  <Field id="_4561" name="deviceLUID" type="_7983" context="_1035" access="public" location="f7:5002" file="f7" line="5002" offset="384"/>
  <Field id="_4562" name="deviceNodeMask" type="_82" context="_1035" access="public" location="f7:5003" file="f7" line="5003" offset="448"/>
  <Field id="_4563" name="deviceLUIDValid" type="_104" context="_1035" access="public" location="f7:5004" file="f7" line="5004" offset="480"/>
  <ElaboratedType id="_4564" type="_1035"/>
  <Field id="_4565" name="sType" type="_162" context="_1037" access="public" location="f7:5008" file="f7" line="5008" offset="0"/>
  <Field id="_4566" name="pNext" type="_4239" context="_1037" access="public" location="f7:5009" file="f7" line="5009" offset="64"/>
  <Field id="_4567" name="handleTypes" type="_902" context="_1037" access="public" location="f7:5010" file="f7" line="5010" offset="128"/>
  <ElaboratedType id="_4568" type="_1037"/>
  <Field id="_4569" name="sType" type="_162" context="_1039" access="public" location="f7:5014" file="f7" line="5014" offset="0"/>
  <Field id="_4570" name="pNext" type="_4239" context="_1039" access="public" location="f7:5015" file="f7" line="5015" offset="64"/>
  <Field id="_4571" name="handleTypes" type="_902" context="_1039" access="public" location="f7:5016" file="f7" line="5016" offset="128"/>
  <ElaboratedType id="_4572" type="_1039"/>
  <Field id="_4573" name="sType" type="_162" context="_1041" access="public" location="f7:5020" file="f7" line="5020" offset="0"/>
  <Field id="_4574" name="pNext" type="_4239" context="_1041" access="public" location="f7:5021" file="f7" line="5021" offset="64"/>
  <Field id="_4575" name="handleTypes" type="_902" context="_1041" access="public" location="f7:5022" file="f7" line="5022" offset="128"/>
  <ElaboratedType id="_4576" type="_1041"/>
  <Field id="_4577" name="sType" type="_162" context="_1043" access="public" location="f7:5026" file="f7" line="5026" offset="0"/>
  <Field id="_4578" name="pNext" type="_4239" context="_1043" access="public" location="f7:5027" file="f7" line="5027" offset="64"/>
  <Field id="_4579" name="handleType" type="_907" context="_1043" access="public" location="f7:5028" file="f7" line="5028" offset="128"/>
  <ElaboratedType id="_4580" type="_1043"/>
  <Field id="_4581" name="sType" type="_162" context="_1045" access="public" location="f7:5032" file="f7" line="5032" offset="0"/>
  <Field id="_4582" name="pNext" type="_3035" context="_1045" access="public" location="f7:5033" file="f7" line="5033" offset="64"/>
  <Field id="_4583" name="exportFromImportedHandleTypes" type="_908" context="_1045" access="public" location="f7:5034" file="f7" line="5034" offset="128"/>
  <Field id="_4584" name="compatibleHandleTypes" type="_908" context="_1045" access="public" location="f7:5035" file="f7" line="5035" offset="160"/>
  <Field id="_4585" name="externalFenceFeatures" type="_911" context="_1045" access="public" location="f7:5036" file="f7" line="5036" offset="192"/>
  <ElaboratedType id="_4586" type="_1045"/>
  <Field id="_4587" name="sType" type="_162" context="_1047" access="public" location="f7:5040" file="f7" line="5040" offset="0"/>
  <Field id="_4588" name="pNext" type="_4239" context="_1047" access="public" location="f7:5041" file="f7" line="5041" offset="64"/>
  <Field id="_4589" name="handleTypes" type="_908" context="_1047" access="public" location="f7:5042" file="f7" line="5042" offset="128"/>
  <ElaboratedType id="_4590" type="_1047"/>
  <Field id="_4591" name="sType" type="_162" context="_1049" access="public" location="f7:5046" file="f7" line="5046" offset="0"/>
  <Field id="_4592" name="pNext" type="_4239" context="_1049" access="public" location="f7:5047" file="f7" line="5047" offset="64"/>
  <Field id="_4593" name="handleTypes" type="_920" context="_1049" access="public" location="f7:5048" file="f7" line="5048" offset="128"/>
  <ElaboratedType id="_4594" type="_1049"/>
  <Field id="_4595" name="sType" type="_162" context="_1051" access="public" location="f7:5052" file="f7" line="5052" offset="0"/>
  <Field id="_4596" name="pNext" type="_4239" context="_1051" access="public" location="f7:5053" file="f7" line="5053" offset="64"/>
  <Field id="_4597" name="handleType" type="_919" context="_1051" access="public" location="f7:5054" file="f7" line="5054" offset="128"/>
  <ElaboratedType id="_4598" type="_1051"/>
  <Field id="_4599" name="sType" type="_162" context="_1053" access="public" location="f7:5058" file="f7" line="5058" offset="0"/>
  <Field id="_4600" name="pNext" type="_3035" context="_1053" access="public" location="f7:5059" file="f7" line="5059" offset="64"/>
  <Field id="_4601" name="exportFromImportedHandleTypes" type="_920" context="_1053" access="public" location="f7:5060" file="f7" line="5060" offset="128"/>
  <Field id="_4602" name="compatibleHandleTypes" type="_920" context="_1053" access="public" location="f7:5061" file="f7" line="5061" offset="160"/>
  <Field id="_4603" name="externalSemaphoreFeatures" type="_923" context="_1053" access="public" location="f7:5062" file="f7" line="5062" offset="192"/>
  <ElaboratedType id="_4604" type="_1053"/>
  <Field id="_4605" name="sType" type="_162" context="_1055" access="public" location="f7:5066" file="f7" line="5066" offset="0"/>
  <Field id="_4606" name="pNext" type="_3035" context="_1055" access="public" location="f7:5067" file="f7" line="5067" offset="64"/>
  <Field id="_4607" name="maxPerSetDescriptors" type="_82" context="_1055" access="public" location="f7:5068" file="f7" line="5068" offset="128"/>
  <Field id="_4608" name="maxMemoryAllocationSize" type="_106" context="_1055" access="public" location="f7:5069" file="f7" line="5069" offset="192"/>
  <ElaboratedType id="_4609" type="_1055"/>
  <Field id="_4610" name="sType" type="_162" context="_1057" access="public" location="f7:5073" file="f7" line="5073" offset="0"/>
  <Field id="_4611" name="pNext" type="_3035" context="_1057" access="public" location="f7:5074" file="f7" line="5074" offset="64"/>
  <Field id="_4612" name="supported" type="_104" context="_1057" access="public" location="f7:5075" file="f7" line="5075" offset="128"/>
  <ElaboratedType id="_4613" type="_1057"/>
  <Field id="_4614" name="sType" type="_162" context="_1059" access="public" location="f7:5079" file="f7" line="5079" offset="0"/>
  <Field id="_4615" name="pNext" type="_3035" context="_1059" access="public" location="f7:5080" file="f7" line="5080" offset="64"/>
  <Field id="_4616" name="shaderDrawParameters" type="_104" context="_1059" access="public" location="f7:5081" file="f7" line="5081" offset="128"/>
  <ElaboratedType id="_4617" type="_1059"/>
  <PointerType id="_4618" type="_7984" size="64" align="64"/>
  <PointerType id="_4619" type="_7985" size="64" align="64"/>
  <PointerType id="_4620" type="_7986" size="64" align="64"/>
  <PointerType id="_4621" type="_7987" size="64" align="64"/>
  <PointerType id="_4622" type="_7988" size="64" align="64"/>
  <PointerType id="_4623" type="_7989" size="64" align="64"/>
  <PointerType id="_4624" type="_7990" size="64" align="64"/>
  <PointerType id="_4625" type="_7991" size="64" align="64"/>
  <PointerType id="_4626" type="_7992" size="64" align="64"/>
  <PointerType id="_4627" type="_7993" size="64" align="64"/>
  <PointerType id="_4628" type="_7994" size="64" align="64"/>
  <PointerType id="_4629" type="_7995" size="64" align="64"/>
  <PointerType id="_4630" type="_7996" size="64" align="64"/>
  <PointerType id="_4631" type="_7997" size="64" align="64"/>
  <PointerType id="_4632" type="_7998" size="64" align="64"/>
  <PointerType id="_4633" type="_7999" size="64" align="64"/>
  <PointerType id="_4634" type="_8000" size="64" align="64"/>
  <PointerType id="_4635" type="_8001" size="64" align="64"/>
  <PointerType id="_4636" type="_8002" size="64" align="64"/>
  <PointerType id="_4637" type="_8003" size="64" align="64"/>
  <PointerType id="_4638" type="_8004" size="64" align="64"/>
  <PointerType id="_4639" type="_8005" size="64" align="64"/>
  <PointerType id="_4640" type="_8006" size="64" align="64"/>
  <PointerType id="_4641" type="_8007" size="64" align="64"/>
  <PointerType id="_4642" type="_8008" size="64" align="64"/>
  <PointerType id="_4643" type="_8009" size="64" align="64"/>
  <PointerType id="_4644" type="_8010" size="64" align="64"/>
  <PointerType id="_4645" type="_8011" size="64" align="64"/>
  <PointerType id="_4646" type="_927c" size="64" align="64"/>
  <CvQualifiedType id="_927c" type="_927" const="1"/>
  <PointerType id="_4647" type="_929c" size="64" align="64"/>
  <CvQualifiedType id="_929c" type="_929" const="1"/>
  <PointerType id="_4648" type="_894" size="64" align="64"/>
  <PointerType id="_4649" type="_951" size="64" align="64"/>
  <PointerType id="_4650" type="_957c" size="64" align="64"/>
  <CvQualifiedType id="_957c" type="_957" const="1"/>
  <PointerType id="_4651" type="_961" size="64" align="64"/>
  <PointerType id="_4652" type="_955c" size="64" align="64"/>
  <CvQualifiedType id="_955c" type="_955" const="1"/>
  <PointerType id="_4653" type="_959c" size="64" align="64"/>
  <CvQualifiedType id="_959c" type="_959" const="1"/>
  <PointerType id="_4654" type="_963" size="64" align="64"/>
  <PointerType id="_4655" type="_965" size="64" align="64"/>
  <PointerType id="_4656" type="_967" size="64" align="64"/>
  <PointerType id="_4657" type="_969" size="64" align="64"/>
  <PointerType id="_4658" type="_973c" size="64" align="64"/>
  <CvQualifiedType id="_973c" type="_973" const="1"/>
  <PointerType id="_4659" type="_971" size="64" align="64"/>
  <PointerType id="_4660" type="_975" size="64" align="64"/>
  <PointerType id="_4661" type="_977" size="64" align="64"/>
  <PointerType id="_4662" type="_981c" size="64" align="64"/>
  <CvQualifiedType id="_981c" type="_981" const="1"/>
  <PointerType id="_4663" type="_979" size="64" align="64"/>
  <PointerType id="_4664" type="_1006c" size="64" align="64"/>
  <CvQualifiedType id="_1006c" type="_1006" const="1"/>
  <PointerType id="_4665" type="_1010c" size="64" align="64"/>
  <CvQualifiedType id="_1010c" type="_1010" const="1"/>
  <PointerType id="_4666" type="_874" size="64" align="64"/>
  <PointerType id="_4667" type="_1024c" size="64" align="64"/>
  <CvQualifiedType id="_1024c" type="_1024" const="1"/>
  <PointerType id="_4668" type="_876" size="64" align="64"/>
  <PointerType id="_4669" type="_1032c" size="64" align="64"/>
  <CvQualifiedType id="_1032c" type="_1032" const="1"/>
  <PointerType id="_4670" type="_1034" size="64" align="64"/>
  <PointerType id="_4671" type="_1044c" size="64" align="64"/>
  <CvQualifiedType id="_1044c" type="_1044" const="1"/>
  <PointerType id="_4672" type="_1046" size="64" align="64"/>
  <PointerType id="_4673" type="_1052c" size="64" align="64"/>
  <CvQualifiedType id="_1052c" type="_1052" const="1"/>
  <PointerType id="_4674" type="_1054" size="64" align="64"/>
  <PointerType id="_4675" type="_1058" size="64" align="64"/>
  <ElaboratedType id="_4676" type="_1118"/>
  <ElaboratedType id="_4677" type="_1120"/>
  <ElaboratedType id="_4678" type="_1122"/>
  <ElaboratedType id="_4679" type="_1124"/>
  <ElaboratedType id="_4680" type="_1126"/>
  <ElaboratedType id="_4681" type="_1129"/>
  <ElaboratedType id="_4682" type="_1132"/>
  <Field id="_4683" name="sType" type="_162" context="_1135" access="public" location="f7:5366" file="f7" line="5366" offset="0"/>
  <Field id="_4684" name="pNext" type="_3035" context="_1135" access="public" location="f7:5367" file="f7" line="5367" offset="64"/>
  <Field id="_4685" name="storageBuffer16BitAccess" type="_104" context="_1135" access="public" location="f7:5368" file="f7" line="5368" offset="128"/>
  <Field id="_4686" name="uniformAndStorageBuffer16BitAccess" type="_104" context="_1135" access="public" location="f7:5369" file="f7" line="5369" offset="160"/>
  <Field id="_4687" name="storagePushConstant16" type="_104" context="_1135" access="public" location="f7:5370" file="f7" line="5370" offset="192"/>
  <Field id="_4688" name="storageInputOutput16" type="_104" context="_1135" access="public" location="f7:5371" file="f7" line="5371" offset="224"/>
  <Field id="_4689" name="multiview" type="_104" context="_1135" access="public" location="f7:5372" file="f7" line="5372" offset="256"/>
  <Field id="_4690" name="multiviewGeometryShader" type="_104" context="_1135" access="public" location="f7:5373" file="f7" line="5373" offset="288"/>
  <Field id="_4691" name="multiviewTessellationShader" type="_104" context="_1135" access="public" location="f7:5374" file="f7" line="5374" offset="320"/>
  <Field id="_4692" name="variablePointersStorageBuffer" type="_104" context="_1135" access="public" location="f7:5375" file="f7" line="5375" offset="352"/>
  <Field id="_4693" name="variablePointers" type="_104" context="_1135" access="public" location="f7:5376" file="f7" line="5376" offset="384"/>
  <Field id="_4694" name="protectedMemory" type="_104" context="_1135" access="public" location="f7:5377" file="f7" line="5377" offset="416"/>
  <Field id="_4695" name="samplerYcbcrConversion" type="_104" context="_1135" access="public" location="f7:5378" file="f7" line="5378" offset="448"/>
  <Field id="_4696" name="shaderDrawParameters" type="_104" context="_1135" access="public" location="f7:5379" file="f7" line="5379" offset="480"/>
  <ElaboratedType id="_4697" type="_1135"/>
  <Field id="_4698" name="sType" type="_162" context="_1137" access="public" location="f7:5383" file="f7" line="5383" offset="0"/>
  <Field id="_4699" name="pNext" type="_3035" context="_1137" access="public" location="f7:5384" file="f7" line="5384" offset="64"/>
  <Field id="_4700" name="deviceUUID" type="_7788" context="_1137" access="public" location="f7:5385" file="f7" line="5385" offset="128"/>
  <Field id="_4701" name="driverUUID" type="_7788" context="_1137" access="public" location="f7:5386" file="f7" line="5386" offset="256"/>
  <Field id="_4702" name="deviceLUID" type="_7983" context="_1137" access="public" location="f7:5387" file="f7" line="5387" offset="384"/>
  <Field id="_4703" name="deviceNodeMask" type="_82" context="_1137" access="public" location="f7:5388" file="f7" line="5388" offset="448"/>
  <Field id="_4704" name="deviceLUIDValid" type="_104" context="_1137" access="public" location="f7:5389" file="f7" line="5389" offset="480"/>
  <Field id="_4705" name="subgroupSize" type="_82" context="_1137" access="public" location="f7:5390" file="f7" line="5390" offset="512"/>
  <Field id="_4706" name="subgroupSupportedStages" type="_329" context="_1137" access="public" location="f7:5391" file="f7" line="5391" offset="544"/>
  <Field id="_4707" name="subgroupSupportedOperations" type="_891" context="_1137" access="public" location="f7:5392" file="f7" line="5392" offset="576"/>
  <Field id="_4708" name="subgroupQuadOperationsInAllStages" type="_104" context="_1137" access="public" location="f7:5393" file="f7" line="5393" offset="608"/>
  <Field id="_4709" name="pointClippingBehavior" type="_878" context="_1137" access="public" location="f7:5394" file="f7" line="5394" offset="640"/>
  <Field id="_4710" name="maxMultiviewViewCount" type="_82" context="_1137" access="public" location="f7:5395" file="f7" line="5395" offset="672"/>
  <Field id="_4711" name="maxMultiviewInstanceIndex" type="_82" context="_1137" access="public" location="f7:5396" file="f7" line="5396" offset="704"/>
  <Field id="_4712" name="protectedNoFault" type="_104" context="_1137" access="public" location="f7:5397" file="f7" line="5397" offset="736"/>
  <Field id="_4713" name="maxPerSetDescriptors" type="_82" context="_1137" access="public" location="f7:5398" file="f7" line="5398" offset="768"/>
  <Field id="_4714" name="maxMemoryAllocationSize" type="_106" context="_1137" access="public" location="f7:5399" file="f7" line="5399" offset="832"/>
  <ElaboratedType id="_4715" type="_1137"/>
  <Field id="_4716" name="sType" type="_162" context="_1139" access="public" location="f7:5403" file="f7" line="5403" offset="0"/>
  <Field id="_4717" name="pNext" type="_3035" context="_1139" access="public" location="f7:5404" file="f7" line="5404" offset="64"/>
  <Field id="_4718" name="samplerMirrorClampToEdge" type="_104" context="_1139" access="public" location="f7:5405" file="f7" line="5405" offset="128"/>
  <Field id="_4719" name="drawIndirectCount" type="_104" context="_1139" access="public" location="f7:5406" file="f7" line="5406" offset="160"/>
  <Field id="_4720" name="storageBuffer8BitAccess" type="_104" context="_1139" access="public" location="f7:5407" file="f7" line="5407" offset="192"/>
  <Field id="_4721" name="uniformAndStorageBuffer8BitAccess" type="_104" context="_1139" access="public" location="f7:5408" file="f7" line="5408" offset="224"/>
  <Field id="_4722" name="storagePushConstant8" type="_104" context="_1139" access="public" location="f7:5409" file="f7" line="5409" offset="256"/>
  <Field id="_4723" name="shaderBufferInt64Atomics" type="_104" context="_1139" access="public" location="f7:5410" file="f7" line="5410" offset="288"/>
  <Field id="_4724" name="shaderSharedInt64Atomics" type="_104" context="_1139" access="public" location="f7:5411" file="f7" line="5411" offset="320"/>
  <Field id="_4725" name="shaderFloat16" type="_104" context="_1139" access="public" location="f7:5412" file="f7" line="5412" offset="352"/>
  <Field id="_4726" name="shaderInt8" type="_104" context="_1139" access="public" location="f7:5413" file="f7" line="5413" offset="384"/>
  <Field id="_4727" name="descriptorIndexing" type="_104" context="_1139" access="public" location="f7:5414" file="f7" line="5414" offset="416"/>
  <Field id="_4728" name="shaderInputAttachmentArrayDynamicIndexing" type="_104" context="_1139" access="public" location="f7:5415" file="f7" line="5415" offset="448"/>
  <Field id="_4729" name="shaderUniformTexelBufferArrayDynamicIndexing" type="_104" context="_1139" access="public" location="f7:5416" file="f7" line="5416" offset="480"/>
  <Field id="_4730" name="shaderStorageTexelBufferArrayDynamicIndexing" type="_104" context="_1139" access="public" location="f7:5417" file="f7" line="5417" offset="512"/>
  <Field id="_4731" name="shaderUniformBufferArrayNonUniformIndexing" type="_104" context="_1139" access="public" location="f7:5418" file="f7" line="5418" offset="544"/>
  <Field id="_4732" name="shaderSampledImageArrayNonUniformIndexing" type="_104" context="_1139" access="public" location="f7:5419" file="f7" line="5419" offset="576"/>
  <Field id="_4733" name="shaderStorageBufferArrayNonUniformIndexing" type="_104" context="_1139" access="public" location="f7:5420" file="f7" line="5420" offset="608"/>
  <Field id="_4734" name="shaderStorageImageArrayNonUniformIndexing" type="_104" context="_1139" access="public" location="f7:5421" file="f7" line="5421" offset="640"/>
  <Field id="_4735" name="shaderInputAttachmentArrayNonUniformIndexing" type="_104" context="_1139" access="public" location="f7:5422" file="f7" line="5422" offset="672"/>
  <Field id="_4736" name="shaderUniformTexelBufferArrayNonUniformIndexing" type="_104" context="_1139" access="public" location="f7:5423" file="f7" line="5423" offset="704"/>
  <Field id="_4737" name="shaderStorageTexelBufferArrayNonUniformIndexing" type="_104" context="_1139" access="public" location="f7:5424" file="f7" line="5424" offset="736"/>
  <Field id="_4738" name="descriptorBindingUniformBufferUpdateAfterBind" type="_104" context="_1139" access="public" location="f7:5425" file="f7" line="5425" offset="768"/>
  <Field id="_4739" name="descriptorBindingSampledImageUpdateAfterBind" type="_104" context="_1139" access="public" location="f7:5426" file="f7" line="5426" offset="800"/>
  <Field id="_4740" name="descriptorBindingStorageImageUpdateAfterBind" type="_104" context="_1139" access="public" location="f7:5427" file="f7" line="5427" offset="832"/>
  <Field id="_4741" name="descriptorBindingStorageBufferUpdateAfterBind" type="_104" context="_1139" access="public" location="f7:5428" file="f7" line="5428" offset="864"/>
  <Field id="_4742" name="descriptorBindingUniformTexelBufferUpdateAfterBind" type="_104" context="_1139" access="public" location="f7:5429" file="f7" line="5429" offset="896"/>
  <Field id="_4743" name="descriptorBindingStorageTexelBufferUpdateAfterBind" type="_104" context="_1139" access="public" location="f7:5430" file="f7" line="5430" offset="928"/>
  <Field id="_4744" name="descriptorBindingUpdateUnusedWhilePending" type="_104" context="_1139" access="public" location="f7:5431" file="f7" line="5431" offset="960"/>
  <Field id="_4745" name="descriptorBindingPartiallyBound" type="_104" context="_1139" access="public" location="f7:5432" file="f7" line="5432" offset="992"/>
  <Field id="_4746" name="descriptorBindingVariableDescriptorCount" type="_104" context="_1139" access="public" location="f7:5433" file="f7" line="5433" offset="1024"/>
  <Field id="_4747" name="runtimeDescriptorArray" type="_104" context="_1139" access="public" location="f7:5434" file="f7" line="5434" offset="1056"/>
  <Field id="_4748" name="samplerFilterMinmax" type="_104" context="_1139" access="public" location="f7:5435" file="f7" line="5435" offset="1088"/>
  <Field id="_4749" name="scalarBlockLayout" type="_104" context="_1139" access="public" location="f7:5436" file="f7" line="5436" offset="1120"/>
  <Field id="_4750" name="imagelessFramebuffer" type="_104" context="_1139" access="public" location="f7:5437" file="f7" line="5437" offset="1152"/>
  <Field id="_4751" name="uniformBufferStandardLayout" type="_104" context="_1139" access="public" location="f7:5438" file="f7" line="5438" offset="1184"/>
  <Field id="_4752" name="shaderSubgroupExtendedTypes" type="_104" context="_1139" access="public" location="f7:5439" file="f7" line="5439" offset="1216"/>
  <Field id="_4753" name="separateDepthStencilLayouts" type="_104" context="_1139" access="public" location="f7:5440" file="f7" line="5440" offset="1248"/>
  <Field id="_4754" name="hostQueryReset" type="_104" context="_1139" access="public" location="f7:5441" file="f7" line="5441" offset="1280"/>
  <Field id="_4755" name="timelineSemaphore" type="_104" context="_1139" access="public" location="f7:5442" file="f7" line="5442" offset="1312"/>
  <Field id="_4756" name="bufferDeviceAddress" type="_104" context="_1139" access="public" location="f7:5443" file="f7" line="5443" offset="1344"/>
  <Field id="_4757" name="bufferDeviceAddressCaptureReplay" type="_104" context="_1139" access="public" location="f7:5444" file="f7" line="5444" offset="1376"/>
  <Field id="_4758" name="bufferDeviceAddressMultiDevice" type="_104" context="_1139" access="public" location="f7:5445" file="f7" line="5445" offset="1408"/>
  <Field id="_4759" name="vulkanMemoryModel" type="_104" context="_1139" access="public" location="f7:5446" file="f7" line="5446" offset="1440"/>
  <Field id="_4760" name="vulkanMemoryModelDeviceScope" type="_104" context="_1139" access="public" location="f7:5447" file="f7" line="5447" offset="1472"/>
  <Field id="_4761" name="vulkanMemoryModelAvailabilityVisibilityChains" type="_104" context="_1139" access="public" location="f7:5448" file="f7" line="5448" offset="1504"/>
  <Field id="_4762" name="shaderOutputViewportIndex" type="_104" context="_1139" access="public" location="f7:5449" file="f7" line="5449" offset="1536"/>
  <Field id="_4763" name="shaderOutputLayer" type="_104" context="_1139" access="public" location="f7:5450" file="f7" line="5450" offset="1568"/>
  <Field id="_4764" name="subgroupBroadcastDynamicId" type="_104" context="_1139" access="public" location="f7:5451" file="f7" line="5451" offset="1600"/>
  <ElaboratedType id="_4765" type="_1139"/>
  <Field id="_4766" name="major" type="_80" context="_1141" access="public" location="f7:5455" file="f7" line="5455" offset="0"/>
  <Field id="_4767" name="minor" type="_80" context="_1141" access="public" location="f7:5456" file="f7" line="5456" offset="8"/>
  <Field id="_4768" name="subminor" type="_80" context="_1141" access="public" location="f7:5457" file="f7" line="5457" offset="16"/>
  <Field id="_4769" name="patch" type="_80" context="_1141" access="public" location="f7:5458" file="f7" line="5458" offset="24"/>
  <ElaboratedType id="_4770" type="_1141"/>
  <Field id="_4771" name="sType" type="_162" context="_1143" access="public" location="f7:5462" file="f7" line="5462" offset="0"/>
  <Field id="_4772" name="pNext" type="_3035" context="_1143" access="public" location="f7:5463" file="f7" line="5463" offset="64"/>
  <Field id="_4773" name="driverID" type="_1119" context="_1143" access="public" location="f7:5464" file="f7" line="5464" offset="128"/>
  <Field id="_4774" name="driverName" type="_7801" context="_1143" access="public" location="f7:5465" file="f7" line="5465" offset="160"/>
  <Field id="_4775" name="driverInfo" type="_7801" context="_1143" access="public" location="f7:5466" file="f7" line="5466" offset="2208"/>
  <Field id="_4776" name="conformanceVersion" type="_1142" context="_1143" access="public" location="f7:5467" file="f7" line="5467" offset="4256"/>
  <Field id="_4777" name="denormBehaviorIndependence" type="_1121" context="_1143" access="public" location="f7:5468" file="f7" line="5468" offset="4288"/>
  <Field id="_4778" name="roundingModeIndependence" type="_1121" context="_1143" access="public" location="f7:5469" file="f7" line="5469" offset="4320"/>
  <Field id="_4779" name="shaderSignedZeroInfNanPreserveFloat16" type="_104" context="_1143" access="public" location="f7:5470" file="f7" line="5470" offset="4352"/>
  <Field id="_4780" name="shaderSignedZeroInfNanPreserveFloat32" type="_104" context="_1143" access="public" location="f7:5471" file="f7" line="5471" offset="4384"/>
  <Field id="_4781" name="shaderSignedZeroInfNanPreserveFloat64" type="_104" context="_1143" access="public" location="f7:5472" file="f7" line="5472" offset="4416"/>
  <Field id="_4782" name="shaderDenormPreserveFloat16" type="_104" context="_1143" access="public" location="f7:5473" file="f7" line="5473" offset="4448"/>
  <Field id="_4783" name="shaderDenormPreserveFloat32" type="_104" context="_1143" access="public" location="f7:5474" file="f7" line="5474" offset="4480"/>
  <Field id="_4784" name="shaderDenormPreserveFloat64" type="_104" context="_1143" access="public" location="f7:5475" file="f7" line="5475" offset="4512"/>
  <Field id="_4785" name="shaderDenormFlushToZeroFloat16" type="_104" context="_1143" access="public" location="f7:5476" file="f7" line="5476" offset="4544"/>
  <Field id="_4786" name="shaderDenormFlushToZeroFloat32" type="_104" context="_1143" access="public" location="f7:5477" file="f7" line="5477" offset="4576"/>
  <Field id="_4787" name="shaderDenormFlushToZeroFloat64" type="_104" context="_1143" access="public" location="f7:5478" file="f7" line="5478" offset="4608"/>
  <Field id="_4788" name="shaderRoundingModeRTEFloat16" type="_104" context="_1143" access="public" location="f7:5479" file="f7" line="5479" offset="4640"/>
  <Field id="_4789" name="shaderRoundingModeRTEFloat32" type="_104" context="_1143" access="public" location="f7:5480" file="f7" line="5480" offset="4672"/>
  <Field id="_4790" name="shaderRoundingModeRTEFloat64" type="_104" context="_1143" access="public" location="f7:5481" file="f7" line="5481" offset="4704"/>
  <Field id="_4791" name="shaderRoundingModeRTZFloat16" type="_104" context="_1143" access="public" location="f7:5482" file="f7" line="5482" offset="4736"/>
  <Field id="_4792" name="shaderRoundingModeRTZFloat32" type="_104" context="_1143" access="public" location="f7:5483" file="f7" line="5483" offset="4768"/>
  <Field id="_4793" name="shaderRoundingModeRTZFloat64" type="_104" context="_1143" access="public" location="f7:5484" file="f7" line="5484" offset="4800"/>
  <Field id="_4794" name="maxUpdateAfterBindDescriptorsInAllPools" type="_82" context="_1143" access="public" location="f7:5485" file="f7" line="5485" offset="4832"/>
  <Field id="_4795" name="shaderUniformBufferArrayNonUniformIndexingNative" type="_104" context="_1143" access="public" location="f7:5486" file="f7" line="5486" offset="4864"/>
  <Field id="_4796" name="shaderSampledImageArrayNonUniformIndexingNative" type="_104" context="_1143" access="public" location="f7:5487" file="f7" line="5487" offset="4896"/>
  <Field id="_4797" name="shaderStorageBufferArrayNonUniformIndexingNative" type="_104" context="_1143" access="public" location="f7:5488" file="f7" line="5488" offset="4928"/>
  <Field id="_4798" name="shaderStorageImageArrayNonUniformIndexingNative" type="_104" context="_1143" access="public" location="f7:5489" file="f7" line="5489" offset="4960"/>
  <Field id="_4799" name="shaderInputAttachmentArrayNonUniformIndexingNative" type="_104" context="_1143" access="public" location="f7:5490" file="f7" line="5490" offset="4992"/>
  <Field id="_4800" name="robustBufferAccessUpdateAfterBind" type="_104" context="_1143" access="public" location="f7:5491" file="f7" line="5491" offset="5024"/>
  <Field id="_4801" name="quadDivergentImplicitLod" type="_104" context="_1143" access="public" location="f7:5492" file="f7" line="5492" offset="5056"/>
  <Field id="_4802" name="maxPerStageDescriptorUpdateAfterBindSamplers" type="_82" context="_1143" access="public" location="f7:5493" file="f7" line="5493" offset="5088"/>
  <Field id="_4803" name="maxPerStageDescriptorUpdateAfterBindUniformBuffers" type="_82" context="_1143" access="public" location="f7:5494" file="f7" line="5494" offset="5120"/>
  <Field id="_4804" name="maxPerStageDescriptorUpdateAfterBindStorageBuffers" type="_82" context="_1143" access="public" location="f7:5495" file="f7" line="5495" offset="5152"/>
  <Field id="_4805" name="maxPerStageDescriptorUpdateAfterBindSampledImages" type="_82" context="_1143" access="public" location="f7:5496" file="f7" line="5496" offset="5184"/>
  <Field id="_4806" name="maxPerStageDescriptorUpdateAfterBindStorageImages" type="_82" context="_1143" access="public" location="f7:5497" file="f7" line="5497" offset="5216"/>
  <Field id="_4807" name="maxPerStageDescriptorUpdateAfterBindInputAttachments" type="_82" context="_1143" access="public" location="f7:5498" file="f7" line="5498" offset="5248"/>
  <Field id="_4808" name="maxPerStageUpdateAfterBindResources" type="_82" context="_1143" access="public" location="f7:5499" file="f7" line="5499" offset="5280"/>
  <Field id="_4809" name="maxDescriptorSetUpdateAfterBindSamplers" type="_82" context="_1143" access="public" location="f7:5500" file="f7" line="5500" offset="5312"/>
  <Field id="_4810" name="maxDescriptorSetUpdateAfterBindUniformBuffers" type="_82" context="_1143" access="public" location="f7:5501" file="f7" line="5501" offset="5344"/>
  <Field id="_4811" name="maxDescriptorSetUpdateAfterBindUniformBuffersDynamic" type="_82" context="_1143" access="public" location="f7:5502" file="f7" line="5502" offset="5376"/>
  <Field id="_4812" name="maxDescriptorSetUpdateAfterBindStorageBuffers" type="_82" context="_1143" access="public" location="f7:5503" file="f7" line="5503" offset="5408"/>
  <Field id="_4813" name="maxDescriptorSetUpdateAfterBindStorageBuffersDynamic" type="_82" context="_1143" access="public" location="f7:5504" file="f7" line="5504" offset="5440"/>
  <Field id="_4814" name="maxDescriptorSetUpdateAfterBindSampledImages" type="_82" context="_1143" access="public" location="f7:5505" file="f7" line="5505" offset="5472"/>
  <Field id="_4815" name="maxDescriptorSetUpdateAfterBindStorageImages" type="_82" context="_1143" access="public" location="f7:5506" file="f7" line="5506" offset="5504"/>
  <Field id="_4816" name="maxDescriptorSetUpdateAfterBindInputAttachments" type="_82" context="_1143" access="public" location="f7:5507" file="f7" line="5507" offset="5536"/>
  <Field id="_4817" name="supportedDepthResolveModes" type="_1128" context="_1143" access="public" location="f7:5508" file="f7" line="5508" offset="5568"/>
  <Field id="_4818" name="supportedStencilResolveModes" type="_1128" context="_1143" access="public" location="f7:5509" file="f7" line="5509" offset="5600"/>
  <Field id="_4819" name="independentResolveNone" type="_104" context="_1143" access="public" location="f7:5510" file="f7" line="5510" offset="5632"/>
  <Field id="_4820" name="independentResolve" type="_104" context="_1143" access="public" location="f7:5511" file="f7" line="5511" offset="5664"/>
  <Field id="_4821" name="filterMinmaxSingleComponentFormats" type="_104" context="_1143" access="public" location="f7:5512" file="f7" line="5512" offset="5696"/>
  <Field id="_4822" name="filterMinmaxImageComponentMapping" type="_104" context="_1143" access="public" location="f7:5513" file="f7" line="5513" offset="5728"/>
  <Field id="_4823" name="maxTimelineSemaphoreValueDifference" type="_83" context="_1143" access="public" location="f7:5514" file="f7" line="5514" offset="5760"/>
  <Field id="_4824" name="framebufferIntegerColorSampleCounts" type="_247" context="_1143" access="public" location="f7:5515" file="f7" line="5515" offset="5824"/>
  <ElaboratedType id="_4825" type="_1143"/>
  <Field id="_4826" name="sType" type="_162" context="_1145" access="public" location="f7:5519" file="f7" line="5519" offset="0"/>
  <Field id="_4827" name="pNext" type="_4239" context="_1145" access="public" location="f7:5520" file="f7" line="5520" offset="64"/>
  <Field id="_4828" name="viewFormatCount" type="_82" context="_1145" access="public" location="f7:5521" file="f7" line="5521" offset="128"/>
  <Field id="_4829" name="pViewFormats" type="_8012" context="_1145" access="public" location="f7:5522" file="f7" line="5522" offset="192"/>
  <ElaboratedType id="_4830" type="_1145"/>
  <Field id="_4831" name="sType" type="_162" context="_1147" access="public" location="f7:5526" file="f7" line="5526" offset="0"/>
  <Field id="_4832" name="pNext" type="_4239" context="_1147" access="public" location="f7:5527" file="f7" line="5527" offset="64"/>
  <Field id="_4833" name="flags" type="_342" context="_1147" access="public" location="f7:5528" file="f7" line="5528" offset="128"/>
  <Field id="_4834" name="format" type="_176" context="_1147" access="public" location="f7:5529" file="f7" line="5529" offset="160"/>
  <Field id="_4835" name="samples" type="_246" context="_1147" access="public" location="f7:5530" file="f7" line="5530" offset="192"/>
  <Field id="_4836" name="loadOp" type="_222" context="_1147" access="public" location="f7:5531" file="f7" line="5531" offset="224"/>
  <Field id="_4837" name="storeOp" type="_224" context="_1147" access="public" location="f7:5532" file="f7" line="5532" offset="256"/>
  <Field id="_4838" name="stencilLoadOp" type="_222" context="_1147" access="public" location="f7:5533" file="f7" line="5533" offset="288"/>
  <Field id="_4839" name="stencilStoreOp" type="_224" context="_1147" access="public" location="f7:5534" file="f7" line="5534" offset="320"/>
  <Field id="_4840" name="initialLayout" type="_164" context="_1147" access="public" location="f7:5535" file="f7" line="5535" offset="352"/>
  <Field id="_4841" name="finalLayout" type="_164" context="_1147" access="public" location="f7:5536" file="f7" line="5536" offset="384"/>
  <ElaboratedType id="_4842" type="_1147"/>
  <Field id="_4843" name="sType" type="_162" context="_1149" access="public" location="f7:5540" file="f7" line="5540" offset="0"/>
  <Field id="_4844" name="pNext" type="_4239" context="_1149" access="public" location="f7:5541" file="f7" line="5541" offset="64"/>
  <Field id="_4845" name="attachment" type="_82" context="_1149" access="public" location="f7:5542" file="f7" line="5542" offset="128"/>
  <Field id="_4846" name="layout" type="_164" context="_1149" access="public" location="f7:5543" file="f7" line="5543" offset="160"/>
  <Field id="_4847" name="aspectMask" type="_238" context="_1149" access="public" location="f7:5544" file="f7" line="5544" offset="192"/>
  <ElaboratedType id="_4848" type="_1149"/>
  <Field id="_4849" name="sType" type="_162" context="_1151" access="public" location="f7:5548" file="f7" line="5548" offset="0"/>
  <Field id="_4850" name="pNext" type="_4239" context="_1151" access="public" location="f7:5549" file="f7" line="5549" offset="64"/>
  <Field id="_4851" name="flags" type="_354" context="_1151" access="public" location="f7:5550" file="f7" line="5550" offset="128"/>
  <Field id="_4852" name="pipelineBindPoint" type="_226" context="_1151" access="public" location="f7:5551" file="f7" line="5551" offset="160"/>
  <Field id="_4853" name="viewMask" type="_82" context="_1151" access="public" location="f7:5552" file="f7" line="5552" offset="192"/>
  <Field id="_4854" name="inputAttachmentCount" type="_82" context="_1151" access="public" location="f7:5553" file="f7" line="5553" offset="224"/>
  <Field id="_4855" name="pInputAttachments" type="_8013" context="_1151" access="public" location="f7:5554" file="f7" line="5554" offset="256"/>
  <Field id="_4856" name="colorAttachmentCount" type="_82" context="_1151" access="public" location="f7:5555" file="f7" line="5555" offset="320"/>
  <Field id="_4857" name="pColorAttachments" type="_8013" context="_1151" access="public" location="f7:5556" file="f7" line="5556" offset="384"/>
  <Field id="_4858" name="pResolveAttachments" type="_8013" context="_1151" access="public" location="f7:5557" file="f7" line="5557" offset="448"/>
  <Field id="_4859" name="pDepthStencilAttachment" type="_8013" context="_1151" access="public" location="f7:5558" file="f7" line="5558" offset="512"/>
  <Field id="_4860" name="preserveAttachmentCount" type="_82" context="_1151" access="public" location="f7:5559" file="f7" line="5559" offset="576"/>
  <Field id="_4861" name="pPreserveAttachments" type="_4232" context="_1151" access="public" location="f7:5560" file="f7" line="5560" offset="640"/>
  <ElaboratedType id="_4862" type="_1151"/>
  <Field id="_4863" name="sType" type="_162" context="_1153" access="public" location="f7:5564" file="f7" line="5564" offset="0"/>
  <Field id="_4864" name="pNext" type="_4239" context="_1153" access="public" location="f7:5565" file="f7" line="5565" offset="64"/>
  <Field id="_4865" name="srcSubpass" type="_82" context="_1153" access="public" location="f7:5566" file="f7" line="5566" offset="128"/>
  <Field id="_4866" name="dstSubpass" type="_82" context="_1153" access="public" location="f7:5567" file="f7" line="5567" offset="160"/>
  <Field id="_4867" name="srcStageMask" type="_267" context="_1153" access="public" location="f7:5568" file="f7" line="5568" offset="192"/>
  <Field id="_4868" name="dstStageMask" type="_267" context="_1153" access="public" location="f7:5569" file="f7" line="5569" offset="224"/>
  <Field id="_4869" name="srcAccessMask" type="_235" context="_1153" access="public" location="f7:5570" file="f7" line="5570" offset="256"/>
  <Field id="_4870" name="dstAccessMask" type="_235" context="_1153" access="public" location="f7:5571" file="f7" line="5571" offset="288"/>
  <Field id="_4871" name="dependencyFlags" type="_345" context="_1153" access="public" location="f7:5572" file="f7" line="5572" offset="320"/>
  <Field id="_4872" name="viewOffset" type="_78" context="_1153" access="public" location="f7:5573" file="f7" line="5573" offset="352"/>
  <ElaboratedType id="_4873" type="_1153"/>
  <Field id="_4874" name="sType" type="_162" context="_1155" access="public" location="f7:5577" file="f7" line="5577" offset="0"/>
  <Field id="_4875" name="pNext" type="_4239" context="_1155" access="public" location="f7:5578" file="f7" line="5578" offset="64"/>
  <Field id="_4876" name="flags" type="_351" context="_1155" access="public" location="f7:5579" file="f7" line="5579" offset="128"/>
  <Field id="_4877" name="attachmentCount" type="_82" context="_1155" access="public" location="f7:5580" file="f7" line="5580" offset="160"/>
  <Field id="_4878" name="pAttachments" type="_8014" context="_1155" access="public" location="f7:5581" file="f7" line="5581" offset="192"/>
  <Field id="_4879" name="subpassCount" type="_82" context="_1155" access="public" location="f7:5582" file="f7" line="5582" offset="256"/>
  <Field id="_4880" name="pSubpasses" type="_8015" context="_1155" access="public" location="f7:5583" file="f7" line="5583" offset="320"/>
  <Field id="_4881" name="dependencyCount" type="_82" context="_1155" access="public" location="f7:5584" file="f7" line="5584" offset="384"/>
  <Field id="_4882" name="pDependencies" type="_8016" context="_1155" access="public" location="f7:5585" file="f7" line="5585" offset="448"/>
  <Field id="_4883" name="correlatedViewMaskCount" type="_82" context="_1155" access="public" location="f7:5586" file="f7" line="5586" offset="512"/>
  <Field id="_4884" name="pCorrelatedViewMasks" type="_4232" context="_1155" access="public" location="f7:5587" file="f7" line="5587" offset="576"/>
  <ElaboratedType id="_4885" type="_1155"/>
  <Field id="_4886" name="sType" type="_162" context="_1157" access="public" location="f7:5591" file="f7" line="5591" offset="0"/>
  <Field id="_4887" name="pNext" type="_4239" context="_1157" access="public" location="f7:5592" file="f7" line="5592" offset="64"/>
  <Field id="_4888" name="contents" type="_232" context="_1157" access="public" location="f7:5593" file="f7" line="5593" offset="128"/>
  <ElaboratedType id="_4889" type="_1157"/>
  <Field id="_4890" name="sType" type="_162" context="_1159" access="public" location="f7:5597" file="f7" line="5597" offset="0"/>
  <Field id="_4891" name="pNext" type="_4239" context="_1159" access="public" location="f7:5598" file="f7" line="5598" offset="64"/>
  <ElaboratedType id="_4892" type="_1159"/>
  <Field id="_4893" name="sType" type="_162" context="_1161" access="public" location="f7:5602" file="f7" line="5602" offset="0"/>
  <Field id="_4894" name="pNext" type="_3035" context="_1161" access="public" location="f7:5603" file="f7" line="5603" offset="64"/>
  <Field id="_4895" name="storageBuffer8BitAccess" type="_104" context="_1161" access="public" location="f7:5604" file="f7" line="5604" offset="128"/>
  <Field id="_4896" name="uniformAndStorageBuffer8BitAccess" type="_104" context="_1161" access="public" location="f7:5605" file="f7" line="5605" offset="160"/>
  <Field id="_4897" name="storagePushConstant8" type="_104" context="_1161" access="public" location="f7:5606" file="f7" line="5606" offset="192"/>
  <ElaboratedType id="_4898" type="_1161"/>
  <Field id="_4899" name="sType" type="_162" context="_1163" access="public" location="f7:5610" file="f7" line="5610" offset="0"/>
  <Field id="_4900" name="pNext" type="_3035" context="_1163" access="public" location="f7:5611" file="f7" line="5611" offset="64"/>
  <Field id="_4901" name="driverID" type="_1119" context="_1163" access="public" location="f7:5612" file="f7" line="5612" offset="128"/>
  <Field id="_4902" name="driverName" type="_7801" context="_1163" access="public" location="f7:5613" file="f7" line="5613" offset="160"/>
  <Field id="_4903" name="driverInfo" type="_7801" context="_1163" access="public" location="f7:5614" file="f7" line="5614" offset="2208"/>
  <Field id="_4904" name="conformanceVersion" type="_1142" context="_1163" access="public" location="f7:5615" file="f7" line="5615" offset="4256"/>
  <ElaboratedType id="_4905" type="_1163"/>
  <Field id="_4906" name="sType" type="_162" context="_1165" access="public" location="f7:5619" file="f7" line="5619" offset="0"/>
  <Field id="_4907" name="pNext" type="_3035" context="_1165" access="public" location="f7:5620" file="f7" line="5620" offset="64"/>
  <Field id="_4908" name="shaderBufferInt64Atomics" type="_104" context="_1165" access="public" location="f7:5621" file="f7" line="5621" offset="128"/>
  <Field id="_4909" name="shaderSharedInt64Atomics" type="_104" context="_1165" access="public" location="f7:5622" file="f7" line="5622" offset="160"/>
  <ElaboratedType id="_4910" type="_1165"/>
  <Field id="_4911" name="sType" type="_162" context="_1167" access="public" location="f7:5626" file="f7" line="5626" offset="0"/>
  <Field id="_4912" name="pNext" type="_3035" context="_1167" access="public" location="f7:5627" file="f7" line="5627" offset="64"/>
  <Field id="_4913" name="shaderFloat16" type="_104" context="_1167" access="public" location="f7:5628" file="f7" line="5628" offset="128"/>
  <Field id="_4914" name="shaderInt8" type="_104" context="_1167" access="public" location="f7:5629" file="f7" line="5629" offset="160"/>
  <ElaboratedType id="_4915" type="_1167"/>
  <Field id="_4916" name="sType" type="_162" context="_1169" access="public" location="f7:5633" file="f7" line="5633" offset="0"/>
  <Field id="_4917" name="pNext" type="_3035" context="_1169" access="public" location="f7:5634" file="f7" line="5634" offset="64"/>
  <Field id="_4918" name="denormBehaviorIndependence" type="_1121" context="_1169" access="public" location="f7:5635" file="f7" line="5635" offset="128"/>
  <Field id="_4919" name="roundingModeIndependence" type="_1121" context="_1169" access="public" location="f7:5636" file="f7" line="5636" offset="160"/>
  <Field id="_4920" name="shaderSignedZeroInfNanPreserveFloat16" type="_104" context="_1169" access="public" location="f7:5637" file="f7" line="5637" offset="192"/>
  <Field id="_4921" name="shaderSignedZeroInfNanPreserveFloat32" type="_104" context="_1169" access="public" location="f7:5638" file="f7" line="5638" offset="224"/>
  <Field id="_4922" name="shaderSignedZeroInfNanPreserveFloat64" type="_104" context="_1169" access="public" location="f7:5639" file="f7" line="5639" offset="256"/>
  <Field id="_4923" name="shaderDenormPreserveFloat16" type="_104" context="_1169" access="public" location="f7:5640" file="f7" line="5640" offset="288"/>
  <Field id="_4924" name="shaderDenormPreserveFloat32" type="_104" context="_1169" access="public" location="f7:5641" file="f7" line="5641" offset="320"/>
  <Field id="_4925" name="shaderDenormPreserveFloat64" type="_104" context="_1169" access="public" location="f7:5642" file="f7" line="5642" offset="352"/>
  <Field id="_4926" name="shaderDenormFlushToZeroFloat16" type="_104" context="_1169" access="public" location="f7:5643" file="f7" line="5643" offset="384"/>
  <Field id="_4927" name="shaderDenormFlushToZeroFloat32" type="_104" context="_1169" access="public" location="f7:5644" file="f7" line="5644" offset="416"/>
  <Field id="_4928" name="shaderDenormFlushToZeroFloat64" type="_104" context="_1169" access="public" location="f7:5645" file="f7" line="5645" offset="448"/>
  <Field id="_4929" name="shaderRoundingModeRTEFloat16" type="_104" context="_1169" access="public" location="f7:5646" file="f7" line="5646" offset="480"/>
  <Field id="_4930" name="shaderRoundingModeRTEFloat32" type="_104" context="_1169" access="public" location="f7:5647" file="f7" line="5647" offset="512"/>
  <Field id="_4931" name="shaderRoundingModeRTEFloat64" type="_104" context="_1169" access="public" location="f7:5648" file="f7" line="5648" offset="544"/>
  <Field id="_4932" name="shaderRoundingModeRTZFloat16" type="_104" context="_1169" access="public" location="f7:5649" file="f7" line="5649" offset="576"/>
  <Field id="_4933" name="shaderRoundingModeRTZFloat32" type="_104" context="_1169" access="public" location="f7:5650" file="f7" line="5650" offset="608"/>
  <Field id="_4934" name="shaderRoundingModeRTZFloat64" type="_104" context="_1169" access="public" location="f7:5651" file="f7" line="5651" offset="640"/>
  <ElaboratedType id="_4935" type="_1169"/>
  <Field id="_4936" name="sType" type="_162" context="_1171" access="public" location="f7:5655" file="f7" line="5655" offset="0"/>
  <Field id="_4937" name="pNext" type="_4239" context="_1171" access="public" location="f7:5656" file="f7" line="5656" offset="64"/>
  <Field id="_4938" name="bindingCount" type="_82" context="_1171" access="public" location="f7:5657" file="f7" line="5657" offset="128"/>
  <Field id="_4939" name="pBindingFlags" type="_8017" context="_1171" access="public" location="f7:5658" file="f7" line="5658" offset="192"/>
  <ElaboratedType id="_4940" type="_1171"/>
  <Field id="_4941" name="sType" type="_162" context="_1173" access="public" location="f7:5662" file="f7" line="5662" offset="0"/>
  <Field id="_4942" name="pNext" type="_3035" context="_1173" access="public" location="f7:5663" file="f7" line="5663" offset="64"/>
  <Field id="_4943" name="shaderInputAttachmentArrayDynamicIndexing" type="_104" context="_1173" access="public" location="f7:5664" file="f7" line="5664" offset="128"/>
  <Field id="_4944" name="shaderUniformTexelBufferArrayDynamicIndexing" type="_104" context="_1173" access="public" location="f7:5665" file="f7" line="5665" offset="160"/>
  <Field id="_4945" name="shaderStorageTexelBufferArrayDynamicIndexing" type="_104" context="_1173" access="public" location="f7:5666" file="f7" line="5666" offset="192"/>
  <Field id="_4946" name="shaderUniformBufferArrayNonUniformIndexing" type="_104" context="_1173" access="public" location="f7:5667" file="f7" line="5667" offset="224"/>
  <Field id="_4947" name="shaderSampledImageArrayNonUniformIndexing" type="_104" context="_1173" access="public" location="f7:5668" file="f7" line="5668" offset="256"/>
  <Field id="_4948" name="shaderStorageBufferArrayNonUniformIndexing" type="_104" context="_1173" access="public" location="f7:5669" file="f7" line="5669" offset="288"/>
  <Field id="_4949" name="shaderStorageImageArrayNonUniformIndexing" type="_104" context="_1173" access="public" location="f7:5670" file="f7" line="5670" offset="320"/>
  <Field id="_4950" name="shaderInputAttachmentArrayNonUniformIndexing" type="_104" context="_1173" access="public" location="f7:5671" file="f7" line="5671" offset="352"/>
  <Field id="_4951" name="shaderUniformTexelBufferArrayNonUniformIndexing" type="_104" context="_1173" access="public" location="f7:5672" file="f7" line="5672" offset="384"/>
  <Field id="_4952" name="shaderStorageTexelBufferArrayNonUniformIndexing" type="_104" context="_1173" access="public" location="f7:5673" file="f7" line="5673" offset="416"/>
  <Field id="_4953" name="descriptorBindingUniformBufferUpdateAfterBind" type="_104" context="_1173" access="public" location="f7:5674" file="f7" line="5674" offset="448"/>
  <Field id="_4954" name="descriptorBindingSampledImageUpdateAfterBind" type="_104" context="_1173" access="public" location="f7:5675" file="f7" line="5675" offset="480"/>
  <Field id="_4955" name="descriptorBindingStorageImageUpdateAfterBind" type="_104" context="_1173" access="public" location="f7:5676" file="f7" line="5676" offset="512"/>
  <Field id="_4956" name="descriptorBindingStorageBufferUpdateAfterBind" type="_104" context="_1173" access="public" location="f7:5677" file="f7" line="5677" offset="544"/>
  <Field id="_4957" name="descriptorBindingUniformTexelBufferUpdateAfterBind" type="_104" context="_1173" access="public" location="f7:5678" file="f7" line="5678" offset="576"/>
  <Field id="_4958" name="descriptorBindingStorageTexelBufferUpdateAfterBind" type="_104" context="_1173" access="public" location="f7:5679" file="f7" line="5679" offset="608"/>
  <Field id="_4959" name="descriptorBindingUpdateUnusedWhilePending" type="_104" context="_1173" access="public" location="f7:5680" file="f7" line="5680" offset="640"/>
  <Field id="_4960" name="descriptorBindingPartiallyBound" type="_104" context="_1173" access="public" location="f7:5681" file="f7" line="5681" offset="672"/>
  <Field id="_4961" name="descriptorBindingVariableDescriptorCount" type="_104" context="_1173" access="public" location="f7:5682" file="f7" line="5682" offset="704"/>
  <Field id="_4962" name="runtimeDescriptorArray" type="_104" context="_1173" access="public" location="f7:5683" file="f7" line="5683" offset="736"/>
  <ElaboratedType id="_4963" type="_1173"/>
  <Field id="_4964" name="sType" type="_162" context="_1175" access="public" location="f7:5687" file="f7" line="5687" offset="0"/>
  <Field id="_4965" name="pNext" type="_3035" context="_1175" access="public" location="f7:5688" file="f7" line="5688" offset="64"/>
  <Field id="_4966" name="maxUpdateAfterBindDescriptorsInAllPools" type="_82" context="_1175" access="public" location="f7:5689" file="f7" line="5689" offset="128"/>
  <Field id="_4967" name="shaderUniformBufferArrayNonUniformIndexingNative" type="_104" context="_1175" access="public" location="f7:5690" file="f7" line="5690" offset="160"/>
  <Field id="_4968" name="shaderSampledImageArrayNonUniformIndexingNative" type="_104" context="_1175" access="public" location="f7:5691" file="f7" line="5691" offset="192"/>
  <Field id="_4969" name="shaderStorageBufferArrayNonUniformIndexingNative" type="_104" context="_1175" access="public" location="f7:5692" file="f7" line="5692" offset="224"/>
  <Field id="_4970" name="shaderStorageImageArrayNonUniformIndexingNative" type="_104" context="_1175" access="public" location="f7:5693" file="f7" line="5693" offset="256"/>
  <Field id="_4971" name="shaderInputAttachmentArrayNonUniformIndexingNative" type="_104" context="_1175" access="public" location="f7:5694" file="f7" line="5694" offset="288"/>
  <Field id="_4972" name="robustBufferAccessUpdateAfterBind" type="_104" context="_1175" access="public" location="f7:5695" file="f7" line="5695" offset="320"/>
  <Field id="_4973" name="quadDivergentImplicitLod" type="_104" context="_1175" access="public" location="f7:5696" file="f7" line="5696" offset="352"/>
  <Field id="_4974" name="maxPerStageDescriptorUpdateAfterBindSamplers" type="_82" context="_1175" access="public" location="f7:5697" file="f7" line="5697" offset="384"/>
  <Field id="_4975" name="maxPerStageDescriptorUpdateAfterBindUniformBuffers" type="_82" context="_1175" access="public" location="f7:5698" file="f7" line="5698" offset="416"/>
  <Field id="_4976" name="maxPerStageDescriptorUpdateAfterBindStorageBuffers" type="_82" context="_1175" access="public" location="f7:5699" file="f7" line="5699" offset="448"/>
  <Field id="_4977" name="maxPerStageDescriptorUpdateAfterBindSampledImages" type="_82" context="_1175" access="public" location="f7:5700" file="f7" line="5700" offset="480"/>
  <Field id="_4978" name="maxPerStageDescriptorUpdateAfterBindStorageImages" type="_82" context="_1175" access="public" location="f7:5701" file="f7" line="5701" offset="512"/>
  <Field id="_4979" name="maxPerStageDescriptorUpdateAfterBindInputAttachments" type="_82" context="_1175" access="public" location="f7:5702" file="f7" line="5702" offset="544"/>
  <Field id="_4980" name="maxPerStageUpdateAfterBindResources" type="_82" context="_1175" access="public" location="f7:5703" file="f7" line="5703" offset="576"/>
  <Field id="_4981" name="maxDescriptorSetUpdateAfterBindSamplers" type="_82" context="_1175" access="public" location="f7:5704" file="f7" line="5704" offset="608"/>
  <Field id="_4982" name="maxDescriptorSetUpdateAfterBindUniformBuffers" type="_82" context="_1175" access="public" location="f7:5705" file="f7" line="5705" offset="640"/>
  <Field id="_4983" name="maxDescriptorSetUpdateAfterBindUniformBuffersDynamic" type="_82" context="_1175" access="public" location="f7:5706" file="f7" line="5706" offset="672"/>
  <Field id="_4984" name="maxDescriptorSetUpdateAfterBindStorageBuffers" type="_82" context="_1175" access="public" location="f7:5707" file="f7" line="5707" offset="704"/>
  <Field id="_4985" name="maxDescriptorSetUpdateAfterBindStorageBuffersDynamic" type="_82" context="_1175" access="public" location="f7:5708" file="f7" line="5708" offset="736"/>
  <Field id="_4986" name="maxDescriptorSetUpdateAfterBindSampledImages" type="_82" context="_1175" access="public" location="f7:5709" file="f7" line="5709" offset="768"/>
  <Field id="_4987" name="maxDescriptorSetUpdateAfterBindStorageImages" type="_82" context="_1175" access="public" location="f7:5710" file="f7" line="5710" offset="800"/>
  <Field id="_4988" name="maxDescriptorSetUpdateAfterBindInputAttachments" type="_82" context="_1175" access="public" location="f7:5711" file="f7" line="5711" offset="832"/>
  <ElaboratedType id="_4989" type="_1175"/>
  <Field id="_4990" name="sType" type="_162" context="_1177" access="public" location="f7:5715" file="f7" line="5715" offset="0"/>
  <Field id="_4991" name="pNext" type="_4239" context="_1177" access="public" location="f7:5716" file="f7" line="5716" offset="64"/>
  <Field id="_4992" name="descriptorSetCount" type="_82" context="_1177" access="public" location="f7:5717" file="f7" line="5717" offset="128"/>
  <Field id="_4993" name="pDescriptorCounts" type="_4232" context="_1177" access="public" location="f7:5718" file="f7" line="5718" offset="192"/>
  <ElaboratedType id="_4994" type="_1177"/>
  <Field id="_4995" name="sType" type="_162" context="_1179" access="public" location="f7:5722" file="f7" line="5722" offset="0"/>
  <Field id="_4996" name="pNext" type="_3035" context="_1179" access="public" location="f7:5723" file="f7" line="5723" offset="64"/>
  <Field id="_4997" name="maxVariableDescriptorCount" type="_82" context="_1179" access="public" location="f7:5724" file="f7" line="5724" offset="128"/>
  <ElaboratedType id="_4998" type="_1179"/>
  <Field id="_4999" name="sType" type="_162" context="_1181" access="public" location="f7:5728" file="f7" line="5728" offset="0"/>
  <Field id="_5000" name="pNext" type="_4239" context="_1181" access="public" location="f7:5729" file="f7" line="5729" offset="64"/>
  <Field id="_5001" name="depthResolveMode" type="_1127" context="_1181" access="public" location="f7:5730" file="f7" line="5730" offset="128"/>
  <Field id="_5002" name="stencilResolveMode" type="_1127" context="_1181" access="public" location="f7:5731" file="f7" line="5731" offset="160"/>
  <Field id="_5003" name="pDepthStencilResolveAttachment" type="_8013" context="_1181" access="public" location="f7:5732" file="f7" line="5732" offset="192"/>
  <ElaboratedType id="_5004" type="_1181"/>
  <Field id="_5005" name="sType" type="_162" context="_1183" access="public" location="f7:5736" file="f7" line="5736" offset="0"/>
  <Field id="_5006" name="pNext" type="_3035" context="_1183" access="public" location="f7:5737" file="f7" line="5737" offset="64"/>
  <Field id="_5007" name="supportedDepthResolveModes" type="_1128" context="_1183" access="public" location="f7:5738" file="f7" line="5738" offset="128"/>
  <Field id="_5008" name="supportedStencilResolveModes" type="_1128" context="_1183" access="public" location="f7:5739" file="f7" line="5739" offset="160"/>
  <Field id="_5009" name="independentResolveNone" type="_104" context="_1183" access="public" location="f7:5740" file="f7" line="5740" offset="192"/>
  <Field id="_5010" name="independentResolve" type="_104" context="_1183" access="public" location="f7:5741" file="f7" line="5741" offset="224"/>
  <ElaboratedType id="_5011" type="_1183"/>
  <Field id="_5012" name="sType" type="_162" context="_1185" access="public" location="f7:5745" file="f7" line="5745" offset="0"/>
  <Field id="_5013" name="pNext" type="_3035" context="_1185" access="public" location="f7:5746" file="f7" line="5746" offset="64"/>
  <Field id="_5014" name="scalarBlockLayout" type="_104" context="_1185" access="public" location="f7:5747" file="f7" line="5747" offset="128"/>
  <ElaboratedType id="_5015" type="_1185"/>
  <Field id="_5016" name="sType" type="_162" context="_1187" access="public" location="f7:5751" file="f7" line="5751" offset="0"/>
  <Field id="_5017" name="pNext" type="_4239" context="_1187" access="public" location="f7:5752" file="f7" line="5752" offset="64"/>
  <Field id="_5018" name="stencilUsage" type="_250" context="_1187" access="public" location="f7:5753" file="f7" line="5753" offset="128"/>
  <ElaboratedType id="_5019" type="_1187"/>
  <Field id="_5020" name="sType" type="_162" context="_1189" access="public" location="f7:5757" file="f7" line="5757" offset="0"/>
  <Field id="_5021" name="pNext" type="_4239" context="_1189" access="public" location="f7:5758" file="f7" line="5758" offset="64"/>
  <Field id="_5022" name="reductionMode" type="_1123" context="_1189" access="public" location="f7:5759" file="f7" line="5759" offset="128"/>
  <ElaboratedType id="_5023" type="_1189"/>
  <Field id="_5024" name="sType" type="_162" context="_1191" access="public" location="f7:5763" file="f7" line="5763" offset="0"/>
  <Field id="_5025" name="pNext" type="_3035" context="_1191" access="public" location="f7:5764" file="f7" line="5764" offset="64"/>
  <Field id="_5026" name="filterMinmaxSingleComponentFormats" type="_104" context="_1191" access="public" location="f7:5765" file="f7" line="5765" offset="128"/>
  <Field id="_5027" name="filterMinmaxImageComponentMapping" type="_104" context="_1191" access="public" location="f7:5766" file="f7" line="5766" offset="160"/>
  <ElaboratedType id="_5028" type="_1191"/>
  <Field id="_5029" name="sType" type="_162" context="_1193" access="public" location="f7:5770" file="f7" line="5770" offset="0"/>
  <Field id="_5030" name="pNext" type="_3035" context="_1193" access="public" location="f7:5771" file="f7" line="5771" offset="64"/>
  <Field id="_5031" name="vulkanMemoryModel" type="_104" context="_1193" access="public" location="f7:5772" file="f7" line="5772" offset="128"/>
  <Field id="_5032" name="vulkanMemoryModelDeviceScope" type="_104" context="_1193" access="public" location="f7:5773" file="f7" line="5773" offset="160"/>
  <Field id="_5033" name="vulkanMemoryModelAvailabilityVisibilityChains" type="_104" context="_1193" access="public" location="f7:5774" file="f7" line="5774" offset="192"/>
  <ElaboratedType id="_5034" type="_1193"/>
  <Field id="_5035" name="sType" type="_162" context="_1195" access="public" location="f7:5778" file="f7" line="5778" offset="0"/>
  <Field id="_5036" name="pNext" type="_3035" context="_1195" access="public" location="f7:5779" file="f7" line="5779" offset="64"/>
  <Field id="_5037" name="imagelessFramebuffer" type="_104" context="_1195" access="public" location="f7:5780" file="f7" line="5780" offset="128"/>
  <ElaboratedType id="_5038" type="_1195"/>
  <Field id="_5039" name="sType" type="_162" context="_1197" access="public" location="f7:5784" file="f7" line="5784" offset="0"/>
  <Field id="_5040" name="pNext" type="_4239" context="_1197" access="public" location="f7:5785" file="f7" line="5785" offset="64"/>
  <Field id="_5041" name="flags" type="_244" context="_1197" access="public" location="f7:5786" file="f7" line="5786" offset="128"/>
  <Field id="_5042" name="usage" type="_250" context="_1197" access="public" location="f7:5787" file="f7" line="5787" offset="160"/>
  <Field id="_5043" name="width" type="_82" context="_1197" access="public" location="f7:5788" file="f7" line="5788" offset="192"/>
  <Field id="_5044" name="height" type="_82" context="_1197" access="public" location="f7:5789" file="f7" line="5789" offset="224"/>
  <Field id="_5045" name="layerCount" type="_82" context="_1197" access="public" location="f7:5790" file="f7" line="5790" offset="256"/>
  <Field id="_5046" name="viewFormatCount" type="_82" context="_1197" access="public" location="f7:5791" file="f7" line="5791" offset="288"/>
  <Field id="_5047" name="pViewFormats" type="_8012" context="_1197" access="public" location="f7:5792" file="f7" line="5792" offset="320"/>
  <ElaboratedType id="_5048" type="_1197"/>
  <Field id="_5049" name="sType" type="_162" context="_1199" access="public" location="f7:5796" file="f7" line="5796" offset="0"/>
  <Field id="_5050" name="pNext" type="_4239" context="_1199" access="public" location="f7:5797" file="f7" line="5797" offset="64"/>
  <Field id="_5051" name="attachmentImageInfoCount" type="_82" context="_1199" access="public" location="f7:5798" file="f7" line="5798" offset="128"/>
  <Field id="_5052" name="pAttachmentImageInfos" type="_8018" context="_1199" access="public" location="f7:5799" file="f7" line="5799" offset="192"/>
  <ElaboratedType id="_5053" type="_1199"/>
  <Field id="_5054" name="sType" type="_162" context="_1201" access="public" location="f7:5803" file="f7" line="5803" offset="0"/>
  <Field id="_5055" name="pNext" type="_4239" context="_1201" access="public" location="f7:5804" file="f7" line="5804" offset="64"/>
  <Field id="_5056" name="attachmentCount" type="_82" context="_1201" access="public" location="f7:5805" file="f7" line="5805" offset="128"/>
  <Field id="_5057" name="pAttachments" type="_7837" context="_1201" access="public" location="f7:5806" file="f7" line="5806" offset="192"/>
  <ElaboratedType id="_5058" type="_1201"/>
  <Field id="_5059" name="sType" type="_162" context="_1203" access="public" location="f7:5810" file="f7" line="5810" offset="0"/>
  <Field id="_5060" name="pNext" type="_3035" context="_1203" access="public" location="f7:5811" file="f7" line="5811" offset="64"/>
  <Field id="_5061" name="uniformBufferStandardLayout" type="_104" context="_1203" access="public" location="f7:5812" file="f7" line="5812" offset="128"/>
  <ElaboratedType id="_5062" type="_1203"/>
  <Field id="_5063" name="sType" type="_162" context="_1205" access="public" location="f7:5816" file="f7" line="5816" offset="0"/>
  <Field id="_5064" name="pNext" type="_3035" context="_1205" access="public" location="f7:5817" file="f7" line="5817" offset="64"/>
  <Field id="_5065" name="shaderSubgroupExtendedTypes" type="_104" context="_1205" access="public" location="f7:5818" file="f7" line="5818" offset="128"/>
  <ElaboratedType id="_5066" type="_1205"/>
  <Field id="_5067" name="sType" type="_162" context="_1207" access="public" location="f7:5822" file="f7" line="5822" offset="0"/>
  <Field id="_5068" name="pNext" type="_3035" context="_1207" access="public" location="f7:5823" file="f7" line="5823" offset="64"/>
  <Field id="_5069" name="separateDepthStencilLayouts" type="_104" context="_1207" access="public" location="f7:5824" file="f7" line="5824" offset="128"/>
  <ElaboratedType id="_5070" type="_1207"/>
  <Field id="_5071" name="sType" type="_162" context="_1209" access="public" location="f7:5828" file="f7" line="5828" offset="0"/>
  <Field id="_5072" name="pNext" type="_3035" context="_1209" access="public" location="f7:5829" file="f7" line="5829" offset="64"/>
  <Field id="_5073" name="stencilLayout" type="_164" context="_1209" access="public" location="f7:5830" file="f7" line="5830" offset="128"/>
  <ElaboratedType id="_5074" type="_1209"/>
  <Field id="_5075" name="sType" type="_162" context="_1211" access="public" location="f7:5834" file="f7" line="5834" offset="0"/>
  <Field id="_5076" name="pNext" type="_3035" context="_1211" access="public" location="f7:5835" file="f7" line="5835" offset="64"/>
  <Field id="_5077" name="stencilInitialLayout" type="_164" context="_1211" access="public" location="f7:5836" file="f7" line="5836" offset="128"/>
  <Field id="_5078" name="stencilFinalLayout" type="_164" context="_1211" access="public" location="f7:5837" file="f7" line="5837" offset="160"/>
  <ElaboratedType id="_5079" type="_1211"/>
  <Field id="_5080" name="sType" type="_162" context="_1213" access="public" location="f7:5841" file="f7" line="5841" offset="0"/>
  <Field id="_5081" name="pNext" type="_3035" context="_1213" access="public" location="f7:5842" file="f7" line="5842" offset="64"/>
  <Field id="_5082" name="hostQueryReset" type="_104" context="_1213" access="public" location="f7:5843" file="f7" line="5843" offset="128"/>
  <ElaboratedType id="_5083" type="_1213"/>
  <Field id="_5084" name="sType" type="_162" context="_1215" access="public" location="f7:5847" file="f7" line="5847" offset="0"/>
  <Field id="_5085" name="pNext" type="_3035" context="_1215" access="public" location="f7:5848" file="f7" line="5848" offset="64"/>
  <Field id="_5086" name="timelineSemaphore" type="_104" context="_1215" access="public" location="f7:5849" file="f7" line="5849" offset="128"/>
  <ElaboratedType id="_5087" type="_1215"/>
  <Field id="_5088" name="sType" type="_162" context="_1217" access="public" location="f7:5853" file="f7" line="5853" offset="0"/>
  <Field id="_5089" name="pNext" type="_3035" context="_1217" access="public" location="f7:5854" file="f7" line="5854" offset="64"/>
  <Field id="_5090" name="maxTimelineSemaphoreValueDifference" type="_83" context="_1217" access="public" location="f7:5855" file="f7" line="5855" offset="128"/>
  <ElaboratedType id="_5091" type="_1217"/>
  <Field id="_5092" name="sType" type="_162" context="_1219" access="public" location="f7:5859" file="f7" line="5859" offset="0"/>
  <Field id="_5093" name="pNext" type="_4239" context="_1219" access="public" location="f7:5860" file="f7" line="5860" offset="64"/>
  <Field id="_5094" name="semaphoreType" type="_1125" context="_1219" access="public" location="f7:5861" file="f7" line="5861" offset="128"/>
  <Field id="_5095" name="initialValue" type="_83" context="_1219" access="public" location="f7:5862" file="f7" line="5862" offset="192"/>
  <ElaboratedType id="_5096" type="_1219"/>
  <Field id="_5097" name="sType" type="_162" context="_1221" access="public" location="f7:5866" file="f7" line="5866" offset="0"/>
  <Field id="_5098" name="pNext" type="_4239" context="_1221" access="public" location="f7:5867" file="f7" line="5867" offset="64"/>
  <Field id="_5099" name="waitSemaphoreValueCount" type="_82" context="_1221" access="public" location="f7:5868" file="f7" line="5868" offset="128"/>
  <Field id="_5100" name="pWaitSemaphoreValues" type="_8019" context="_1221" access="public" location="f7:5869" file="f7" line="5869" offset="192"/>
  <Field id="_5101" name="signalSemaphoreValueCount" type="_82" context="_1221" access="public" location="f7:5870" file="f7" line="5870" offset="256"/>
  <Field id="_5102" name="pSignalSemaphoreValues" type="_8019" context="_1221" access="public" location="f7:5871" file="f7" line="5871" offset="320"/>
  <ElaboratedType id="_5103" type="_1221"/>
  <Field id="_5104" name="sType" type="_162" context="_1223" access="public" location="f7:5875" file="f7" line="5875" offset="0"/>
  <Field id="_5105" name="pNext" type="_4239" context="_1223" access="public" location="f7:5876" file="f7" line="5876" offset="64"/>
  <Field id="_5106" name="flags" type="_1134" context="_1223" access="public" location="f7:5877" file="f7" line="5877" offset="128"/>
  <Field id="_5107" name="semaphoreCount" type="_82" context="_1223" access="public" location="f7:5878" file="f7" line="5878" offset="160"/>
  <Field id="_5108" name="pSemaphores" type="_7804" context="_1223" access="public" location="f7:5879" file="f7" line="5879" offset="192"/>
  <Field id="_5109" name="pValues" type="_8019" context="_1223" access="public" location="f7:5880" file="f7" line="5880" offset="256"/>
  <ElaboratedType id="_5110" type="_1223"/>
  <Field id="_5111" name="sType" type="_162" context="_1225" access="public" location="f7:5884" file="f7" line="5884" offset="0"/>
  <Field id="_5112" name="pNext" type="_4239" context="_1225" access="public" location="f7:5885" file="f7" line="5885" offset="64"/>
  <Field id="_5113" name="semaphore" type="_122" context="_1225" access="public" location="f7:5886" file="f7" line="5886" offset="128"/>
  <Field id="_5114" name="value" type="_83" context="_1225" access="public" location="f7:5887" file="f7" line="5887" offset="192"/>
  <ElaboratedType id="_5115" type="_1225"/>
  <Field id="_5116" name="sType" type="_162" context="_1227" access="public" location="f7:5891" file="f7" line="5891" offset="0"/>
  <Field id="_5117" name="pNext" type="_3035" context="_1227" access="public" location="f7:5892" file="f7" line="5892" offset="64"/>
  <Field id="_5118" name="bufferDeviceAddress" type="_104" context="_1227" access="public" location="f7:5893" file="f7" line="5893" offset="128"/>
  <Field id="_5119" name="bufferDeviceAddressCaptureReplay" type="_104" context="_1227" access="public" location="f7:5894" file="f7" line="5894" offset="160"/>
  <Field id="_5120" name="bufferDeviceAddressMultiDevice" type="_104" context="_1227" access="public" location="f7:5895" file="f7" line="5895" offset="192"/>
  <ElaboratedType id="_5121" type="_1227"/>
  <Field id="_5122" name="sType" type="_162" context="_1229" access="public" location="f7:5899" file="f7" line="5899" offset="0"/>
  <Field id="_5123" name="pNext" type="_4239" context="_1229" access="public" location="f7:5900" file="f7" line="5900" offset="64"/>
  <Field id="_5124" name="buffer" type="_110" context="_1229" access="public" location="f7:5901" file="f7" line="5901" offset="128"/>
  <ElaboratedType id="_5125" type="_1229"/>
  <Field id="_5126" name="sType" type="_162" context="_1231" access="public" location="f7:5905" file="f7" line="5905" offset="0"/>
  <Field id="_5127" name="pNext" type="_4239" context="_1231" access="public" location="f7:5906" file="f7" line="5906" offset="64"/>
  <Field id="_5128" name="opaqueCaptureAddress" type="_83" context="_1231" access="public" location="f7:5907" file="f7" line="5907" offset="128"/>
  <ElaboratedType id="_5129" type="_1231"/>
  <Field id="_5130" name="sType" type="_162" context="_1233" access="public" location="f7:5911" file="f7" line="5911" offset="0"/>
  <Field id="_5131" name="pNext" type="_4239" context="_1233" access="public" location="f7:5912" file="f7" line="5912" offset="64"/>
  <Field id="_5132" name="opaqueCaptureAddress" type="_83" context="_1233" access="public" location="f7:5913" file="f7" line="5913" offset="128"/>
  <ElaboratedType id="_5133" type="_1233"/>
  <Field id="_5134" name="sType" type="_162" context="_1235" access="public" location="f7:5917" file="f7" line="5917" offset="0"/>
  <Field id="_5135" name="pNext" type="_4239" context="_1235" access="public" location="f7:5918" file="f7" line="5918" offset="64"/>
  <Field id="_5136" name="memory" type="_128" context="_1235" access="public" location="f7:5919" file="f7" line="5919" offset="128"/>
  <ElaboratedType id="_5137" type="_1235"/>
  <PointerType id="_5138" type="_8020" size="64" align="64"/>
  <PointerType id="_5139" type="_8021" size="64" align="64"/>
  <PointerType id="_5140" type="_8022" size="64" align="64"/>
  <PointerType id="_5141" type="_8023" size="64" align="64"/>
  <PointerType id="_5142" type="_8024" size="64" align="64"/>
  <PointerType id="_5143" type="_8025" size="64" align="64"/>
  <PointerType id="_5144" type="_8026" size="64" align="64"/>
  <PointerType id="_5145" type="_8027" size="64" align="64"/>
  <PointerType id="_5146" type="_8028" size="64" align="64"/>
  <PointerType id="_5147" type="_8029" size="64" align="64"/>
  <PointerType id="_5148" type="_8030" size="64" align="64"/>
  <PointerType id="_5149" type="_8031" size="64" align="64"/>
  <PointerType id="_5150" type="_1156c" size="64" align="64"/>
  <CvQualifiedType id="_1156c" type="_1156" const="1"/>
  <PointerType id="_5151" type="_1158c" size="64" align="64"/>
  <CvQualifiedType id="_1158c" type="_1158" const="1"/>
  <PointerType id="_5152" type="_1160c" size="64" align="64"/>
  <CvQualifiedType id="_1160c" type="_1160" const="1"/>
  <PointerType id="_5153" type="_83" size="64" align="64"/>
  <PointerType id="_5154" type="_1224c" size="64" align="64"/>
  <CvQualifiedType id="_1224c" type="_1224" const="1"/>
  <PointerType id="_5155" type="_1226c" size="64" align="64"/>
  <CvQualifiedType id="_1226c" type="_1226" const="1"/>
  <PointerType id="_5156" type="_1230c" size="64" align="64"/>
  <CvQualifiedType id="_1230c" type="_1230" const="1"/>
  <PointerType id="_5157" type="_1236c" size="64" align="64"/>
  <CvQualifiedType id="_1236c" type="_1236" const="1"/>
  <PointerType id="_5158" type="_8032" size="64" align="64"/>
  <ElaboratedType id="_5159" type="_1265"/>
  <ElaboratedType id="_5160" type="_1267"/>
  <ElaboratedType id="_5161" type="_1269"/>
  <ElaboratedType id="_5162" type="_1271"/>
  <Field id="_5163" name="minImageCount" type="_82" context="_1275" access="public" location="f7:6069" file="f7" line="6069" offset="0"/>
  <Field id="_5164" name="maxImageCount" type="_82" context="_1275" access="public" location="f7:6070" file="f7" line="6070" offset="32"/>
  <Field id="_5165" name="currentExtent" type="_374" context="_1275" access="public" location="f7:6071" file="f7" line="6071" offset="64"/>
  <Field id="_5166" name="minImageExtent" type="_374" context="_1275" access="public" location="f7:6072" file="f7" line="6072" offset="128"/>
  <Field id="_5167" name="maxImageExtent" type="_374" context="_1275" access="public" location="f7:6073" file="f7" line="6073" offset="192"/>
  <Field id="_5168" name="maxImageArrayLayers" type="_82" context="_1275" access="public" location="f7:6074" file="f7" line="6074" offset="256"/>
  <Field id="_5169" name="supportedTransforms" type="_1274" context="_1275" access="public" location="f7:6075" file="f7" line="6075" offset="288"/>
  <Field id="_5170" name="currentTransform" type="_1270" context="_1275" access="public" location="f7:6076" file="f7" line="6076" offset="320"/>
  <Field id="_5171" name="supportedCompositeAlpha" type="_1273" context="_1275" access="public" location="f7:6077" file="f7" line="6077" offset="352"/>
  <Field id="_5172" name="supportedUsageFlags" type="_250" context="_1275" access="public" location="f7:6078" file="f7" line="6078" offset="384"/>
  <ElaboratedType id="_5173" type="_1275"/>
  <Field id="_5174" name="format" type="_176" context="_1277" access="public" location="f7:6082" file="f7" line="6082" offset="0"/>
  <Field id="_5175" name="colorSpace" type="_1268" context="_1277" access="public" location="f7:6083" file="f7" line="6083" offset="32"/>
  <ElaboratedType id="_5176" type="_1277"/>
  <PointerType id="_5177" type="_8033" size="64" align="64"/>
  <PointerType id="_5178" type="_8034" size="64" align="64"/>
  <PointerType id="_5179" type="_8035" size="64" align="64"/>
  <PointerType id="_5180" type="_8036" size="64" align="64"/>
  <PointerType id="_5181" type="_8037" size="64" align="64"/>
  <PointerType id="_5182" type="_104" size="64" align="64"/>
  <PointerType id="_5183" type="_1276" size="64" align="64"/>
  <PointerType id="_5184" type="_1278" size="64" align="64"/>
  <PointerType id="_5185" type="_1266" size="64" align="64"/>
  <PointerType id="_5186" type="_8038" size="64" align="64"/>
  <ElaboratedType id="_5187" type="_1291"/>
  <ElaboratedType id="_5188" type="_1294"/>
  <Field id="_5189" name="sType" type="_162" context="_1297" access="public" location="f7:6145" file="f7" line="6145" offset="0"/>
  <Field id="_5190" name="pNext" type="_4239" context="_1297" access="public" location="f7:6146" file="f7" line="6146" offset="64"/>
  <Field id="_5191" name="flags" type="_1293" context="_1297" access="public" location="f7:6147" file="f7" line="6147" offset="128"/>
  <Field id="_5192" name="surface" type="_1264" context="_1297" access="public" location="f7:6148" file="f7" line="6148" offset="192"/>
  <Field id="_5193" name="minImageCount" type="_82" context="_1297" access="public" location="f7:6149" file="f7" line="6149" offset="256"/>
  <Field id="_5194" name="imageFormat" type="_176" context="_1297" access="public" location="f7:6150" file="f7" line="6150" offset="288"/>
  <Field id="_5195" name="imageColorSpace" type="_1268" context="_1297" access="public" location="f7:6151" file="f7" line="6151" offset="320"/>
  <Field id="_5196" name="imageExtent" type="_374" context="_1297" access="public" location="f7:6152" file="f7" line="6152" offset="352"/>
  <Field id="_5197" name="imageArrayLayers" type="_82" context="_1297" access="public" location="f7:6153" file="f7" line="6153" offset="416"/>
  <Field id="_5198" name="imageUsage" type="_250" context="_1297" access="public" location="f7:6154" file="f7" line="6154" offset="448"/>
  <Field id="_5199" name="imageSharingMode" type="_186" context="_1297" access="public" location="f7:6155" file="f7" line="6155" offset="480"/>
  <Field id="_5200" name="queueFamilyIndexCount" type="_82" context="_1297" access="public" location="f7:6156" file="f7" line="6156" offset="512"/>
  <Field id="_5201" name="pQueueFamilyIndices" type="_4232" context="_1297" access="public" location="f7:6157" file="f7" line="6157" offset="576"/>
  <Field id="_5202" name="preTransform" type="_1270" context="_1297" access="public" location="f7:6158" file="f7" line="6158" offset="640"/>
  <Field id="_5203" name="compositeAlpha" type="_1272" context="_1297" access="public" location="f7:6159" file="f7" line="6159" offset="672"/>
  <Field id="_5204" name="presentMode" type="_1266" context="_1297" access="public" location="f7:6160" file="f7" line="6160" offset="704"/>
  <Field id="_5205" name="clipped" type="_104" context="_1297" access="public" location="f7:6161" file="f7" line="6161" offset="736"/>
  <Field id="_5206" name="oldSwapchain" type="_1290" context="_1297" access="public" location="f7:6162" file="f7" line="6162" offset="768"/>
  <ElaboratedType id="_5207" type="_1297"/>
  <Field id="_5208" name="sType" type="_162" context="_1299" access="public" location="f7:6166" file="f7" line="6166" offset="0"/>
  <Field id="_5209" name="pNext" type="_4239" context="_1299" access="public" location="f7:6167" file="f7" line="6167" offset="64"/>
  <Field id="_5210" name="waitSemaphoreCount" type="_82" context="_1299" access="public" location="f7:6168" file="f7" line="6168" offset="128"/>
  <Field id="_5211" name="pWaitSemaphores" type="_7804" context="_1299" access="public" location="f7:6169" file="f7" line="6169" offset="192"/>
  <Field id="_5212" name="swapchainCount" type="_82" context="_1299" access="public" location="f7:6170" file="f7" line="6170" offset="256"/>
  <Field id="_5213" name="pSwapchains" type="_6212" context="_1299" access="public" location="f7:6171" file="f7" line="6171" offset="320"/>
  <Field id="_5214" name="pImageIndices" type="_4232" context="_1299" access="public" location="f7:6172" file="f7" line="6172" offset="384"/>
  <Field id="_5215" name="pResults" type="_8039" context="_1299" access="public" location="f7:6173" file="f7" line="6173" offset="448"/>
  <ElaboratedType id="_5216" type="_1299"/>
  <Field id="_5217" name="sType" type="_162" context="_1301" access="public" location="f7:6177" file="f7" line="6177" offset="0"/>
  <Field id="_5218" name="pNext" type="_4239" context="_1301" access="public" location="f7:6178" file="f7" line="6178" offset="64"/>
  <Field id="_5219" name="swapchain" type="_1290" context="_1301" access="public" location="f7:6179" file="f7" line="6179" offset="128"/>
  <ElaboratedType id="_5220" type="_1301"/>
  <Field id="_5221" name="sType" type="_162" context="_1303" access="public" location="f7:6183" file="f7" line="6183" offset="0"/>
  <Field id="_5222" name="pNext" type="_4239" context="_1303" access="public" location="f7:6184" file="f7" line="6184" offset="64"/>
  <Field id="_5223" name="swapchain" type="_1290" context="_1303" access="public" location="f7:6185" file="f7" line="6185" offset="128"/>
  <Field id="_5224" name="imageIndex" type="_82" context="_1303" access="public" location="f7:6186" file="f7" line="6186" offset="192"/>
  <ElaboratedType id="_5225" type="_1303"/>
  <Field id="_5226" name="sType" type="_162" context="_1305" access="public" location="f7:6190" file="f7" line="6190" offset="0"/>
  <Field id="_5227" name="pNext" type="_4239" context="_1305" access="public" location="f7:6191" file="f7" line="6191" offset="64"/>
  <Field id="_5228" name="swapchain" type="_1290" context="_1305" access="public" location="f7:6192" file="f7" line="6192" offset="128"/>
  <Field id="_5229" name="timeout" type="_83" context="_1305" access="public" location="f7:6193" file="f7" line="6193" offset="192"/>
  <Field id="_5230" name="semaphore" type="_122" context="_1305" access="public" location="f7:6194" file="f7" line="6194" offset="256"/>
  <Field id="_5231" name="fence" type="_126" context="_1305" access="public" location="f7:6195" file="f7" line="6195" offset="320"/>
  <Field id="_5232" name="deviceMask" type="_82" context="_1305" access="public" location="f7:6196" file="f7" line="6196" offset="384"/>
  <ElaboratedType id="_5233" type="_1305"/>
  <Field id="_5234" name="sType" type="_162" context="_1307" access="public" location="f7:6200" file="f7" line="6200" offset="0"/>
  <Field id="_5235" name="pNext" type="_3035" context="_1307" access="public" location="f7:6201" file="f7" line="6201" offset="64"/>
  <Field id="_5236" name="presentMask" type="_8040" context="_1307" access="public" location="f7:6202" file="f7" line="6202" offset="128"/>
  <Field id="_5237" name="modes" type="_1296" context="_1307" access="public" location="f7:6203" file="f7" line="6203" offset="1152"/>
  <ElaboratedType id="_5238" type="_1307"/>
  <Field id="_5239" name="sType" type="_162" context="_1309" access="public" location="f7:6207" file="f7" line="6207" offset="0"/>
  <Field id="_5240" name="pNext" type="_4239" context="_1309" access="public" location="f7:6208" file="f7" line="6208" offset="64"/>
  <Field id="_5241" name="swapchainCount" type="_82" context="_1309" access="public" location="f7:6209" file="f7" line="6209" offset="128"/>
  <Field id="_5242" name="pDeviceMasks" type="_4232" context="_1309" access="public" location="f7:6210" file="f7" line="6210" offset="192"/>
  <Field id="_5243" name="mode" type="_1295" context="_1309" access="public" location="f7:6211" file="f7" line="6211" offset="256"/>
  <ElaboratedType id="_5244" type="_1309"/>
  <Field id="_5245" name="sType" type="_162" context="_1311" access="public" location="f7:6215" file="f7" line="6215" offset="0"/>
  <Field id="_5246" name="pNext" type="_4239" context="_1311" access="public" location="f7:6216" file="f7" line="6216" offset="64"/>
  <Field id="_5247" name="modes" type="_1296" context="_1311" access="public" location="f7:6217" file="f7" line="6217" offset="128"/>
  <ElaboratedType id="_5248" type="_1311"/>
  <PointerType id="_5249" type="_8041" size="64" align="64"/>
  <PointerType id="_5250" type="_8042" size="64" align="64"/>
  <PointerType id="_5251" type="_8043" size="64" align="64"/>
  <PointerType id="_5252" type="_8044" size="64" align="64"/>
  <PointerType id="_5253" type="_8045" size="64" align="64"/>
  <PointerType id="_5254" type="_8046" size="64" align="64"/>
  <PointerType id="_5255" type="_8047" size="64" align="64"/>
  <PointerType id="_5256" type="_8048" size="64" align="64"/>
  <PointerType id="_5257" type="_8049" size="64" align="64"/>
  <PointerType id="_5258" type="_1298c" size="64" align="64"/>
  <CvQualifiedType id="_1298c" type="_1298" const="1"/>
  <PointerType id="_5259" type="_1290" size="64" align="64"/>
  <PointerType id="_5260" type="_1300c" size="64" align="64"/>
  <CvQualifiedType id="_1300c" type="_1300" const="1"/>
  <PointerType id="_5261" type="_1308" size="64" align="64"/>
  <PointerType id="_5262" type="_1296" size="64" align="64"/>
  <PointerType id="_5263" type="_382" size="64" align="64"/>
  <PointerType id="_5264" type="_1306c" size="64" align="64"/>
  <CvQualifiedType id="_1306c" type="_1306" const="1"/>
  <PointerType id="_5265" type="_8050" size="64" align="64"/>
  <PointerType id="_5266" type="_8051" size="64" align="64"/>
  <ElaboratedType id="_5267" type="_1336"/>
  <Field id="_5268" name="visibleRegion" type="_374" context="_1340" access="public" location="f7:6299" file="f7" line="6299" offset="0"/>
  <Field id="_5269" name="refreshRate" type="_82" context="_1340" access="public" location="f7:6300" file="f7" line="6300" offset="64"/>
  <ElaboratedType id="_5270" type="_1340"/>
  <Field id="_5271" name="sType" type="_162" context="_1342" access="public" location="f7:6304" file="f7" line="6304" offset="0"/>
  <Field id="_5272" name="pNext" type="_4239" context="_1342" access="public" location="f7:6305" file="f7" line="6305" offset="64"/>
  <Field id="_5273" name="flags" type="_1335" context="_1342" access="public" location="f7:6306" file="f7" line="6306" offset="128"/>
  <Field id="_5274" name="parameters" type="_1341" context="_1342" access="public" location="f7:6307" file="f7" line="6307" offset="160"/>
  <ElaboratedType id="_5275" type="_1342"/>
  <Field id="_5276" name="displayMode" type="_1334" context="_1344" access="public" location="f7:6311" file="f7" line="6311" offset="0"/>
  <Field id="_5277" name="parameters" type="_1341" context="_1344" access="public" location="f7:6312" file="f7" line="6312" offset="64"/>
  <ElaboratedType id="_5278" type="_1344"/>
  <Field id="_5279" name="supportedAlpha" type="_1338" context="_1346" access="public" location="f7:6316" file="f7" line="6316" offset="0"/>
  <Field id="_5280" name="minSrcPosition" type="_378" context="_1346" access="public" location="f7:6317" file="f7" line="6317" offset="32"/>
  <Field id="_5281" name="maxSrcPosition" type="_378" context="_1346" access="public" location="f7:6318" file="f7" line="6318" offset="96"/>
  <Field id="_5282" name="minSrcExtent" type="_374" context="_1346" access="public" location="f7:6319" file="f7" line="6319" offset="160"/>
  <Field id="_5283" name="maxSrcExtent" type="_374" context="_1346" access="public" location="f7:6320" file="f7" line="6320" offset="224"/>
  <Field id="_5284" name="minDstPosition" type="_378" context="_1346" access="public" location="f7:6321" file="f7" line="6321" offset="288"/>
  <Field id="_5285" name="maxDstPosition" type="_378" context="_1346" access="public" location="f7:6322" file="f7" line="6322" offset="352"/>
  <Field id="_5286" name="minDstExtent" type="_374" context="_1346" access="public" location="f7:6323" file="f7" line="6323" offset="416"/>
  <Field id="_5287" name="maxDstExtent" type="_374" context="_1346" access="public" location="f7:6324" file="f7" line="6324" offset="480"/>
  <ElaboratedType id="_5288" type="_1346"/>
  <Field id="_5289" name="currentDisplay" type="_1332" context="_1348" access="public" location="f7:6328" file="f7" line="6328" offset="0"/>
  <Field id="_5290" name="currentStackIndex" type="_82" context="_1348" access="public" location="f7:6329" file="f7" line="6329" offset="64"/>
  <ElaboratedType id="_5291" type="_1348"/>
  <Field id="_5292" name="display" type="_1332" context="_1350" access="public" location="f7:6333" file="f7" line="6333" offset="0"/>
  <Field id="_5293" name="displayName" type="_4159" context="_1350" access="public" location="f7:6334" file="f7" line="6334" offset="64"/>
  <Field id="_5294" name="physicalDimensions" type="_374" context="_1350" access="public" location="f7:6335" file="f7" line="6335" offset="128"/>
  <Field id="_5295" name="physicalResolution" type="_374" context="_1350" access="public" location="f7:6336" file="f7" line="6336" offset="192"/>
  <Field id="_5296" name="supportedTransforms" type="_1274" context="_1350" access="public" location="f7:6337" file="f7" line="6337" offset="256"/>
  <Field id="_5297" name="planeReorderPossible" type="_104" context="_1350" access="public" location="f7:6338" file="f7" line="6338" offset="288"/>
  <Field id="_5298" name="persistentContent" type="_104" context="_1350" access="public" location="f7:6339" file="f7" line="6339" offset="320"/>
  <ElaboratedType id="_5299" type="_1350"/>
  <Field id="_5300" name="sType" type="_162" context="_1352" access="public" location="f7:6343" file="f7" line="6343" offset="0"/>
  <Field id="_5301" name="pNext" type="_4239" context="_1352" access="public" location="f7:6344" file="f7" line="6344" offset="64"/>
  <Field id="_5302" name="flags" type="_1339" context="_1352" access="public" location="f7:6345" file="f7" line="6345" offset="128"/>
  <Field id="_5303" name="displayMode" type="_1334" context="_1352" access="public" location="f7:6346" file="f7" line="6346" offset="192"/>
  <Field id="_5304" name="planeIndex" type="_82" context="_1352" access="public" location="f7:6347" file="f7" line="6347" offset="256"/>
  <Field id="_5305" name="planeStackIndex" type="_82" context="_1352" access="public" location="f7:6348" file="f7" line="6348" offset="288"/>
  <Field id="_5306" name="transform" type="_1270" context="_1352" access="public" location="f7:6349" file="f7" line="6349" offset="320"/>
  <Field id="_5307" name="globalAlpha" type="_4229" context="_1352" access="public" location="f7:6350" file="f7" line="6350" offset="352"/>
  <Field id="_5308" name="alphaMode" type="_1337" context="_1352" access="public" location="f7:6351" file="f7" line="6351" offset="384"/>
  <Field id="_5309" name="imageExtent" type="_374" context="_1352" access="public" location="f7:6352" file="f7" line="6352" offset="416"/>
  <ElaboratedType id="_5310" type="_1352"/>
  <PointerType id="_5311" type="_8052" size="64" align="64"/>
  <PointerType id="_5312" type="_8053" size="64" align="64"/>
  <PointerType id="_5313" type="_8054" size="64" align="64"/>
  <PointerType id="_5314" type="_8055" size="64" align="64"/>
  <PointerType id="_5315" type="_8056" size="64" align="64"/>
  <PointerType id="_5316" type="_8057" size="64" align="64"/>
  <PointerType id="_5317" type="_8058" size="64" align="64"/>
  <PointerType id="_5318" type="_1351" size="64" align="64"/>
  <PointerType id="_5319" type="_1349" size="64" align="64"/>
  <PointerType id="_5320" type="_1332" size="64" align="64"/>
  <PointerType id="_5321" type="_1345" size="64" align="64"/>
  <PointerType id="_5322" type="_1343c" size="64" align="64"/>
  <CvQualifiedType id="_1343c" type="_1343" const="1"/>
  <PointerType id="_5323" type="_1334" size="64" align="64"/>
  <PointerType id="_5324" type="_1347" size="64" align="64"/>
  <PointerType id="_5325" type="_1353c" size="64" align="64"/>
  <CvQualifiedType id="_1353c" type="_1353" const="1"/>
  <PointerType id="_5326" type="_1264" size="64" align="64"/>
  <Field id="_5327" name="sType" type="_162" context="_1368" access="public" location="f7:6411" file="f7" line="6411" offset="0"/>
  <Field id="_5328" name="pNext" type="_4239" context="_1368" access="public" location="f7:6412" file="f7" line="6412" offset="64"/>
  <Field id="_5329" name="srcRect" type="_382" context="_1368" access="public" location="f7:6413" file="f7" line="6413" offset="128"/>
  <Field id="_5330" name="dstRect" type="_382" context="_1368" access="public" location="f7:6414" file="f7" line="6414" offset="256"/>
  <Field id="_5331" name="persistent" type="_104" context="_1368" access="public" location="f7:6415" file="f7" line="6415" offset="384"/>
  <ElaboratedType id="_5332" type="_1368"/>
  <PointerType id="_5333" type="_8059" size="64" align="64"/>
  <Field id="_5334" name="sType" type="_162" context="_1437" access="public" location="f7:6651" file="f7" line="6651" offset="0"/>
  <Field id="_5335" name="pNext" type="_4239" context="_1437" access="public" location="f7:6652" file="f7" line="6652" offset="64"/>
  <Field id="_5336" name="handleType" type="_901" context="_1437" access="public" location="f7:6653" file="f7" line="6653" offset="128"/>
  <Field id="_5337" name="fd" type="_3024" context="_1437" access="public" location="f7:6654" file="f7" line="6654" offset="160"/>
  <ElaboratedType id="_5338" type="_1437"/>
  <Field id="_5339" name="sType" type="_162" context="_1439" access="public" location="f7:6658" file="f7" line="6658" offset="0"/>
  <Field id="_5340" name="pNext" type="_3035" context="_1439" access="public" location="f7:6659" file="f7" line="6659" offset="64"/>
  <Field id="_5341" name="memoryTypeBits" type="_82" context="_1439" access="public" location="f7:6660" file="f7" line="6660" offset="128"/>
  <ElaboratedType id="_5342" type="_1439"/>
  <Field id="_5343" name="sType" type="_162" context="_1441" access="public" location="f7:6664" file="f7" line="6664" offset="0"/>
  <Field id="_5344" name="pNext" type="_4239" context="_1441" access="public" location="f7:6665" file="f7" line="6665" offset="64"/>
  <Field id="_5345" name="memory" type="_128" context="_1441" access="public" location="f7:6666" file="f7" line="6666" offset="128"/>
  <Field id="_5346" name="handleType" type="_901" context="_1441" access="public" location="f7:6667" file="f7" line="6667" offset="192"/>
  <ElaboratedType id="_5347" type="_1441"/>
  <PointerType id="_5348" type="_8060" size="64" align="64"/>
  <PointerType id="_5349" type="_8061" size="64" align="64"/>
  <PointerType id="_5350" type="_1442c" size="64" align="64"/>
  <CvQualifiedType id="_1442c" type="_1442" const="1"/>
  <PointerType id="_5351" type="_3024" size="64" align="64"/>
  <PointerType id="_5352" type="_1440" size="64" align="64"/>
  <Field id="_5353" name="sType" type="_162" context="_1458" access="public" location="f7:6727" file="f7" line="6727" offset="0"/>
  <Field id="_5354" name="pNext" type="_4239" context="_1458" access="public" location="f7:6728" file="f7" line="6728" offset="64"/>
  <Field id="_5355" name="semaphore" type="_122" context="_1458" access="public" location="f7:6729" file="f7" line="6729" offset="128"/>
  <Field id="_5356" name="flags" type="_917" context="_1458" access="public" location="f7:6730" file="f7" line="6730" offset="192"/>
  <Field id="_5357" name="handleType" type="_919" context="_1458" access="public" location="f7:6731" file="f7" line="6731" offset="224"/>
  <Field id="_5358" name="fd" type="_3024" context="_1458" access="public" location="f7:6732" file="f7" line="6732" offset="256"/>
  <ElaboratedType id="_5359" type="_1458"/>
  <Field id="_5360" name="sType" type="_162" context="_1460" access="public" location="f7:6736" file="f7" line="6736" offset="0"/>
  <Field id="_5361" name="pNext" type="_4239" context="_1460" access="public" location="f7:6737" file="f7" line="6737" offset="64"/>
  <Field id="_5362" name="semaphore" type="_122" context="_1460" access="public" location="f7:6738" file="f7" line="6738" offset="128"/>
  <Field id="_5363" name="handleType" type="_919" context="_1460" access="public" location="f7:6739" file="f7" line="6739" offset="192"/>
  <ElaboratedType id="_5364" type="_1460"/>
  <PointerType id="_5365" type="_8062" size="64" align="64"/>
  <PointerType id="_5366" type="_8063" size="64" align="64"/>
  <PointerType id="_5367" type="_1459c" size="64" align="64"/>
  <CvQualifiedType id="_1459c" type="_1459" const="1"/>
  <PointerType id="_5368" type="_1461c" size="64" align="64"/>
  <CvQualifiedType id="_1461c" type="_1461" const="1"/>
  <Field id="_5369" name="sType" type="_162" context="_1466" access="public" location="f7:6761" file="f7" line="6761" offset="0"/>
  <Field id="_5370" name="pNext" type="_3035" context="_1466" access="public" location="f7:6762" file="f7" line="6762" offset="64"/>
  <Field id="_5371" name="maxPushDescriptors" type="_82" context="_1466" access="public" location="f7:6763" file="f7" line="6763" offset="128"/>
  <ElaboratedType id="_5372" type="_1466"/>
  <PointerType id="_5373" type="_8064" size="64" align="64"/>
  <PointerType id="_5374" type="_8065" size="64" align="64"/>
  <Field id="_5375" name="offset" type="_378" context="_1475" access="public" location="f7:6807" file="f7" line="6807" offset="0"/>
  <Field id="_5376" name="extent" type="_374" context="_1475" access="public" location="f7:6808" file="f7" line="6808" offset="64"/>
  <Field id="_5377" name="layer" type="_82" context="_1475" access="public" location="f7:6809" file="f7" line="6809" offset="128"/>
  <ElaboratedType id="_5378" type="_1475"/>
  <Field id="_5379" name="rectangleCount" type="_82" context="_1477" access="public" location="f7:6813" file="f7" line="6813" offset="0"/>
  <Field id="_5380" name="pRectangles" type="_8066" context="_1477" access="public" location="f7:6814" file="f7" line="6814" offset="64"/>
  <ElaboratedType id="_5381" type="_1477"/>
  <Field id="_5382" name="sType" type="_162" context="_1479" access="public" location="f7:6818" file="f7" line="6818" offset="0"/>
  <Field id="_5383" name="pNext" type="_4239" context="_1479" access="public" location="f7:6819" file="f7" line="6819" offset="64"/>
  <Field id="_5384" name="swapchainCount" type="_82" context="_1479" access="public" location="f7:6820" file="f7" line="6820" offset="128"/>
  <Field id="_5385" name="pRegions" type="_8067" context="_1479" access="public" location="f7:6821" file="f7" line="6821" offset="192"/>
  <ElaboratedType id="_5386" type="_1479"/>
  <Field id="_5387" name="sType" type="_162" context="_1511" access="public" location="f7:6925" file="f7" line="6925" offset="0"/>
  <Field id="_5388" name="pNext" type="_3035" context="_1511" access="public" location="f7:6926" file="f7" line="6926" offset="64"/>
  <Field id="_5389" name="sharedPresentSupportedUsageFlags" type="_250" context="_1511" access="public" location="f7:6927" file="f7" line="6927" offset="128"/>
  <ElaboratedType id="_5390" type="_1511"/>
  <PointerType id="_5391" type="_8068" size="64" align="64"/>
  <Field id="_5392" name="sType" type="_162" context="_1526" access="public" location="f7:6979" file="f7" line="6979" offset="0"/>
  <Field id="_5393" name="pNext" type="_4239" context="_1526" access="public" location="f7:6980" file="f7" line="6980" offset="64"/>
  <Field id="_5394" name="fence" type="_126" context="_1526" access="public" location="f7:6981" file="f7" line="6981" offset="128"/>
  <Field id="_5395" name="flags" type="_914" context="_1526" access="public" location="f7:6982" file="f7" line="6982" offset="192"/>
  <Field id="_5396" name="handleType" type="_907" context="_1526" access="public" location="f7:6983" file="f7" line="6983" offset="224"/>
  <Field id="_5397" name="fd" type="_3024" context="_1526" access="public" location="f7:6984" file="f7" line="6984" offset="256"/>
  <ElaboratedType id="_5398" type="_1526"/>
  <Field id="_5399" name="sType" type="_162" context="_1528" access="public" location="f7:6988" file="f7" line="6988" offset="0"/>
  <Field id="_5400" name="pNext" type="_4239" context="_1528" access="public" location="f7:6989" file="f7" line="6989" offset="64"/>
  <Field id="_5401" name="fence" type="_126" context="_1528" access="public" location="f7:6990" file="f7" line="6990" offset="128"/>
  <Field id="_5402" name="handleType" type="_907" context="_1528" access="public" location="f7:6991" file="f7" line="6991" offset="192"/>
  <ElaboratedType id="_5403" type="_1528"/>
  <PointerType id="_5404" type="_8069" size="64" align="64"/>
  <PointerType id="_5405" type="_8070" size="64" align="64"/>
  <PointerType id="_5406" type="_1527c" size="64" align="64"/>
  <CvQualifiedType id="_1527c" type="_1527" const="1"/>
  <PointerType id="_5407" type="_1529c" size="64" align="64"/>
  <CvQualifiedType id="_1529c" type="_1529" const="1"/>
  <ElaboratedType id="_5408" type="_1534"/>
  <ElaboratedType id="_5409" type="_1536"/>
  <ElaboratedType id="_5410" type="_1538"/>
  <ElaboratedType id="_5411" type="_1540"/>
  <ElaboratedType id="_5412" type="_1543"/>
  <Field id="_5413" name="sType" type="_162" context="_1546" access="public" location="f7:7062" file="f7" line="7062" offset="0"/>
  <Field id="_5414" name="pNext" type="_3035" context="_1546" access="public" location="f7:7063" file="f7" line="7063" offset="64"/>
  <Field id="_5415" name="performanceCounterQueryPools" type="_104" context="_1546" access="public" location="f7:7064" file="f7" line="7064" offset="128"/>
  <Field id="_5416" name="performanceCounterMultipleQueryPools" type="_104" context="_1546" access="public" location="f7:7065" file="f7" line="7065" offset="160"/>
  <ElaboratedType id="_5417" type="_1546"/>
  <Field id="_5418" name="sType" type="_162" context="_1548" access="public" location="f7:7069" file="f7" line="7069" offset="0"/>
  <Field id="_5419" name="pNext" type="_3035" context="_1548" access="public" location="f7:7070" file="f7" line="7070" offset="64"/>
  <Field id="_5420" name="allowCommandBufferQueryCopies" type="_104" context="_1548" access="public" location="f7:7071" file="f7" line="7071" offset="128"/>
  <ElaboratedType id="_5421" type="_1548"/>
  <Field id="_5422" name="sType" type="_162" context="_1550" access="public" location="f7:7075" file="f7" line="7075" offset="0"/>
  <Field id="_5423" name="pNext" type="_3035" context="_1550" access="public" location="f7:7076" file="f7" line="7076" offset="64"/>
  <Field id="_5424" name="unit" type="_1535" context="_1550" access="public" location="f7:7077" file="f7" line="7077" offset="128"/>
  <Field id="_5425" name="scope" type="_1537" context="_1550" access="public" location="f7:7078" file="f7" line="7078" offset="160"/>
  <Field id="_5426" name="storage" type="_1539" context="_1550" access="public" location="f7:7079" file="f7" line="7079" offset="192"/>
  <Field id="_5427" name="uuid" type="_7788" context="_1550" access="public" location="f7:7080" file="f7" line="7080" offset="224"/>
  <ElaboratedType id="_5428" type="_1550"/>
  <Field id="_5429" name="sType" type="_162" context="_1552" access="public" location="f7:7084" file="f7" line="7084" offset="0"/>
  <Field id="_5430" name="pNext" type="_3035" context="_1552" access="public" location="f7:7085" file="f7" line="7085" offset="64"/>
  <Field id="_5431" name="flags" type="_1542" context="_1552" access="public" location="f7:7086" file="f7" line="7086" offset="128"/>
  <Field id="_5432" name="name" type="_7801" context="_1552" access="public" location="f7:7087" file="f7" line="7087" offset="160"/>
  <Field id="_5433" name="category" type="_7801" context="_1552" access="public" location="f7:7088" file="f7" line="7088" offset="2208"/>
  <Field id="_5434" name="description" type="_7801" context="_1552" access="public" location="f7:7089" file="f7" line="7089" offset="4256"/>
  <ElaboratedType id="_5435" type="_1552"/>
  <Field id="_5436" name="sType" type="_162" context="_1554" access="public" location="f7:7093" file="f7" line="7093" offset="0"/>
  <Field id="_5437" name="pNext" type="_4239" context="_1554" access="public" location="f7:7094" file="f7" line="7094" offset="64"/>
  <Field id="_5438" name="queueFamilyIndex" type="_82" context="_1554" access="public" location="f7:7095" file="f7" line="7095" offset="128"/>
  <Field id="_5439" name="counterIndexCount" type="_82" context="_1554" access="public" location="f7:7096" file="f7" line="7096" offset="160"/>
  <Field id="_5440" name="pCounterIndices" type="_4232" context="_1554" access="public" location="f7:7097" file="f7" line="7097" offset="192"/>
  <ElaboratedType id="_5441" type="_1554"/>
  <Field id="_5442" name="int32" type="_78" context="_1556" access="public" location="f7:7101" file="f7" line="7101" offset="0"/>
  <Field id="_5443" name="int64" type="_79" context="_1556" access="public" location="f7:7102" file="f7" line="7102" offset="0"/>
  <Field id="_5444" name="uint32" type="_82" context="_1556" access="public" location="f7:7103" file="f7" line="7103" offset="0"/>
  <Field id="_5445" name="uint64" type="_83" context="_1556" access="public" location="f7:7104" file="f7" line="7104" offset="0"/>
  <Field id="_5446" name="float32" type="_4229" context="_1556" access="public" location="f7:7105" file="f7" line="7105" offset="0"/>
  <Field id="_5447" name="float64" type="_8071" context="_1556" access="public" location="f7:7106" file="f7" line="7106" offset="0"/>
  <ElaboratedType id="_5448" type="_1556"/>
  <Field id="_5449" name="sType" type="_162" context="_1558" access="public" location="f7:7110" file="f7" line="7110" offset="0"/>
  <Field id="_5450" name="pNext" type="_4239" context="_1558" access="public" location="f7:7111" file="f7" line="7111" offset="64"/>
  <Field id="_5451" name="flags" type="_1545" context="_1558" access="public" location="f7:7112" file="f7" line="7112" offset="128"/>
  <Field id="_5452" name="timeout" type="_83" context="_1558" access="public" location="f7:7113" file="f7" line="7113" offset="192"/>
  <ElaboratedType id="_5453" type="_1558"/>
  <Field id="_5454" name="sType" type="_162" context="_1560" access="public" location="f7:7117" file="f7" line="7117" offset="0"/>
  <Field id="_5455" name="pNext" type="_4239" context="_1560" access="public" location="f7:7118" file="f7" line="7118" offset="64"/>
  <Field id="_5456" name="counterPassIndex" type="_82" context="_1560" access="public" location="f7:7119" file="f7" line="7119" offset="128"/>
  <ElaboratedType id="_5457" type="_1560"/>
  <PointerType id="_5458" type="_8072" size="64" align="64"/>
  <PointerType id="_5459" type="_8073" size="64" align="64"/>
  <PointerType id="_5460" type="_8074" size="64" align="64"/>
  <PointerType id="_5461" type="_8075" size="64" align="64"/>
  <PointerType id="_5462" type="_1551" size="64" align="64"/>
  <PointerType id="_5463" type="_1553" size="64" align="64"/>
  <PointerType id="_5464" type="_1555c" size="64" align="64"/>
  <CvQualifiedType id="_1555c" type="_1555" const="1"/>
  <PointerType id="_5465" type="_1559c" size="64" align="64"/>
  <CvQualifiedType id="_1559c" type="_1559" const="1"/>
  <Field id="_5466" name="sType" type="_162" context="_1577" access="public" location="f7:7172" file="f7" line="7172" offset="0"/>
  <Field id="_5467" name="pNext" type="_4239" context="_1577" access="public" location="f7:7173" file="f7" line="7173" offset="64"/>
  <Field id="_5468" name="surface" type="_1264" context="_1577" access="public" location="f7:7174" file="f7" line="7174" offset="128"/>
  <ElaboratedType id="_5469" type="_1577"/>
  <Field id="_5470" name="sType" type="_162" context="_1579" access="public" location="f7:7178" file="f7" line="7178" offset="0"/>
  <Field id="_5471" name="pNext" type="_3035" context="_1579" access="public" location="f7:7179" file="f7" line="7179" offset="64"/>
  <Field id="_5472" name="surfaceCapabilities" type="_1276" context="_1579" access="public" location="f7:7180" file="f7" line="7180" offset="128"/>
  <ElaboratedType id="_5473" type="_1579"/>
  <Field id="_5474" name="sType" type="_162" context="_1581" access="public" location="f7:7184" file="f7" line="7184" offset="0"/>
  <Field id="_5475" name="pNext" type="_3035" context="_1581" access="public" location="f7:7185" file="f7" line="7185" offset="64"/>
  <Field id="_5476" name="surfaceFormat" type="_1278" context="_1581" access="public" location="f7:7186" file="f7" line="7186" offset="128"/>
  <ElaboratedType id="_5477" type="_1581"/>
  <PointerType id="_5478" type="_8076" size="64" align="64"/>
  <PointerType id="_5479" type="_8077" size="64" align="64"/>
  <PointerType id="_5480" type="_1578c" size="64" align="64"/>
  <CvQualifiedType id="_1578c" type="_1578" const="1"/>
  <PointerType id="_5481" type="_1580" size="64" align="64"/>
  <PointerType id="_5482" type="_1582" size="64" align="64"/>
  <Field id="_5483" name="sType" type="_162" context="_1589" access="public" location="f7:7219" file="f7" line="7219" offset="0"/>
  <Field id="_5484" name="pNext" type="_3035" context="_1589" access="public" location="f7:7220" file="f7" line="7220" offset="64"/>
  <Field id="_5485" name="displayProperties" type="_1351" context="_1589" access="public" location="f7:7221" file="f7" line="7221" offset="128"/>
  <ElaboratedType id="_5486" type="_1589"/>
  <Field id="_5487" name="sType" type="_162" context="_1591" access="public" location="f7:7225" file="f7" line="7225" offset="0"/>
  <Field id="_5488" name="pNext" type="_3035" context="_1591" access="public" location="f7:7226" file="f7" line="7226" offset="64"/>
  <Field id="_5489" name="displayPlaneProperties" type="_1349" context="_1591" access="public" location="f7:7227" file="f7" line="7227" offset="128"/>
  <ElaboratedType id="_5490" type="_1591"/>
  <Field id="_5491" name="sType" type="_162" context="_1593" access="public" location="f7:7231" file="f7" line="7231" offset="0"/>
  <Field id="_5492" name="pNext" type="_3035" context="_1593" access="public" location="f7:7232" file="f7" line="7232" offset="64"/>
  <Field id="_5493" name="displayModeProperties" type="_1345" context="_1593" access="public" location="f7:7233" file="f7" line="7233" offset="128"/>
  <ElaboratedType id="_5494" type="_1593"/>
  <Field id="_5495" name="sType" type="_162" context="_1595" access="public" location="f7:7237" file="f7" line="7237" offset="0"/>
  <Field id="_5496" name="pNext" type="_4239" context="_1595" access="public" location="f7:7238" file="f7" line="7238" offset="64"/>
  <Field id="_5497" name="mode" type="_1334" context="_1595" access="public" location="f7:7239" file="f7" line="7239" offset="128"/>
  <Field id="_5498" name="planeIndex" type="_82" context="_1595" access="public" location="f7:7240" file="f7" line="7240" offset="192"/>
  <ElaboratedType id="_5499" type="_1595"/>
  <Field id="_5500" name="sType" type="_162" context="_1597" access="public" location="f7:7244" file="f7" line="7244" offset="0"/>
  <Field id="_5501" name="pNext" type="_3035" context="_1597" access="public" location="f7:7245" file="f7" line="7245" offset="64"/>
  <Field id="_5502" name="capabilities" type="_1347" context="_1597" access="public" location="f7:7246" file="f7" line="7246" offset="128"/>
  <ElaboratedType id="_5503" type="_1597"/>
  <PointerType id="_5504" type="_8078" size="64" align="64"/>
  <PointerType id="_5505" type="_8079" size="64" align="64"/>
  <PointerType id="_5506" type="_8080" size="64" align="64"/>
  <PointerType id="_5507" type="_8081" size="64" align="64"/>
  <PointerType id="_5508" type="_1590" size="64" align="64"/>
  <PointerType id="_5509" type="_1592" size="64" align="64"/>
  <PointerType id="_5510" type="_1594" size="64" align="64"/>
  <PointerType id="_5511" type="_1596c" size="64" align="64"/>
  <CvQualifiedType id="_1596c" type="_1596" const="1"/>
  <PointerType id="_5512" type="_1598" size="64" align="64"/>
  <Field id="_5513" name="sType" type="_162" context="_1652" access="public" location="f7:7472" file="f7" line="7472" offset="0"/>
  <Field id="_5514" name="pNext" type="_3035" context="_1652" access="public" location="f7:7473" file="f7" line="7473" offset="64"/>
  <Field id="_5515" name="shaderSubgroupClock" type="_104" context="_1652" access="public" location="f7:7474" file="f7" line="7474" offset="128"/>
  <Field id="_5516" name="shaderDeviceClock" type="_104" context="_1652" access="public" location="f7:7475" file="f7" line="7475" offset="160"/>
  <ElaboratedType id="_5517" type="_1652"/>
  <Field id="_5518" name="sType" type="_162" context="_1679" access="public" location="f7:7573" file="f7" line="7573" offset="0"/>
  <Field id="_5519" name="pNext" type="_3035" context="_1679" access="public" location="f7:7574" file="f7" line="7574" offset="64"/>
  <Field id="_5520" name="shaderTerminateInvocation" type="_104" context="_1679" access="public" location="f7:7575" file="f7" line="7575" offset="128"/>
  <ElaboratedType id="_5521" type="_1679"/>
  <ElaboratedType id="_5522" type="_1681"/>
  <Field id="_5523" name="sType" type="_162" context="_1683" access="public" location="f7:7593" file="f7" line="7593" offset="0"/>
  <Field id="_5524" name="pNext" type="_4239" context="_1683" access="public" location="f7:7594" file="f7" line="7594" offset="64"/>
  <Field id="_5525" name="pFragmentShadingRateAttachment" type="_8013" context="_1683" access="public" location="f7:7595" file="f7" line="7595" offset="128"/>
  <Field id="_5526" name="shadingRateAttachmentTexelSize" type="_374" context="_1683" access="public" location="f7:7596" file="f7" line="7596" offset="192"/>
  <ElaboratedType id="_5527" type="_1683"/>
  <Field id="_5528" name="sType" type="_162" context="_1685" access="public" location="f7:7600" file="f7" line="7600" offset="0"/>
  <Field id="_5529" name="pNext" type="_4239" context="_1685" access="public" location="f7:7601" file="f7" line="7601" offset="64"/>
  <Field id="_5530" name="fragmentSize" type="_374" context="_1685" access="public" location="f7:7602" file="f7" line="7602" offset="128"/>
  <Field id="_5531" name="combinerOps" type="_8082" context="_1685" access="public" location="f7:7603" file="f7" line="7603" offset="192"/>
  <ElaboratedType id="_5532" type="_1685"/>
  <Field id="_5533" name="sType" type="_162" context="_1687" access="public" location="f7:7607" file="f7" line="7607" offset="0"/>
  <Field id="_5534" name="pNext" type="_3035" context="_1687" access="public" location="f7:7608" file="f7" line="7608" offset="64"/>
  <Field id="_5535" name="pipelineFragmentShadingRate" type="_104" context="_1687" access="public" location="f7:7609" file="f7" line="7609" offset="128"/>
  <Field id="_5536" name="primitiveFragmentShadingRate" type="_104" context="_1687" access="public" location="f7:7610" file="f7" line="7610" offset="160"/>
  <Field id="_5537" name="attachmentFragmentShadingRate" type="_104" context="_1687" access="public" location="f7:7611" file="f7" line="7611" offset="192"/>
  <ElaboratedType id="_5538" type="_1687"/>
  <Field id="_5539" name="sType" type="_162" context="_1689" access="public" location="f7:7615" file="f7" line="7615" offset="0"/>
  <Field id="_5540" name="pNext" type="_3035" context="_1689" access="public" location="f7:7616" file="f7" line="7616" offset="64"/>
  <Field id="_5541" name="minFragmentShadingRateAttachmentTexelSize" type="_374" context="_1689" access="public" location="f7:7617" file="f7" line="7617" offset="128"/>
  <Field id="_5542" name="maxFragmentShadingRateAttachmentTexelSize" type="_374" context="_1689" access="public" location="f7:7618" file="f7" line="7618" offset="192"/>
  <Field id="_5543" name="maxFragmentShadingRateAttachmentTexelSizeAspectRatio" type="_82" context="_1689" access="public" location="f7:7619" file="f7" line="7619" offset="256"/>
  <Field id="_5544" name="primitiveFragmentShadingRateWithMultipleViewports" type="_104" context="_1689" access="public" location="f7:7620" file="f7" line="7620" offset="288"/>
  <Field id="_5545" name="layeredShadingRateAttachments" type="_104" context="_1689" access="public" location="f7:7621" file="f7" line="7621" offset="320"/>
  <Field id="_5546" name="fragmentShadingRateNonTrivialCombinerOps" type="_104" context="_1689" access="public" location="f7:7622" file="f7" line="7622" offset="352"/>
  <Field id="_5547" name="maxFragmentSize" type="_374" context="_1689" access="public" location="f7:7623" file="f7" line="7623" offset="384"/>
  <Field id="_5548" name="maxFragmentSizeAspectRatio" type="_82" context="_1689" access="public" location="f7:7624" file="f7" line="7624" offset="448"/>
  <Field id="_5549" name="maxFragmentShadingRateCoverageSamples" type="_82" context="_1689" access="public" location="f7:7625" file="f7" line="7625" offset="480"/>
  <Field id="_5550" name="maxFragmentShadingRateRasterizationSamples" type="_246" context="_1689" access="public" location="f7:7626" file="f7" line="7626" offset="512"/>
  <Field id="_5551" name="fragmentShadingRateWithShaderDepthStencilWrites" type="_104" context="_1689" access="public" location="f7:7627" file="f7" line="7627" offset="544"/>
  <Field id="_5552" name="fragmentShadingRateWithSampleMask" type="_104" context="_1689" access="public" location="f7:7628" file="f7" line="7628" offset="576"/>
  <Field id="_5553" name="fragmentShadingRateWithShaderSampleMask" type="_104" context="_1689" access="public" location="f7:7629" file="f7" line="7629" offset="608"/>
  <Field id="_5554" name="fragmentShadingRateWithConservativeRasterization" type="_104" context="_1689" access="public" location="f7:7630" file="f7" line="7630" offset="640"/>
  <Field id="_5555" name="fragmentShadingRateWithFragmentShaderInterlock" type="_104" context="_1689" access="public" location="f7:7631" file="f7" line="7631" offset="672"/>
  <Field id="_5556" name="fragmentShadingRateWithCustomSampleLocations" type="_104" context="_1689" access="public" location="f7:7632" file="f7" line="7632" offset="704"/>
  <Field id="_5557" name="fragmentShadingRateStrictMultiplyCombiner" type="_104" context="_1689" access="public" location="f7:7633" file="f7" line="7633" offset="736"/>
  <ElaboratedType id="_5558" type="_1689"/>
  <Field id="_5559" name="sType" type="_162" context="_1691" access="public" location="f7:7637" file="f7" line="7637" offset="0"/>
  <Field id="_5560" name="pNext" type="_3035" context="_1691" access="public" location="f7:7638" file="f7" line="7638" offset="64"/>
  <Field id="_5561" name="sampleCounts" type="_247" context="_1691" access="public" location="f7:7639" file="f7" line="7639" offset="128"/>
  <Field id="_5562" name="fragmentSize" type="_374" context="_1691" access="public" location="f7:7640" file="f7" line="7640" offset="160"/>
  <ElaboratedType id="_5563" type="_1691"/>
  <PointerType id="_5564" type="_8083" size="64" align="64"/>
  <PointerType id="_5565" type="_8084" size="64" align="64"/>
  <PointerType id="_5566" type="_1692" size="64" align="64"/>
  <PointerType id="_5567" type="_374c" size="64" align="64"/>
  <CvQualifiedType id="_374c" type="_374" const="1"/>
  <PointerType id="_5568" type="_1682c" size="64" align="64"/>
  <CvQualifiedType id="_1682c" type="_1682" const="1"/>
  <ArrayType id="_5569" min="0" max="1" type="_1682c"/>
  <Field id="_5570" name="sType" type="_162" context="_1697" access="public" location="f7:7668" file="f7" line="7668" offset="0"/>
  <Field id="_5571" name="pNext" type="_4239" context="_1697" access="public" location="f7:7669" file="f7" line="7669" offset="64"/>
  <Field id="_5572" name="supportsProtected" type="_104" context="_1697" access="public" location="f7:7670" file="f7" line="7670" offset="128"/>
  <ElaboratedType id="_5573" type="_1697"/>
  <Field id="_5574" name="sType" type="_162" context="_1702" access="public" location="f7:7690" file="f7" line="7690" offset="0"/>
  <Field id="_5575" name="pNext" type="_3035" context="_1702" access="public" location="f7:7691" file="f7" line="7691" offset="64"/>
  <Field id="_5576" name="presentWait" type="_104" context="_1702" access="public" location="f7:7692" file="f7" line="7692" offset="128"/>
  <ElaboratedType id="_5577" type="_1702"/>
  <PointerType id="_5578" type="_8085" size="64" align="64"/>
  <PointerType id="_5579" type="_8086" size="64" align="64"/>
  <PointerType id="_5580" type="_8087" size="64" align="64"/>
  <PointerType id="_5581" type="_8088" size="64" align="64"/>
  <PointerType id="_5582" type="_8089" size="64" align="64"/>
  <PointerType id="_5583" type="_8090" size="64" align="64"/>
  <PointerType id="_5584" type="_1719" size="64" align="64"/>
  <ElaboratedType id="_5585" type="_1730"/>
  <Field id="_5586" name="sType" type="_162" context="_1732" access="public" location="f7:7792" file="f7" line="7792" offset="0"/>
  <Field id="_5587" name="pNext" type="_3035" context="_1732" access="public" location="f7:7793" file="f7" line="7793" offset="64"/>
  <Field id="_5588" name="pipelineExecutableInfo" type="_104" context="_1732" access="public" location="f7:7794" file="f7" line="7794" offset="128"/>
  <ElaboratedType id="_5589" type="_1732"/>
  <Field id="_5590" name="sType" type="_162" context="_1734" access="public" location="f7:7798" file="f7" line="7798" offset="0"/>
  <Field id="_5591" name="pNext" type="_4239" context="_1734" access="public" location="f7:7799" file="f7" line="7799" offset="64"/>
  <Field id="_5592" name="pipeline" type="_144" context="_1734" access="public" location="f7:7800" file="f7" line="7800" offset="128"/>
  <ElaboratedType id="_5593" type="_1734"/>
  <Field id="_5594" name="sType" type="_162" context="_1736" access="public" location="f7:7804" file="f7" line="7804" offset="0"/>
  <Field id="_5595" name="pNext" type="_3035" context="_1736" access="public" location="f7:7805" file="f7" line="7805" offset="64"/>
  <Field id="_5596" name="stages" type="_329" context="_1736" access="public" location="f7:7806" file="f7" line="7806" offset="128"/>
  <Field id="_5597" name="name" type="_7801" context="_1736" access="public" location="f7:7807" file="f7" line="7807" offset="160"/>
